
Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда
		Если НЕ ЗначениеЗаполнено(ПараметрОбъектКопирования) Тогда
			ИнформационнаяБаза = ?(глВерсия=1, Неопределено, ПараметрыСеанса.ТекущаяИБ);
			ШаблонНаименования = "Стол № [Место.Номер]";
		КонецЕсли;
		
		УстановитьКодВнутриИБ();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если НЕ ПараметрыСеанса.РаспределенныйРежим Тогда
		ЭлементыФормы.ИнформационнаяБаза.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ИнформационнаяБазаНажатие(Элемент)
	
	ВыбЭлемент = ИнтерфейсАдмина.ИнфБазаВыбратьИзСписка(ЭтаФорма, Элемент);
	Если ВыбЭлемент <> Неопределено Тогда
		ИнформационнаяБаза = ВыбЭлемент.Значение;
		УстановитьКодВнутриИБ();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПолеВыбораПараметраОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = "Типовой ШАБЛОН" Тогда
		ШаблонНаименования = "Стол №[Место.Номер]";
	Иначе	
		ШаблонНаименования = ШаблонНаименования+"["+ВыбранноеЗначение+"]";
	КонецЕсли;

КонецПроцедуры

Процедура ПереименоватьМестаПоШаблону(Кнопка)
	
	ПерезаполнениеНаименованийМестПоШаблону();
	
КонецПроцедуры
