#Если Клиент Тогда
	Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна
	Перем ТабДок Экспорт;
	Перем Заголовок Экспорт;
	Перем Форма;
	Перем AutohotkeyDll Экспорт;

	// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
	// Вызывается каждый раз при обращении к объекту обработки.
	// Здесь надо прописать сброс переменных в начальные значения
	// Реквизиты и табличные части уже сброшены
	Процедура УстановкаНачальныхЗначений() Экспорт
		
	КонецПроцедуры
	
	////////////////////////////////////////////////////////////////////////////////
	// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
	
	// Вызывается из обработчика ПередОткрытием форм этой обработки,
	// выполняет инициализацию рабочего места
	//
	Процедура ДействияПередОткрытиемФормы(ТекущаяФорма, Отказ) Экспорт
		
		Форма = ТекущаяФорма;
		
		Форма.ЭлементыФормы.ПолеТабДок.Очистить();
		Форма.ЭлементыФормы.ПолеТабДок.Вывести(ТабДок);
		Форма.ЭлементыФормы.НадписьЗаголовок.Заголовок = Заголовок;
		
	КонецПроцедуры
	
	////////////////////////////////////////////////////////////////////////////////
	// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
	Процедура ОК() Экспорт
		
		Форма.Закрыть();
		
	КонецПроцедуры
	
	////////////////////////////////////////////////////////////////////////////////
	////////////////////////////////////////////////////////////////////////////////
	
	ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
	Попытка
		AutohotkeyDll = РаботаСокнами.AHK();
	Исключение
	КонецПопытки;
#КонецЕсли
