
Процедура ДействияФормыСформировать(Кнопка)
	
	Обработки.ФормированиеОтчетовФО.ПолучитьФорму().Открыть();
	
КонецПроцедуры

Процедура ДействияФормыВыгрузить(Кнопка)
	
	Обработки.УниверсальныйОбменДаннымиXML.ПолучитьФорму().Открыть();
	
КонецПроцедуры

Процедура ДокументСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ОформлениеСтроки.Ячейки.РучноеИзменение.ОтображатьТекст = Ложь;
	Если ДанныеСтроки.РучноеИзменение Тогда
		ОформлениеСтроки.Ячейки.РучноеИзменение.УстановитьКартинку(БиблиотекаКартинок.ВосклицательныйЗнак);
	Иначе
		ОформлениеСтроки.Ячейки.РучноеИзменение.ОтображатьКартинку = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

ДокументСписок.Отбор.пометкаУдаления.Установить(Ложь);