#Если Клиент Тогда
Перем Форма Экспорт;
// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
	
	
КонецПроцедуры

// Вызывается из обработчика ПередОткрытием форм этой обработки,
// выполняет инициализацию рабочего места
//
Процедура ДействияПередОткрытиемФормы(ТекущаяФорма, Отказ) Экспорт
	
	Форма = ТекущаяФорма;
	
КонецПроцедуры

Функция ОтветНаВопрос() Экспорт
	Если Форма = Неопределено Тогда
		Форма = ПолучитьФорму("Форма" + глПараметрыРМ.ИнтерфейсТип);
	ИначеЕсли Форма.Открыта() Тогда
		Форма.Закрыть();			
	КонецЕсли;
	
	Возврат Форма.ОткрытьМодально();
	
КонецФункции

Функция Форма() Экспорт
	Если Форма = Неопределено Тогда
		Форма = ПолучитьФорму("Форма" + глПараметрыРМ.ИнтерфейсТип);
	ИначеЕсли Форма.Открыта() Тогда
		Форма.Закрыть();			
	КонецЕсли;
	
	Возврат Форма;
КонецФункции

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные) Экспорт
	
	Если НЕ Форма.ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
		
	_Знач = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник,Событие,Данные);
	
	Если РазрешитьВнешнееСобытие И ЗначениеЗаполнено(_Знач) Тогда
		Форма.Закрыть( _Знач );
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли