#Если Клиент Тогда
Перем Форма Экспорт;
// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
	
	
КонецПроцедуры

Функция ОтветНаВопрос() Экспорт
	Если Форма = Неопределено Тогда
		Форма = ПолучитьФорму("Форма" + глПараметрыРМ.ИнтерфейсТип);
	ИначеЕсли Форма.Открыта() Тогда
		Форма.Закрыть();			
	КонецЕсли;
	
	Возврат Форма.ОткрытьМодально();
	
КонецФункции

Функция Форма() Экспорт
	Если Форма = Неопределено Тогда
		Форма = ПолучитьФорму("Форма" + глПараметрыРМ.ИнтерфейсТип);
	ИначеЕсли Форма.Открыта() Тогда
		Форма.Закрыть();			
	КонецЕсли;
	
	Возврат Форма;
КонецФункции

#КонецЕсли