Функция ПолучитьСменуКассы(КассаНомер = Неопределено) Экспорт
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ВложенныйЗапрос.Ссылка,
	//|	ВложенныйЗапрос.МоментВремени КАК МоментВремени,
	//|	ВложенныйЗапрос.НомерСмены
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		Касса_ОткрытиеСмены.Ссылка КАК Ссылка,
	//|		Касса_ОткрытиеСмены.МоментВремени КАК МоментВремени,
	//|		Касса_ОткрытиеСмены.НомерСмены КАК НомерСмены
	//|	ИЗ
	//|		Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	//|	ГДЕ
	//|		НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	//|		И Касса_ОткрытиеСмены.РабочееМесто = &РабочееМесто
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Касса_ЗакрытиеСмены.Ссылка,
	//|		Касса_ЗакрытиеСмены.МоментВремени,
	//|		NULL
	//|	ИЗ
	//|		Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены
	//|	ГДЕ
	//|		НЕ Касса_ЗакрытиеСмены.ПометкаУдаления
	//|		И Касса_ЗакрытиеСмены.РабочееМесто = &РабочееМесто) КАК ВложенныйЗапрос
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	МоментВремени УБЫВ";
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СУММА(влож.открытий), 0) > ЕСТЬNULL(СУММА(влож.Закрытий), 0)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Рез,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СУММА(влож.открытий), 0) > ЕСТЬNULL(СУММА(влож.Закрытий), 0)
	               |			ТОГДА Касса_ОткрытиеСмены.Ссылка
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.Касса_ОткрытиеСмены.Пустаяссылка)
	               |	КОНЕЦ КАК Ссылка
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КОЛИЧЕСТВО(Касса_ОткрытиеСмены.Ссылка) КАК открытий,
	               |		NULL КАК Закрытий
	               |	ИЗ
	               |		Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	               |	ГДЕ
	               |		НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	               |		И Касса_ОткрытиеСмены.РабочееМесто = &РабочееМесто
	               |		И Касса_ОткрытиеСмены.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
				   |		И Касса_ОткрытиеСмены.КассаНомер = &КассаНомер
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		NULL,
	               |		КОЛИЧЕСТВО(Касса_ЗакрытиеСмены.Ссылка)
	               |	ИЗ
	               |		Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены
	               |	ГДЕ
	               |		НЕ Касса_ЗакрытиеСмены.ПометкаУдаления
	               |		И Касса_ЗакрытиеСмены.РабочееМесто = &РабочееМесто
	               |		И Касса_ЗакрытиеСмены.СменаКассы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
				   |		И Касса_ЗакрытиеСмены.СменаКассы.КассаНомер = &КассаНомер) КАК влож,
	               |	Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	               |ГДЕ
	               |	НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	               |	И Касса_ОткрытиеСмены.РабочееМесто = &РабочееМесто
	               |	И Касса_ОткрытиеСмены.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
				   |	И Касса_ОткрытиеСмены.КассаНомер = &КассаНомер
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Касса_ОткрытиеСмены.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Касса_ОткрытиеСмены.МоментВремени УБЫВ";
				   
	Запрос.УстановитьПараметр("РабочееМесто", глРабочееМесто);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Если КассаНомер = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Касса_ОткрытиеСмены.КассаНомер = &КассаНомер","И Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Касса_ЗакрытиеСмены.СменаКассы.КассаНомер = &КассаНомер","И Истина");
	Иначе
		Запрос.УстановитьПараметр("КассаНомер",КассаНомер);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	глПараметрыРМ = глПараметрыРМ;
	
	Если Выборка.Следующий() и не Выборка.Ссылка.Пустая() Тогда
	//Если Выборка.Следующий() И ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.Касса_ОткрытиеСмены") Тогда
		
		Если ТипЗнч(глПараметрыРМ) = Тип("Структура") Тогда
			глПараметрыРМ.Вставить("НомерСмены", Выборка.Ссылка.НомерСмены);
		КонецЕсли;
		Возврат Выборка.Ссылка;
	Иначе
		Если ТипЗнч(глПараметрыРМ) = Тип("Структура") Тогда
			глПараметрыРМ.Вставить("НомерСмены", 0);
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Документы.ОткрытиеСмены.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьСменуКассыПоНомеруКассы(Дата, НомерКассы) Экспорт
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ВложенныйЗапрос.Ссылка,
	//|	ВложенныйЗапрос.МоментВремени КАК МоментВремени
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		Касса_ОткрытиеСмены.Ссылка КАК Ссылка,
	//|		Касса_ОткрытиеСмены.МоментВремени КАК МоментВремени,
	//|		Касса_ОткрытиеСмены.Дата КАК Дата
	//|	ИЗ
	//|		Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	//|	ГДЕ
	//|		НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	//|		И Касса_ОткрытиеСмены.Касса.КодСУП = &НомерКассы
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Касса_ЗакрытиеСмены.Ссылка,
	//|		Касса_ЗакрытиеСмены.МоментВремени,
	//|		Касса_ЗакрытиеСмены.Дата
	//|	ИЗ
	//|		Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены
	//|	ГДЕ
	//|		НЕ Касса_ЗакрытиеСмены.ПометкаУдаления
	//|		И Касса_ЗакрытиеСмены.СменаКассы.Касса.КодСУП = &НомерКассы) КАК ВложенныйЗапрос
	//|ГДЕ
	//|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	МоментВремени УБЫВ";
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВЫБОР
	               |		КОГДА Касса_ЗакрытиеСмены.Ссылка ЕСТЬ NULL
	               |			ТОГДА Касса_ОткрытиеСмены.Ссылка
	               |		ИНАЧЕ Касса_ЗакрытиеСмены.Ссылка
	               |	КОНЕЦ КАК Ссылка,
	               |	Касса_ОткрытиеСмены.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены
	               |		ПО (Касса_ЗакрытиеСмены.СменаКассы = Касса_ОткрытиеСмены.Ссылка)
	               |			И (НЕ Касса_ОткрытиеСмены.ПометкаУдаления)
	               |ГДЕ
	               |	НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	               |	И Касса_ОткрытиеСмены.Касса.КодСУП = &НомерКассы
	               |	И НАЧАЛОПЕРИОДА(Касса_ОткрытиеСмены.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	               |	И НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МоментВремени УБЫВ";
	
	Запрос.УстановитьПараметр("НомерКассы", СокрЛП(НомерКассы));
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.Касса_ОткрытиеСмены") Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Документы.ОткрытиеСмены.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьПоследнююНеЗакрытуюСменуПоНомеру(НомерКассы,НомерСмены) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Касса_ОткрытиеСмены.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	               |ГДЕ
	               |	Касса_ОткрытиеСмены.КассаНомер = &КассаНомер
	               |	И Касса_ОткрытиеСмены.НомерСмены = &НомерСмены
				   //|	И НЕ Касса_ОткрытиеСмены.Ссылка В
				   //|				(ВЫБРАТЬ
				   //|					Касса_ЗакрытиеСмены.СменаКассы.Ссылка КАК СменаКассыСсылка
				   //|				ИЗ
				   //|					Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены)
	               |	И НЕ Касса_ОткрытиеСмены.ПометкаУдаления";
	Запрос.УстановитьПараметр("КассаНомер",НомерКассы);
	Запрос.УстановитьПараметр("НомерСмены",НомерСмены);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Документы.Касса_ОткрытиеСмены.ПустаяСсылка();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Ссылка;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ПолучитьДокументЗакрытияСмены(СменаКкм) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Касса_ЗакрытиеСмены.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены
	               |ГДЕ
	               |	НЕ Касса_ЗакрытиеСмены.ПометкаУдаления
	               |	И Касса_ЗакрытиеСмены.СменаКассы = &СменаКассы";
	Запрос.УстановитьПараметр("СменаКассы",СменаКкм);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Док = Документы.Касса_ЗакрытиеСмены.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.ОбменДанными.Загрузка = Истина;
		Док.Записать(РежимЗаписиДокумента.Запись);
		Возврат Док.Ссылка;
	КонецЕсли;
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
КонецФункции