Функция ПолучитьНомерПП(Элемент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ("ВЫБРАТЬ
	|	МАКСИМУМ(ЭлементыДиалогов.НомерПП) КАК МаксНомерПП
	|ИЗ
	|	Справочник.ЭлементыДиалогов КАК ЭлементыДиалогов
	|ГДЕ
	|	ЭлементыДиалогов.Родитель = &Родитель
	|	И ЭлементыДиалогов.Владелец = &Владелец
	|	И ЭлементыДиалогов.Ссылка <> &Ссылка");
	Запрос.УстановитьПараметр("Родитель", Элемент.Родитель);
	Запрос.УстановитьПараметр("Владелец", Элемент.Владелец);
	Запрос.УстановитьПараметр("Ссылка", Элемент);
	МаксНомерПП = Запрос.Выполнить().Выгрузить().Итог("МаксНомерПП");
	Если ЗначениеЗаполнено(МаксНомерПП) Тогда
		
		НомерПП = Число(МаксНомерПП) + 1;
		НомерПП = Прав("0000000"+НомерПП,7);
		
	Иначе
		
		НомерПП = "00000000";
			
	КонецЕсли; 
	
	Возврат НомерПП;
КонецФункции
	
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
		СтандартнаяОбработка=Ложь;
		
	Поля = Новый Массив;
	Поля.Добавить("Наименование");
	Поля.Добавить("НомерПП");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление = Данные.НомерПП + " " + Данные.Наименование;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
