
Процедура УправлениеДоступностью()
	
	Если РежимПереформирования Тогда
		ЭлементыФормы.ПанельПериод.ТекущаяСтраница = ЭлементыФормы.ПанельПериод.Страницы.Период;
	Иначе	
		ЭлементыФормы.ПанельПериод.ТекущаяСтраница = ЭлементыФормы.ПанельПериод.Страницы.Новые;
	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ПриОткрытии()
	
	Период = "Выберите период...";
	
	СохрСписокМР = ВосстановитьЗначение("СписокМестРеализации");
	Если СохрСписокМР = Неопределено Тогда
		СохрСписокМР = Новый СписокЗначений;
	КонецЕсли; 
	
	Выборка = Справочники.МестаРеализации.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ПометкаУдаления Тогда
			СохрЗнач = СохрСписокМР.НайтиПоЗначению(Выборка.Ссылка);
			Пометка = ?(СохрЗнач = Неопределено, Истина, СохрЗнач.Пометка);
			СписокМестРеализации.Добавить(Выборка.Ссылка,,Пометка);
		КонецЕсли; 
	КонецЦикла; 
	
	УправлениеДоступностью();
	
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ОчиститьСообщения();
	
	Для каждого ЭлементСписка Из СписокМестРеализации Цикл
		Если ЭлементСписка.Пометка Тогда
			СформироватьОтчеты(ЭлементСписка.Значение, Истина);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура КоманднаяПанельСписокМестРеализацииУстановитьФлажки(Кнопка)
	
	СписокМестРеализации.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

Процедура КоманднаяПанельСписокМестРеализацииСнятьФлажки(Кнопка)
	
	СписокМестРеализации.ЗаполнитьПометки(Ложь);
	
КонецПроцедуры

Процедура РежимПереформированияПриИзменении(Элемент)
	УправлениеДоступностью();
КонецПроцедуры

Процедура РежимПереформирования1ПриИзменении(Элемент)
	УправлениеДоступностью();
КонецПроцедуры

// Обработчик нажатия кнопки Период.
//
Процедура КнопкаПериодаНажатие(Элемент)
	
	ФормированиеОтчетов.КнопкаСменаНажатие(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	СохранитьЗначение("СписокМестРеализации",СписокМестРеализации);
КонецПроцедуры

