
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ОписаниеПрофиля) ТОгда
		Предупреждение("Данная обработка открывается только из справочника торгового оборудования!",5);
		Отказ = Истина;
		Возврат;  		
	КонецЕсли;   
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	ЗаполнитьЗначенияСвойств(ПараметрыТО,ЭтотОбъект);
	Закрыть("ОК");
	
КонецПроцедуры

Процедура КнопкаТестТитровНажатие(Элемент)
	
	Подключить();
	
	ТалицаСобытий = Новый ТаблицаЗначений;
	ТалицаСобытий.Колонки.Добавить("ИмяПарам",Новый ОписаниеТипов("Строка"));
	ТалицаСобытий.Колонки.Добавить("ЗначПарам",Новый ОписаниеТипов("Строка"));
	
	СтрокаСобытие = ТалицаСобытий.Добавить();
	СтрокаСобытие.ИмяПарам="FunctionNumber"; 			
	СтрокаСобытие.ЗначПарам="101";
	
	СтрокаСобытие = ТалицаСобытий.Добавить(); 
	СтрокаСобытие.ИмяПарам="FunctionName"; 			
	СтрокаСобытие.ЗначПарам="Авторизация";
	
	СтрокаСобытие = ТалицаСобытий.Добавить();
	СтрокаСобытие.ИмяПарам="Комментарий";				
	СтрокаСобытие.ЗначПарам="<Тест титров> Иванов. Авторизация выполнена";
	
	ПослатьСобытие(ТалицаСобытий);
	
	Предупреждение("На картинке с камеры наблюдения должен появиться текст:
					|
					|<Тест титров> Иванов. Авторизация выполнена");
	
КонецПроцедуры

Процедура КнопкаКамераНажатие(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

Результат = Новый Структура("Ошибка,Описание,Подробно", Ложь,"","");
