// Производит заполнение начальных настроек
//
Процедура ЗаполнитьНачальныеНастройки(СписокРеквизитов)  Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	
	ОписаниеТипаСтрока =  Новый ОписаниеТипов(Массив);
	
	ПостроительОтчета.ДоступныеПоля.Очистить();
	
	Для Каждого Реквизит Из СписокРеквизитов Цикл
		Настройка = ПостроительОтчета.ДоступныеПоля.Добавить(Реквизит.Значение, Реквизит.Значение);
		настройка.ТипЗначения = Реквизит.Значение.Тип;
		Настройка.Отбор = Истина;
	КонецЦикла;	
	
	Настройка = ПостроительОтчета.ДоступныеПоля.Добавить("Наименование", "Наименование", ОписаниеТипаСтрока);
	Настройка.Порядок = Истина;
	Настройка = ПостроительОтчета.ДоступныеПоля.Добавить("Код", "Код", ОписаниеТипаСтрока);
	Настройка.Порядок = Истина;
	
КонецПроцедуры
