

Процедура ДействияФормыЗаполнение(Кнопка)
	
	Форма = Справочники.КартыДоступа.ПолучитьФорму("Автозаполнение");
	Форма.Открыть();   
	
КонецПроцедуры

Процедура ПечатьСправочника()
	
	Форма = Обработки.ПечатьСправочников.ПолучитьФорму("Форма");
	Форма.Справочник = "КартыДоступа";
	Форма.Открыть();
	
КонецПроцедуры

Процедура ДействияФормыДопОбработки(Кнопка)
	ПечатьСправочника();
КонецПроцедуры


Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
	Если ТолькоПросмотр Тогда
		//ЭлементыФормы.ДействияФормы.Кнопки.ГрупповаяОбработка.Доступность = Ложь;
		ЭлементыФормы.ДействияФормы.Кнопки.Заполнить.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры


Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если НЕ ДанныеСтроки.Ссылка.ЭтоГруппа Тогда
		//Если ТипЗнч(ДанныеСтроки.Ссылка.Привязка) = Тип("СправочникСсылка.ПосадочныеМеста") Тогда
		//	ОформлениеСтроки.Ячейки.Привязка.Текст = НаимПосадочногоМеста(ДанныеСтроки.Ссылка.Привязка);
		//ИначеЕсли ДанныеСтроки.Ссылка.Привязка <> Неопределено Тогда
		//	ОформлениеСтроки.Ячейки.Привязка.Текст = ДанныеСтроки.Ссылка.Привязка.Наименование;
		//КонецЕсли;
		Если ДанныеСтроки.Ссылка.Привязка <> Неопределено Тогда
			ОформлениеСтроки.Ячейки.Привязка.Текст = ДанныеСтроки.Ссылка.Привязка.Наименование;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

