// ВариантыОтветов - Таблица значений
// 		
//		Колонки:
//			ВариантОтвета - СправочникСсылка.ЭлементыДиалогов
//			ТекстКнопки   - Строка
Перем ВариантыОтветов Экспорт; 

// ПараметрыФормы - Таблица значений
// 		
//		Колонки:
//			ИмяПараметра  		- Строка
//			ЗначениеПараметра   - Строка
Перем ПараметрыФормы Экспорт;



ВариантыОтветов  	= Справочники.ЭлементыДиалогов.СоздатьЭлемент().ВариантыОтветов.Выгрузить();

ПараметрыФормы  	= Справочники.ЭлементыДиалогов.СоздатьЭлемент().ПараметрыФормы.Выгрузить();

