
Процедура ОсновныеДействияФормыЗакрыть(Кнопка)
	//ЗагрузитьНастройки(СтруктураНастроекПриОткрытии);
	//
	//Отмена = Истина;
	Закрыть();
	
КонецПроцедуры

Процедура ОсновныеДействияФормыДействие(Кнопка)
	
	Закрыть();
	
	СформироватьОтчет(ВладелецФормы.ЭлементыФормы.Результат);
	
КонецПроцедуры
 
Процедура КнопкаДатаНажатие(Элемент)
	ФормированиеОтчетов.КнопкаПериодНажатие(ЭтотОбъект);
КонецПроцедуры

Процедура КнопкаСменыНажатие(Элемент) 
	ФормированиеОтчетов.КнопкаСменаНажатие(ЭтотОбъект);
КонецПроцедуры


Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период = ПредставлениеПериода(ДатаС,ДатаПо);	
	КонецЕсли;
КонецПроцедуры

