
Перем ПараметрыТО Экспорт;				// Параметры торгового оборудования.
Перем Результат Экспорт;				// Результат выполнения действия.
Перем DRV Экспорт;						// Соединение
Перем ТекущаяФормаhWnd Экспорт;


#Если Клиент Тогда

// Производит инициализацию торгового оборудования.
//
Процедура Инициализация() Экспорт
	
	Если НЕ глТорговоеОборудование.Свойство("InfoDisplay",DRV) Тогда
		DRV = ЭтотОбъект.ПолучитьФорму("ИнфоДисплей");
		глТорговоеОборудование.Вставить("InfoDisplay", DRV);
	КонецЕсли;	
	
	ПрочитатьПараметр("РазмерОкнаИнфоДисплея", "Во весь экран" );
	ПрочитатьПараметр("Изображение", "" );
	
КонецПроцедуры

// Выполняет чтение параметра ТО.
//
// Параметры:
//  ИмяПараметра        - имя параметра,
//  ЗначениеПоУмолчанию - значение по умолчанию для данного параметра.
//
// Возвращаемое значение:
//  Значение параметра или значение по умолчанию
//
Процедура ПрочитатьПараметр(ИмяПараметра,ЗначениеПоУмолчанию)
	
	Если НЕ ПараметрыТО.Свойство(ИмяПараметра) Тогда
		ПараметрыТО.Вставить(ИмяПараметра,ЗначениеПоУмолчанию);
	КонецЕсли; 
	
	ЭтотОбъект[ИмяПараметра] = ПараметрыТО[ИмяПараметра];
	
КонецПроцедуры
 

// Выполняет действие с ТО.
//
// Параметры:
//  Действие - имя действия,
//  ПараметрыДействия - произвольный набор параметров
//
Процедура ВыполнитьДействие(Действие, ПараметрыДействия=Неопределено) Экспорт
	
	Если Действие = "Подключить" Тогда
		Подключить();
		
	ИначеЕсли Действие = "Отключить" Тогда
		Отключить();
		
	ИначеЕсли Действие = "ПоказатьЗаказ" Тогда
		Заказ				= ПараметрыДействия.Заказ;
		ТаблицаЗаказа		= ПараметрыДействия.ТаблицаЗаказа;
		СписокРекомендаций	= ПараметрыДействия.СписокРекомендаций;
		DRV.АктивироватьСтраницуЗаказа();
		
	ИначеЕсли Действие = "УбратьЗаказ" Тогда
		Заказ			= Неопределено;
		ТаблицаЗаказа	= Неопределено;
		DRV.АктивироватьСтраницуЗаказа(Ложь);
		
	Иначе
		Результат.Ошибка	= Истина;
		Результат.Описание	= "Неизвестная команда!";
		Результат.Подробно	= "Команда """+Действие+""" не определена для "+ТО.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка ошибок
//
Функция Ошибка()
	
	Возврат Ложь;
	
КонецФункции

// Установка параметров подключения
//
Функция Подключить() Экспорт
	
	Попытка	
		ОткрытьОкноДисплея();	
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

// Отключение устройства
//
Процедура Отключить() Экспорт
	
	ЗакрытьОкноДисплея();
	
КонецПроцедуры

// Открыть форму Инфо дисплея
//
Процедура ОткрытьОкноДисплея()
	
	DRV.Открыть();
	
КонецПроцедуры

// Закрыть форму Инфо дисплея
//
Процедура ЗакрытьОкноДисплея()
	
	DRV.Закрыть();
	
КонецПроцедуры

#КонецЕсли

Результат = Новый Структура("Ошибка,Описание,Подробно",Ложь,"","");