
&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере(ТаблицаСсылок) Экспорт
	АдресТаблицыСсылок = ПоместитьВоВременноеХранилище(ТаблицаСсылок);
	Попытка
		
		ФЗ = ФоновыеЗадания.Выполнить("ВыполнениеРегламентныхЗаданий.ВыгрузитьПоТаблицеСсылок",Массив(ТаблицаСсылок),"ВыгрузитьПоТаблицеСсылокТТ"+Строка(Новый УникальныйИдентификатор));	
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Пока ФЗ.Состояние = СостояниеФоновогоЗадания.Активно Цикл
		ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ФЗ.УникальныйИдентификатор);
		Попытка
			ФЗ.ОжидатьЗавершения(2);			
		Исключение
		КонецПопытки;;
		Сообщения = ФЗ.ПолучитьСообщенияПользователю();
		Если Сообщения.Количество() Тогда
			Сообщить(Сообщения.Получить(Сообщения.ВГраница()).Текст);
		КонецЕсли;                                                   
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ПодготовитьТаблицуСсылокИВыгрузитьНаСервере();		
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьТаблицуСсылокИВыгрузитьНаСервере() Экспорт
	#Если Не ТонкийКлиент Тогда
	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("Ссылка");
	ТаблицаСсылок.Колонки.Добавить("ИБ");
	ТаблицаСсылок.Колонки.Добавить("Тип");
	ТаблицаСсылок.Колонки.Добавить("Объект");
	ТаблицаСсылок.Колонки.Добавить("ИнформационнаяБаза");
	ТаблицаСсылок.Колонки.Добавить("Свойство");
	ТаблицаСсылок.Колонки.Добавить("КодГруппыОграниченияПродажи");
	ТаблицаСсылок.Колонки.Добавить("ПараметрОграниченийПродаж");
	ТаблицаСсылок.Колонки.Добавить("ГруппаКонтроляПродажи");
	ТаблицаСсылок.Колонки.Добавить("Период");
	ТаблицаСсылок.Колонки.Добавить("ИнформационнаяБазаГруппа");
	ТаблицаСсылок.Колонки.Добавить("ТипКартинки");
	Для Каждого Т Из Элементы.Список.ВыделенныеСтроки Цикл
		ДС = Элементы.Список.ДанныеСтроки(Т);
		ЗаполнитьЗначенияСвойств(ТаблицаСсылок.Добавить(), ДС);
	КонецЦикла;
	ВыгрузитьНаСервере(ТаблицаСсылок);
	Элементы.Список.Обновить();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТД = Элементы.Список.ТекущиеДанные;
	ВидимостьДопСвойства = Ложь;
	ВидимостьЗначения = Ложь;
	ВидимостьДР = Ложь;
	
	Если ТД = Неопределено Тогда
	Иначе
		Если СтрНайти(ТД.Тип, "свойства") Тогда
			ВидимостьДопСвойства = Истина;
		ИначеЕсли СтрНайти(ТД.Тип, "Значения") Тогда
			ВидимостьЗначения = Истина;				

		ИначеЕсли СтрНайти(ТД.Тип, "Наличие") Тогда
			ВидимостьДР = Истина;				
		КонецЕсли;
	КонецЕсли;
	
	Если ВидимостьЗначения Или ВидимостьДопСвойства или ВидимостьДР Тогда
		Элементы.СтраницыРегистров.ТекущаяСтраница = ?(ВидимостьДопСвойства, Элементы.ГруппаДопСвойства, ?(ВидимостьДР, Элементы.ГруппаЗначения1, Элементы.ГруппаЗначения));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ОбъектДляВыгрузки) Тогда
		ОтборСсылка = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество()-1);
		ОтборИБ = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(0);
		ОтборТип = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(1);
		
		ОтборИБ.Использование = Ложь;
		ОтборТип.ПравоеЗначение = Параметры.ОбъектДляВыгрузки.ПолучитьОбъект().Метаданные().Синоним;
		ОтборТип.Использование = Истина;
		ОтборСсылка.ПравоеЗначение = Параметры.ОбъектДляВыгрузки;
		ОтборСсылка.Использование = Истина;
		Список.КомпоновщикНастроек.ЗагрузитьНастройки( Список.КомпоновщикНастроек.Настройки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УпрощеннаяФорма(Команда)
	ОткрытьФорму("Обработка.ВыгрузкаСправочниковНаТТ.Форма.ФормаУпрощеннаяУправляемая")
КонецПроцедуры
