
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Отказ = ЭтоНовый();
КонецПроцедуры

Процедура ПриОткрытии()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПечатныеФормы.Ссылка
	|ИЗ
	|	Справочник.ПечатныеФормы КАК ПечатныеФормы
	|ГДЕ
	|	ПечатныеФормы.Родитель = &Родитель
	|	И не ПечатныеФормы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Родитель",Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементыФормы.ПечатнаяФормаПоУмолчанию.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;

КонецПроцедуры
