
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Если ТипЗнч(Привязка) = Тип("СправочникСсылка.ПосадочныеМеста") Тогда
	//	ПредставлениеПривязки = НаимПосадочногоМеста(Привязка);
	//ИначеЕсли Привязка <> Неопределено Тогда
	//	ПредставлениеПривязки = Привязка.Наименование;
	//КонецЕсли; 
	Если Привязка <> Неопределено Тогда
		ПредставлениеПривязки = Привязка.Наименование;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда
		Наименование = "Карта № " + Код;
	КонецЕсли; 
	
	ФлагПериод1 = ЗначениеЗаполнено(Дата1);
	ФлагПериод2 = ЗначениеЗаполнено(Дата2);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ФлагПериод1 Тогда
		Если НЕ ЗначениеЗаполнено(Дата1) Тогда
			Сообщить("Укажите дату начала периода!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Дата1 = '00010101';
	КонецЕсли;
	
	Если ФлагПериод2 Тогда
		Если НЕ ЗначениеЗаполнено(Дата2) Тогда
			Сообщить("Укажите дату конца периода!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Дата2 = '00010101';
	КонецЕсли;
	
	Если ТипКарты = Перечисления.ТипыКартДоступа.Временная или ТипКарты = Перечисления.ТипыКартДоступа.Постоянная тогда
		//Код = ""+ксТрактир.Число16в10(ксТрактир.Число10в16(Лев(ЭтотОбъект.Идентификатор,3))+ ксТрактир.Число10в16(Сред(Сокрлп(ЭтотОбъект.Идентификатор),4)));
		Номер = ?(ЗначениеЗаполнено(Идентификатор2),Идентификатор2,Идентификатор);
		Наименование = "Карта №"+Номер;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.Идентификатор.КнопкаВыбора = ЭтоШаблон;
	
	ЭлементыФормы.Дата1				.Доступность = ФлагПериод1;
	ЭлементыФормы.Дата2				.Доступность = ФлагПериод2;
	ЭлементыФормы.КнопкаВыборПериода.Видимость   = ФлагПериод1 И ФлагПериод2;
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник, Событие, Данные);
	
	Если ТипКарты = Перечисления.ТипыКартДоступа.Временная тогда
		Код = ""+ксТрактир.Число16в10(ксТрактир.Число10в16(Лев(Идентификатор,3))+ ксТрактир.Число10в16(Сред(Сокрлп(Идентификатор),4)));
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаВыборПериодаНажатие(Элемент)
	
	ИнтерфейсАдмина.ВыборПериода(Дата1,Дата2);
	
КонецПроцедуры

Процедура ПредставлениеПривязкиНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений;
	Список.Добавить("Сотрудники");
	Список.Добавить("Клиенты");
	Список.Добавить("Посадочные места");
	
	Кто = ВыбратьИзМеню(Список);
	Если Кто = Неопределено Тогда 
		Возврат;
	ИначеЕсли Кто.Значение = "Сотрудники" Тогда
		ФормаВыбора = Справочники.Сотрудники.ПолучитьФормуВыбора();
	ИначеЕсли  Кто.Значение = "Клиенты" Тогда
		ФормаВыбора = Справочники.Клиенты.ПолучитьФормуВыбора();
	ИначеЕсли  Кто.Значение = "Посадочные места" Тогда
		ФормаВыбора = Справочники.ПосадочныеМеста.ПолучитьФормуВыбора();
	КонецЕсли;
	
	Привязка = ФормаВыбора.ОткрытьМодально();
	Если НЕ ЗначениеЗаполнено(Привязка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Привязка) = Тип("СправочникСсылка.ПосадочныеМеста") Тогда
		Элемент.Значение = НаимПосадочногоМеста(Привязка);
	Иначе
		Элемент.Значение = Привязка.Наименование;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПредставлениеПривязкиОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Форма = Привязка.ПолучитьФорму("ФормаЭлемента");
	Форма.Открыть();
КонецПроцедуры


Процедура ПредставлениеПривязкиОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредставлениеПривязки = "";
	Привязка = Неопределено;
КонецПроцедуры


Процедура Печать()
	ЭтотОбъект.ПечатьКонверта();
КонецПроцедуры


Процедура ПриЗакрытии()
	// Вставить содержимое обработчика.
КонецПроцедуры

