Перем фЗакрыть;
Процедура Мигнуть() Экспорт
	глОтсечкаПростоя();
КонецПроцедуры

Процедура ПриОткрытии()
	ПодключитьОбработчикОжидания("Мигнуть",3);
	Если ЗначениеЗаполнено(ЗаголовокФормы) Тогда
		ЭлементыФормы.НадписьЗаголовок.Заголовок = ЗаголовокФормы;
	Иначе
		Заголовок = "ШК";	
	КонецЕсли;
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	глОтсечкаПростоя();
	Если глСтекОкон[0].Форма <> ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	
	ШК = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник,Событие,Данные);
	Если Не ЗначениеЗаполнено(ШК) Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ШК);
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если фЗакрыть = Ложь Тогда
		фЗакрыть = Истина;
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
	глОтсечкаПростоя();
	фЗакрыть = Истина;
	ШК = "";
	Закрыть(ШК);
КонецПроцедуры


ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
