
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОЖИДАНИЯ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередЗакрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	// неизменяемые надписи
	Если РежимЗакрытых Тогда
		ЭлементыФормы.тЗаголовок.Заголовок = ?(РежимНедозакрытых, "Незарегистрирована оплата!!!", "Закрытые заказы" );
		Кнопки = ЭлементыФормы.КоманднаяПанель.Кнопки;
		Кнопки.Удалить( Кнопки.НовыйЗаказ );
		Кнопки.Удалить( Кнопки.УдалитьЗаказ );
	Иначе
		ЭлементыФормы.тЗаголовок.Заголовок = "Список заказов";
	КонецЕсли;
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	глОтсечкаПростоя();
	ТекущийЭлемент = ЭлементыФормы.ЖурналЗаказов;
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыходИзЗаказа" Тогда
		ОбновитьЖурнал(Параметр);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ЖурналЗаказовПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если СводныйЖурнал Тогда
		Возврат;
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Пиктограмма.ОтображатьТекст  = Ложь;
	
	Если ДанныеСтроки.Пиктограмма=0 Тогда
		ОформлениеСтроки.Ячейки.Пиктограмма.ОтображатьКартинку = Ложь;
	Иначе
		ОформлениеСтроки.Ячейки.Пиктограмма.ОтображатьКартинку = Истина;
		ОформлениеСтроки.Ячейки.Пиктограмма.ИндексКартинки = ДанныеСтроки.Пиктограмма-1;
	КонецЕсли; 
	
КонецПроцедуры

Процедура КнопкаВозвратНажатие(Элемент)
	
	ВозвратПоЗаказу();
	
КонецПроцедуры

Процедура КнопкаПоискНажатие(Элемент)
	
	ОткрытьЗаказПоНомеру();
	
КонецПроцедуры

Процедура КнопкаМестоНажатие(Элемент)
	
	ИзменитьЗаказ("ИзменитьМесто");
	
КонецПроцедуры

Процедура КнопкаАвторНажатие(Элемент)
	
	ИзменитьЗаказ("ИзменитьАвтора");
	
КонецПроцедуры

Процедура КнопкаГостиНажатие(Элемент)
	
	ИзменитьЗаказ("ИзменитьКолвоГостей");
	
КонецПроцедуры

Процедура КнопкаУдалитьНажатие(Элемент)
	
	УдалитьЗаказ();
	
КонецПроцедуры

Процедура КнопкаНовыйНажатие(Элемент)
	
	СоздатьНовыйЗаказ();
	
КонецПроцедуры

Процедура КнопкаВыбратьНажатие(Элемент)
	
	ОбработкаВыбораСтроки();
	
КонецПроцедуры

Процедура ЖурналЗаказовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработкаВыбораСтроки();
	
КонецПроцедуры

Процедура ЖурналЗаказовПриАктивизацииСтроки(Элемент)
	
	Если НЕ СводныйЖурнал Тогда
		ТекСтрока = ЭлементыФормы.ЖурналЗаказов.ТекущаяСтрока;
		ЭлементыФормы.тАвтор.Заголовок = ?(ТекСтрока=Неопределено, "", ТекСтрока.Автор);
	КонецЕсли;
	
КонецПроцедуры

