
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОЖИДАНИЯ

// чтобы часики тикали
//
Процедура ОбновитьДатуВремя()
	
	ТекДата = ТекущаяДата();
	ЭлементыФормы.тДата.Заголовок	= Формат(ТекДата,"ДЛФ=Д");
	ЭлементыФормы.тВремя.Заголовок	= Формат(ТекДата,"ДЛФ=В");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередЗакрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	// периодически обновляемые надписи
	ОбновитьДатуВремя();
	ПодключитьОбработчикОжидания("ОбновитьДатуВремя", 1);
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	Если ЗначениеЗаполнено(глПользователь) Тогда
		ЭлементыФормы.тПользователь.Заголовок = глПользователь.Наименование;
	Иначе
		ЭлементыФормы.тПользователь.Заголовок = "Система заблокирована";
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаНовыйЗаказНажатие(Элемент)
	
	СоздатьНовыйЗаказ();
	
КонецПроцедуры

Процедура КнопкаСписокЗаказовНажатие(Элемент)
	
	ОткрытьСписокЗаказов();
	
КонецПроцедуры

Процедура КнопкаРежимАдминистратораНажатие(Элемент)
	
	ОткрытьРежимАдминистратора();
	
КонецПроцедуры

Процедура КнопкаАвторизацияНажатие(Элемент)
	
	Авторизация( Истина );
	
КонецПроцедуры

Процедура КнопкаЗаблокироватьНажатие(Элемент)
	
	Заблокировать();
	
КонецПроцедуры

