



Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если ВводНового Тогда
		
		Клиент = Справочники.Клиенты.СоздатьЭлемент();
		Клиент.ДатаРегистрации = ТекущаяДата();
		Клиент.Наименование = Наименование;
		
		ЭлементыФормы.тЗаголовок.Заголовок = "Телефон: "+КлиентКод;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
	РаботаСокнами.CloseScreenKey();
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	глОтсечкаПростоя();
	
	ЭлементыФормы.КнопкаАдрес		.Заголовок = ?(ЗначениеЗаполнено(Адрес), Адрес.Представление, "< Адрес не указан >");
	ЭлементыФормы.КнопкаТелефон		.Заголовок = ?(ЗначениеЗаполнено(Телефон), Телефон.Представление, КлиентКод);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаЭкраннаяКлаваНажатие(Элемент)
	
	ИнтерфейсРМ.ЭкраннаяКлавиатура();
	
	ТекущийЭлемент = ЭлементыФормы.Наименование;
	
КонецПроцедуры

Процедура КнопкаОКНажатие(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Клиент.Наименование) Тогда
		Клиент.Наименование = "Без имени, " + КлиентКод;
	КонецЕсли;
	
	Клиент.ДатаОбновления = ТекущаяДата();
	Клиент.Телефон	= ЭлементыФормы.КнопкаТелефон.Заголовок;
	Клиент.Адрес	= Адрес.Представление;
	
	Если НЕ ИнтерфейсРМ.ПопыткаДействияСОбъектом( Клиент, "Объект.Записать()" ) Тогда
		Возврат;
	КонецЕсли; 
		
	Если НЕ ЗначениеЗаполнено(Телефон) Тогда
		// автоматом создаем телефон
		НовыйАдресТел = Справочники.КонтактнаяИнформация.СоздатьЭлемент();
		НовыйАдресТел.Объект = Клиент.Ссылка;
		НовыйАдресТел.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		НовыйАдресТел.Поле3 = КлиентКод;
		НовыйАдресТел.ТелефонСформироватьПредставление();
		НовыйАдресТел.Записать();
		Телефон = НовыйАдресТел.Ссылка;
	КонецЕсли;
	
	ИнтерфейсРМ.ЗаписьСобытия( ?(ВводНового, Справочники.События.КлиентыВводНового, Справочники.События.КлиентыИзменение), Клиент.Ссылка, Клиент.Наименование);
	
	Закрыть("ОК");
	
КонецПроцедуры

Процедура КнопкаАдресНажатие(Элемент)
	
	ВводАдреса(ЭтаФорма, ЭлементыФормы.КнопкаТелефон);
	
КонецПроцедуры

Процедура КнопкаТелефонНажатие(Элемент)
	
	ВводТелефона(ЭтаФорма, ЭлементыФормы.КнопкаОК);
	
КонецПроцедуры

Процедура КнопкаПолнаяФормаНажатие(Элемент)

		ПолнаяФорма = ПолучитьФорму("Форма");
		ПолнаяФорма.ОткрытьМодально();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
