//Процедура СкрытьЗаставку() Экспорт
//	ВременнаяПапка = Новый Файл("c:\temp");
//	Если ВременнаяПапка.Существует() Тогда
//		ИмяФайла = "c:\temp\Hide1CsplashScreen.exe";
//	Иначе
//		ИмяФайла = КаталогВременныхФайлов() + "Hide1CsplashScreen.exe"
//	КонецЕсли;
//	ИсполяемыйФайл = Новый Файл(ИмяФайла);
//	Если Не ИсполяемыйФайл.Существует() Тогда
//		ДвоичныеДанные = ПолучитьМакет("Hide1CsplashScreen");
//		ДвоичныеДанные.Записать(ИмяФайла);
//	КонецЕсли;	
//	
//	ЗапуститьПриложение(ИмяФайла);	
//КонецПроцедуры
