
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "КОплате,НачислениеНачисление,НачислениеОплата,СписаниеНачисление,СписаниеОплата,СписаниеСписание,НадписьКартаЛОЛ,ПИН_Хэш,НомерКартыЛояльности,НомерТелефона,НомерЗаказа,РабочееМесто,Баланс");
	
	Параметры.ПоказатьТаблицуТовары = Истина;
	
	СписаниеВозможно = СписаниеСписание > 0;
	ТипЧекаЛояльность = 1;
	ПИН_Нужен = Параметры.ПИН_Нужен = 1;
	НадписьБаланс = Новый ФорматированнаяСтрока(Формат(Параметры.Баланс, "ЧДЦ=; ЧН=") + " КеГЛей");
	//Элементы.ПоказатьБаланс.Видимость = Параметры.Баланс <> 0;
	
	//Элементы.ЗаказПодробно.Видимость = НЕ Параметры.ПоказатьТаблицуТовары;
	//Элементы.Подробно.Видимость = НЕ Параметры.ПоказатьТаблицуТовары;
	Элементы.ГруппаТаблицаСкролл.Видимость = Параметры.ПоказатьТаблицуТовары;
//УДАЛИТЬ	Элементы.КОплате.Видимость = НЕ Параметры.ПоказатьТаблицуТовары;
		
	МассивСтрокТоваров = Параметры.ТаблицаТовары; 
	//:МассивСтрокТоваров = Новый Массив;
	Для каждого ТекСтрока Из МассивСтрокТоваров Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаТовары.Добавить(), ТекСтрока);
	КонецЦикла;
	
	ОбновитьОтображениеЭлементовДляМестаРеализации(РабочееМесто.МестоРеализации, СписаниеВозможно);	
	
	Если РабочееМесто.МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Ресторан") Тогда
		ПИН_Нужен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	глОтсечкаПростоя();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ГлавнаяФормаАК_СбросЗаказаСоСтандартнойКассы" Тогда
		Если (Параметр = глРабочееМесто ИЛИ СокрЛП(Параметр) = СокрЛП(глРабочееМесто.ПрофильВхода)) И Открыта() Тогда
			Закрыть(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаТовары

&НаКлиенте
Процедура ТаблицаТоварыПриАктивизацииСтроки(Элемент)
	глОтсечкаПростоя();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , "Форма=" + ИмяФормы, "Кнопка=" + ТекущийЭлемент.Заголовок);
	Закрыть(СтруктураРезультата(-1));
	
КонецПроцедуры

&НаКлиенте
Процедура Подробно(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , "Форма=" + ИмяФормы, "Кнопка=" + ТекущийЭлемент.Заголовок);
	глОтсечкаПростоя();
	
	Элементы.ГруппаТаблицаСкролл.Видимость = Истина;
	Элементы.Подробно.Видимость = Ложь;
//УДАЛИТЬ	Элементы.КОплате.Видимость = Ложь;
	
	//Элементы.ТаблицаТовары.ВыделенныеСтроки.Очистить();
	//ТекущийЭлемент = Элементы.ОплатитьВсеСНачислением;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьВсеСНачислением(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , "Форма=" + ИмяФормы, "Кнопка=" + ТекущийЭлемент.Заголовок);
	глОтсечкаПростоя();
	ТипЧекаЛояльность = 1;
	Закрыть(СтруктураРезультата(1));
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьВсеСоСписанием(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , "Форма=" + ИмяФормы, "Кнопка=" + ТекущийЭлемент.Заголовок);
	глОтсечкаПростоя();
	Если ПИН_Нужен Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НомерТелефона", НомерТелефона); 
		ПараметрыФормы.Вставить("ВидРезультата", 1);
		ПараметрыФормы.Вставить("ДлинаПоля", 4);
		ПараметрыФормы.Вставить("РежимПароля", Истина);
		ПараметрыФормы.Вставить("ЗаголовокНадписиВведитеНомер", "Введите Код защиты для карты ****" + Прав(НомерКартыЛояльности, 4));
		ПараметрыФормы.Вставить("РабочееМесто",РабочееМесто);
		ПараметрыФормы.Вставить("ДекорацияКеглиРубли", Элементы.ДекорацияКегли.Заголовок);
		ПараметрыФормы.Вставить("ПодвалКеглиРубли", ПолучитьТабДокПодписьКнопки("КеГЛи"));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыФормы", ПараметрыФормы);
		ДополнительныеПараметры.Вставить("НомерЗапроса", 1);

		ОткрытьФорму("Обработка.ГлавнаяФормаАК.Форма.ВводЧисла", ПараметрыФормы, ЭтотОбъект, , , , Новый ОписаниеОповещения("ОбрабокаЗакрытияФормыВводЧисла", ЭтотОбъект, ДополнительныеПараметры));
	Иначе
		ТипЧекаЛояльность = 2;
		Закрыть(СтруктураРезультата(2));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбрабокаЗакрытияФормыВводЧисла(Результат, ДополнительныеПараметры) Экспорт 
	
	глОтсечкаПростоя();
	
	Если Результат = Неопределено Тогда
		// по таймауту
		Возврат;
		//Закрыть(СтруктураРезультата(-1));
	КонецЕсли;
	
	Если Результат.Ошибка = -2 Тогда
		// переиграли. назад - значит назад
		
		
	ИначеЕсли Результат.Ошибка = -1 Тогда
		// нажали назад (продолжить с начислением)
		ОткрытьФормуМодально("Обработка.ГлавнаяФормаАК.Форма.ФормаОшибка", Новый Структура("ТекстОшибки1,ТекстОшибки2,РезультатКнопкиОК", "Действие отменено.", "Будет произведена оплата с начислением КеГЛей.", ""), ЭтаФорма);
		
		ТипЧекаЛояльность = 1;
		Закрыть(СтруктураРезультата(1));
		
	ИначеЕсли ПроверитьХЭШНаСервере(Результат.ЗначениеВвода) Тогда
		// ПИН корректен
		НомерТелефона = Результат.НомерТелефона;
		ТипЧекаЛояльность = 2;
		Закрыть(СтруктураРезультата(2));
			
	ИначеЕсли ДополнительныеПараметры.НомерЗапроса < 3 Тогда
		
		ОткрытьФормуМодально("Обработка.ГлавнаяФормаАК.Форма.ФормаОшибка", Новый Структура("ТекстОшибки1,ТекстОшибки2,РезультатКнопкиОК", "Не правильно введен Код защиты!", СтрШаблон("Попытка %1 из 3...", ДополнительныеПараметры.НомерЗапроса), ""), ЭтаФорма);
		
		ДополнительныеПараметры.Вставить("НомерЗапроса", ДополнительныеПараметры.НомерЗапроса + 1);
		ОткрытьФорму("Обработка.ГлавнаяФормаАК.Форма.ВводЧисла", ДополнительныеПараметры.ПараметрыФормы, ЭтотОбъект, , , , Новый ОписаниеОповещения("ОбрабокаЗакрытияФормыВводЧисла", ЭтотОбъект, ДополнительныеПараметры));
		
	Иначе
		// 3 раза не тот ПИН - продолжаем с начислением
		ОткрытьФормуМодально("Обработка.ГлавнаяФормаАК.Форма.ФормаОшибка", Новый Структура("ТекстОшибки1,ТекстОшибки2,РезультатКнопкиОК", "Не правильно введен Код защиты!", "Будет произведена оплата с начислением КеГЛей.", ""), ЭтаФорма);
		
		ТипЧекаЛояльность = 1;
		Закрыть(СтруктураРезультата(1));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьОтдельно(Команда)
	
	глОтсечкаПростоя();
	Закрыть(СтруктураРезультата(0));
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБаланс(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , "Форма=" + ИмяФормы, "Кнопка=" + ТекущийЭлемент.Заголовок);
	глОтсечкаПростоя();
	Если Элементы.ПоказатьБаланс.Заголовок = ПоказатьБалансЗаголовок Тогда
		Элементы.ПоказатьБаланс.Заголовок = НадписьБаланс;
	Иначе
		Элементы.ПоказатьБаланс.Заголовок = ПоказатьБалансЗаголовок;
	КонецЕсли;
	ОбновитьПодписиКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура СкроллВверх(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , "Форма=" + ИмяФормы, "Кнопка=" + ТекущийЭлемент.Заголовок);
	глОтсечкаПростоя();
	Если Элементы.ТаблицаТовары.ТекущаяСтрока > 0 Тогда
		Элементы.ТаблицаТовары.ТекущаяСтрока = Элементы.ТаблицаТовары.ТекущаяСтрока - 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкроллВниз(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , "Форма=" + ИмяФормы, "Кнопка=" + ТекущийЭлемент.Заголовок);
	глОтсечкаПростоя();
	Если Элементы.ТаблицаТовары.ТекущаяСтрока < ТаблицаТовары.Количество() - 1  Тогда
		Элементы.ТаблицаТовары.ТекущаяСтрока = Элементы.ТаблицаТовары.ТекущаяСтрока + 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ВыбранныйВариант : -1 = ничего не выбрано, отмена; 1 = все с начислением; 2 = все со списанием; 0 = по одному
&НаКлиенте
Функция СтруктураРезультата(ВыбранныйВариант = -1)
	
	Если ВыбранныйВариант = 1 Тогда
		ДекорацияКеглиРубли = Элементы.ДекорацияРубли.Заголовок;
		ПодвалКеглиРубли = ПолучитьТабДокПодписьКнопки("Рубли");
	ИначеЕсли ВыбранныйВариант = 2 Тогда
		ДекорацияКеглиРубли = Элементы.ДекорацияКегли.Заголовок;
		ПодвалКеглиРубли = ПолучитьТабДокПодписьКнопки("КеГЛи");
	Иначе
		ДекорацияКеглиРубли = "";
		ПодвалКеглиРубли = Новый ТабличныйДокумент;
	КонецЕсли;
	Возврат Новый Структура("ВариантОплаты,ТипЧекаЛояльность,НомерТелефона,КОплате,ДекорацияКеглиРубли,ПодвалКеглиРубли", ВыбранныйВариант, ТипЧекаЛояльность, НомерТелефона, ?(ВыбранныйВариант = 2, СписаниеОплата, КОплате), ДекорацияКеглиРубли, ПодвалКеглиРубли);
	
КонецФункции

&НаСервере
Функция ПроверитьХЭШНаСервере(ПИН)
	
	Возврат Лояльность.MD5ХешСтрока(ПИН) = ПИН_Хэш;
	
КонецФункции

&НаКлиенте
Процедура ОбождатьМиллисекунд(Миллисекунды = 5000)
	
	Дедлайн = ТекущаяУниверсальнаяДатаВМиллисекундах() + Миллисекунды;
	Пока ТекущаяУниверсальнаяДатаВМиллисекундах() < Дедлайн Цикл
			
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьОтображениеЭлементовДляМестаРеализации(МестоРеализации, СписаниеВозможно)
	
	// блок Общий
	
	ПоказатьБалансЗаголовок = "Показать баланс карты КеГеЛьБУМ";
	Элементы.ПоказатьБаланс.Заголовок = ПоказатьБалансЗаголовок;
	
	// блок Кухни Полли
	Если МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Ресторан") Тогда
		
		Элементы.ЛогоККГурмэ.Картинка = БиблиотекаКартинок.ЛогоКухняПолли;
//УДАЛИТЬ		Элементы.ЛогоККГурмэ.Ширина = 0;
//УДАЛИТЬ		Элементы.ЛогоККГурмэ.Высота = 0;
//УДАЛИТЬ		Элементы.ЛогоККГурмэ.РазмерКартинки = РазмерКартинки.РеальныйРазмер;

		Элементы.СтрокаСостояния.Видимость = Истина;
		Элементы.ГруппаСтрокаСостояния.Видимость = Ложь;
		
		Элементы.ПоказатьБаланс.Видимость = НЕ ПустаяСтрока(Параметры.НомерКартыЛояльности);
		
//УДАЛИТЬ		Элементы.НадписьСписокКОплате.Видимость = Ложь;
		Элементы.НадписьСписокКОплате.Заголовок = Новый ФорматированнаяСтрока("К ОПЛАТЕ: " + Формат(КОплате, "ЧДЦ=2; ЧГ=3,0") + Символ(8381));
		
		Элементы.НадписьЗдравствуйте.Заголовок = "Здравствуйте, " + ?(ПустаяСтрока(Параметры.ФИО), "Гость", Параметры.ФИО) + "!" + Символы.ПС + "ВЫБЕРИТЕ СПОСОБ ОПЛАТЫ:";
		
		Если ПустаяСтрока(НомерКартыЛояльности) или не СписаниеВозможно Тогда
			Элементы.СписатьКегли.Доступность = ложь;
			Элементы.СписатьКегли.ЦветТекста = WebЦвета.ТемноСерый;
			Элементы.СписатьКегли.ЦветРамки = WebЦвета.ТемноСерый;
			ЗаголовокКегли = "для владельцев карты КеГеЛьБУМ";
		Иначе
			ЗаголовокКегли = "списать" + Символы.ПС + 
			"Будет списано: " + Формат(СписаниеСписание, "ЧДЦ=; ЧГ=3,0") + " КГЛ" + Символы.ПС;
		КонецЕсли;
		
		Если СписаниеОплата <> 0 Тогда
			ЗаголовокКегли = ЗаголовокКегли + "Доплата: " + Формат(СписаниеОплата, "ЧДЦ=2; ЧГ=3,0") + Символ(8381);
		КонецЕсли;
	
		Если ПустаяСтрока(НомерКартыЛояльности) Тогда
			ЗаголовокРубли = "банковская карта" + Символы.ПС + 
			"К оплате: " + Формат(КОплате, "ЧДЦ=2; ЧГ=3,0") + Символ(8381);
		Иначе
			ЗаголовокРубли = "банковская карта" + Символы.ПС + 
			"К оплате: " + Формат(НачислениеОплата, "ЧДЦ=2; ЧГ=3,0") + Символ(8381) + Символы.ПС +
			"Будет начислено " + Формат(НачислениеНачисление, "ЧДЦ=; ЧГ=3,0") + " КГЛ";
		КонецЕсли;
		
		
		
		Элементы.ПодвалКеГЛи.Видимость = Ложь;
		Элементы.ПодвалРубли.Видимость = Ложь;
		Элементы.СписатьКегли.Отображение = ОтображениеКнопки.Текст;
		Элементы.НачислитьКегли.Отображение = ОтображениеКнопки.Текст;
		
	КонецЕсли;
	
	// блок Классного магазина
	Если МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.КМ") Тогда
		// шапка
//УДАЛИТЬ		Элементы.ЛогоККГурмэ.Ширина = 19;
//УДАЛИТЬ		Элементы.ЛогоККГурмэ.Высота = 2;
//УДАЛИТЬ		Элементы.ЛогоККГурмэ.РазмерКартинки = РазмерКартинки.Растянуть;
		
		Элементы.СтрокаСостояния.Видимость = Ложь;
		Элементы.ГруппаСтрокаСостояния.Видимость = Истина;
		
//УДАЛИТЬ		Элементы.Назад.ЦветФона = WebЦвета.СеребристоСерый;
//УДАЛИТЬ		Элементы.Назад.ЦветРамки = WebЦвета.СеребристоСерый;
//УДАЛИТЬ		Элементы.Назад.ЦветТекста = ЦветаСтиля.ЦветФонаФормы;
//УДАЛИТЬ		Элементы.Назад.Картинка = БиблиотекаКартинок.СтрелкаВлевоУголок;
//УДАЛИТЬ		Элементы.Назад.Высота = 1;
//УДАЛИТЬ		Элементы.Назад.Заголовок = "НАЗАД";
		
		// товары
//УДАЛИТЬ		Элементы.ТаблицаТоварыТовар.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
//УДАЛИТЬ		Элементы.ТаблицаТовары.Подвал = Ложь;
//УДАЛИТЬ		Элементы.ТаблицаТовары.МаксимальнаяВысотаВСтрокахТаблицы = 6;
//УДАЛИТЬ		Элементы.ТаблицаТовары.РастягиватьПоВертикали = Истина;
		
//УДАЛИТЬ		Элементы.СкроллВверх.Картинка = БиблиотекаКартинок.СтрелкаВверхУголок;
//УДАЛИТЬ		Элементы.СкроллВверх.ЦветФона = WebЦвета.СеребристоСерый;
		
//УДАЛИТЬ		Элементы.СкроллВниз.Картинка = БиблиотекаКартинок.СтрелкаВнизУголок;
//УДАЛИТЬ		Элементы.СкроллВниз.ЦветФона = WebЦвета.СеребристоСерый;
		
		// надписи
		Элементы.НадписьЗдравствуйте.Заголовок = "Выберите способ оплаты:";
		Элементы.НадписьЗдравствуйте.ЦветТекста = ЦветаСтиля.ЦветТемы;
		Элементы.НадписьЗдравствуйте.Шрифт = Новый Шрифт(Элементы.НадписьЗдравствуйте.Шрифт, , 22);
//УДАЛИТЬ		Элементы.НадписьЗдравствуйте.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Низ;
//УДАЛИТЬ		Элементы.НадписьЗдравствуйте.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
		
		НадписьСписокКОплате = Новый Массив;
		МестаРеализации = ТаблицаТовары.Выгрузить(, "Фирма, ККМ, КОплате, СуммаРеализации");
		МестаРеализации.Свернуть("Фирма,ККМ", "КОплате,СуммаРеализации");
		Для каждого ТекСтрока Из МестаРеализации Цикл
			ФирмаКратко = Лев(СокрЛП(ТекСтрока.Фирма), 7);
			Если ТекСтрока.КОплате = 0 Тогда
				НадписьСписокКОплате.Добавить("Оплачено в " + ФирмаКратко + ": " + Формат(ТекСтрока.СуммаРеализации, "ЧДЦ=2; ЧГ=3,0") + Символ(8381) + Символы.ПС);
			ИначеЕсли ТекСтрока.ККМ.Пустая() Тогда 
				НадписьСписокКОплате.Добавить(Новый ФорматированнаяСтрока("Не забудьте оплатить Ваш заказ в " + ФирмаКратко + ": " + Формат(ТекСтрока.КОплате, "ЧДЦ=2; ЧГ=3,0") + Символ(8381), БиблиотекаКартинок.Внимание36, Символы.ПС));
			Иначе
				НадписьСписокКОплате.Добавить("К оплате в " + ФирмаКратко + ": " + Формат(ТекСтрока.КОплате, "ЧДЦ=2; ЧГ=3,0") + Символ(8381) + Символы.ПС);
			КонецЕсли;
		КонецЦикла;
		//Элементы.НадписьСписокКОплате.Заголовок = Новый ФорматированнаяСтрока(СтрСоединить(НадписьСписокКОплате, Символы.ПС));
		Элементы.НадписьСписокКОплате.Заголовок = Новый ФорматированнаяСтрока(НадписьСписокКОплате);
		
		ОбновитьТабДокСписокОплаты();
		Элементы.НадписьСписокКОплате.Видимость = Ложь;
		
		// кнопки
		
//УДАЛИТЬ		Элементы.СписатьКегли.Заголовок = "КеГЛи";
//УДАЛИТЬ		Элементы.СписатьКегли.ЦветФона = ЦветаСтиля.ЦветТемы;
//УДАЛИТЬ		Элементы.СписатьКегли.ЦветТекста = ЦветаСтиля.ЦветФонаФормы;
		
//УДАЛИТЬ		Элементы.НачислитьКегли.Заголовок = "Рубли";
//УДАЛИТЬ		Элементы.НачислитьКегли.ЦветФона = ЦветаСтиля.ЦветТемы;
//УДАЛИТЬ		Элементы.НачислитьКегли.ЦветТекста = ЦветаСтиля.ЦветФонаФормы;
		
		// подписи
		ШрифтПомельче = Новый Шрифт(Элементы.ДекорацияКегли.Шрифт,,16);
		мЗаголовокКегли = Новый Массив;
		мЗаголовокРубли = Новый Массив;
		Если ПустаяСтрока(НомерКартыЛояльности) Тогда
			Элементы.СписатьКегли.Доступность = ложь;
			Элементы.СписатьКегли.ЦветТекста = WebЦвета.ТемноСерый;
			Элементы.СписатьКегли.ЦветРамки = WebЦвета.ТемноСерый;
			мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока("для владельцев карты КеГеЛьБУМ", ШрифтПомельче));
		ИначеЕсли НЕ СписаниеВозможно Тогда
			Элементы.СписатьКегли.Доступность = ложь;
			Элементы.СписатьКегли.ЦветТекста = WebЦвета.ТемноСерый;
			Элементы.СписатьКегли.ЦветРамки = WebЦвета.ТемноСерый;
			Если ТипЗнч(Параметры.ДисплейИнфо) = Тип("Массив") Тогда
				Для каждого ТекИнфо Из Параметры.ДисплейИнфо Цикл
					мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока(ТекИнфо + Символы.ПС, ШрифтПомельче));
				КонецЦикла;
			ИначеЕсли ТипЗнч(Параметры.ДисплейИнфо) = Тип("Строка") Тогда 
				мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока(Параметры.ДисплейИнфо, ШрифтПомельче));
			КонецЕсли; 
		Иначе
			мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока("Будет списано: ", ШрифтПомельче));
			мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока(Формат(СписаниеСписание, "ЧДЦ=; ЧГ=3,0")));
			мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока(" КГЛ" + Символы.ПС, ШрифтПомельче));
		КонецЕсли;
		
		Если СписаниеОплата <> 0 Тогда
			мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока("Доплата: ", ШрифтПомельче));
			мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока(Формат(СписаниеОплата, "ЧДЦ=2; ЧГ=3,0"),));
			мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока(Символ(8381) + Символы.ПС, ШрифтПомельче));
		КонецЕсли;
		Если СписаниеНачисление <> 0 Тогда
			мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока("Будет начислено: ", ШрифтПомельче));
			мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока(Формат(СписаниеНачисление, "ЧДЦ=; ЧГ=0"), ));
			мЗаголовокКегли.Добавить(Новый ФорматированнаяСтрока(" КГЛ", ШрифтПомельче));
		КонецЕсли;
		
		Если ПустаяСтрока(НомерКартыЛояльности) Тогда
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока("(банковской картой)" + Символы.ПС, ШрифтПомельче));
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока("К оплате: ", ШрифтПомельче));
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока(Формат(КОплате, "ЧДЦ=2; ЧГ=3,0"), ));
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока(Символ(8381), ШрифтПомельче));
		Иначе
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока("Банковской картой" + Символы.ПС, ШрифтПомельче));
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока("К оплате: ", ШрифтПомельче));
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока(Формат(НачислениеОплата, "ЧДЦ=2; ЧГ=3,0"), ));
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока(Символ(8381) + Символы.ПС, ШрифтПомельче));
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока("Будет начислено: ", ШрифтПомельче));
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока(Формат(НачислениеНачисление, "ЧДЦ=; ЧГ=3,0"), ));
			мЗаголовокРубли.Добавить(Новый ФорматированнаяСтрока(" КГЛ", ШрифтПомельче));
		КонецЕсли;
		
		ЗаголовокКегли = Новый ФорматированнаяСтрока(мЗаголовокКегли);
		ЗаголовокРубли = Новый ФорматированнаяСтрока(мЗаголовокРубли);
		
		ОбновитьПодписиКнопок();
		Элементы.ДекорацияКегли.Видимость = Ложь;
		Элементы.ДекорацияРубли.Видимость = Ложь;
	
	КонецЕсли; 
	
	// блок МОКП
	
	
	// блок Общий
	
	НомерЗаказа = Формат(Число(УбратьВсеБуквы(НомерЗаказа)), "ЧДЦ=; ЧГ=0");
	Элементы.ТаблицаТоварыТовар.Заголовок = "Заказ № " + НомерЗаказа;
	
	Элементы.ДекорацияКегли.Заголовок = ЗаголовокКегли;
	Элементы.ДекорацияРубли.Заголовок = ЗаголовокРубли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТабДокСписокОплаты()
	
	Макет = Обработки.ГлавнаяФормаАК.ПолучитьМакет("Надписи");
	СписокОплаты.Очистить();
	
	МестаРеализации = ТаблицаТовары.Выгрузить(, "Фирма, ККМ, КОплате, СуммаРеализации");
	МестаРеализации.Свернуть("Фирма,ККМ", "КОплате,СуммаРеализации");
	Для каждого ТекСтрока Из МестаРеализации Цикл
		ФирмаКратко = Лев(СокрЛП(ТекСтрока.Фирма), 7);
		Если ТекСтрока.КОплате = 0 Тогда
			ОблМакета = Макет.ПолучитьОбласть("Оплачено");
			ОблМакета.Параметры.Текст = "Оплачено в " + ФирмаКратко + ": " + Формат(ТекСтрока.СуммаРеализации, "ЧДЦ=2; ЧГ=3,0") + Символ(8381);
			СписокОплаты.Вывести(ОблМакета);	
			
			
		ИначеЕсли ТекСтрока.ККМ.Пустая() Тогда 
			ОблМакета = Макет.ПолучитьОбласть("НеОплачено");
			ОблМакета.Параметры.Текст = "Не забудьте оплатить Ваш заказ в " + ФирмаКратко + ": " + Формат(ТекСтрока.КОплате, "ЧДЦ=2; ЧГ=3,0") + Символ(8381);
			СписокОплаты.Вывести(ОблМакета);	
		Иначе
			ОблМакета = Макет.ПолучитьОбласть("КОплате");
			ОблМакета.Параметры.Текст = "К оплате в " + ФирмаКратко + ":";
			ОблМакета.Параметры.Сумма = Формат(ТекСтрока.КОплате, "ЧДЦ=2; ЧГ=3,0") + Символ(8381);
			СписокОплаты.Вывести(ОблМакета);	
		КонецЕсли;
	КонецЦикла;
	
	Пока СписокОплаты.ВысотаТаблицы < 4 Цикл
		ОблМакета = Макет.ПолучитьОбласть("Оплачено");
		СписокОплаты.Вывести(ОблМакета);
	КонецЦикла;
	
	СписокОплаты.ФиксацияСверху = 4;
	СписокОплаты.Защита = Истина;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТабДокПодписьКнопки(Кнопка = "Рубли", ПоказатьБаланс = Ложь)
	
	Макет = Обработки.ГлавнаяФормаАК.ПолучитьМакет("Надписи");
	ТабДок = Новый ТабличныйДокумент;
	
	Если ВРег(Кнопка) = "КЕГЛИ" Тогда
		
		Если ПустаяСтрока(НомерКартыЛояльности) Тогда
			ОблМакета = Макет.ПолучитьОбласть("СтрокаТекст");
			ОблМакета.Параметры.Текст = "для владельцев карты КеГеЛьБУМ";
			ТабДок.Вывести(ОблМакета);
		ИначеЕсли НЕ СписаниеВозможно Тогда
			ОблМакета = Макет.ПолучитьОбласть("СтрокаТекст");
			Если ТипЗнч(Параметры.ДисплейИнфо) = Тип("Массив") Тогда
				ОблМакета.Параметры.Текст = СтрСоединить(Параметры.ДисплейИнфо, Символы.ПС);
			ИначеЕсли ТипЗнч(Параметры.ДисплейИнфо) = Тип("Строка") Тогда 
				ОблМакета.Параметры.Текст = Параметры.ДисплейИнфо;
			КонецЕсли; 
			ТабДок.Вывести(ОблМакета);
		Иначе
			ОблМакета = Макет.ПолучитьОбласть("СтрокаКГЛ");
			ОблМакета.Параметры.Текст = "Будет списано:";
			ОблМакета.Параметры.Сумма = Формат(СписаниеСписание, "ЧДЦ=; ЧГ=3,0");
			//ОблМакета.Параметры.денег = "КГЛ";
			ТабДок.Вывести(ОблМакета);
		КонецЕсли;
		
		Если СписаниеОплата <> 0 Тогда
			ОблМакета = Макет.ПолучитьОбласть("СтрокаРУБ");
			ОблМакета.Параметры.Текст = "Доплата:";
			ОблМакета.Параметры.Сумма = Формат(Цел(СписаниеОплата), "ЧДЦ=; ЧГ=3,0");
			ОблМакета.Параметры.денег = "," + Формат(СписаниеОплата * 100 % 100, "ЧЦ=2; ЧН=00; ЧВН=") + " " + Символ(8381);
			ТабДок.Вывести(ОблМакета);
		КонецЕсли;
		Если СписаниеНачисление <> 0 Тогда
			ОблМакета = Макет.ПолучитьОбласть("СтрокаКГЛ");
			ОблМакета.Параметры.Текст = "Будет начислено:";
			ОблМакета.Параметры.Сумма = Формат(СписаниеНачисление, "ЧДЦ=; ЧГ=3,0");
			//ОблМакета.Параметры.денег = "КГЛ";
			ТабДок.Вывести(ОблМакета);
		КонецЕсли;
		
		Если ПоказатьБаланс = Истина Тогда
			ОблМакета = Макет.ПолучитьОбласть("СтрокаКГЛ");
			ОблМакета.Параметры.Текст = "Баланс карты:";
			ОблМакета.Параметры.Сумма = Формат(Баланс + СписаниеНачисление - СписаниеСписание, "ЧДЦ=; ЧГ=3,0");
			//ОблМакета.Параметры.денег = "КГЛ";
			ТабДок.Вывести(ОблМакета);
		КонецЕсли;
		
	ИначеЕсли ВРег(Кнопка) = "РУБЛИ" Тогда
		
		//ОблМакета = Макет.ПолучитьОбласть("СтрокаТекст");
		//ОблМакета.Параметры.Текст = "Банковской картой";
		//ТабДок.Вывести(ОблМакета);
		
		Если ПустаяСтрока(НомерКартыЛояльности) Тогда
			ОблМакета = Макет.ПолучитьОбласть("СтрокаРУБ");
			ОблМакета.Параметры.Текст = "К оплате:";
			ОблМакета.Параметры.Сумма = Формат(Цел(КОплате), "ЧДЦ=; ЧГ=3,0");
			ОблМакета.Параметры.денег = "," + Формат(КОплате * 100 % 100, "ЧЦ=2; ЧН=00; ЧВН=") + " " + Символ(8381);
			ТабДок.Вывести(ОблМакета);
		Иначе
			ОблМакета = Макет.ПолучитьОбласть("СтрокаРУБ");
			ОблМакета.Параметры.Текст = "К оплате:";
			ОблМакета.Параметры.Сумма = Формат(Цел(НачислениеОплата), "ЧДЦ=; ЧГ=3,0");
			ОблМакета.Параметры.денег = "," + Формат(НачислениеОплата * 100 % 100, "ЧЦ=2; ЧН=00; ЧВН=") + " " + Символ(8381);
			ТабДок.Вывести(ОблМакета);
			
			ОблМакета = Макет.ПолучитьОбласть("СтрокаКГЛ");
			ОблМакета.Параметры.Текст = "Будет начислено:";
			ОблМакета.Параметры.Сумма = Формат(НачислениеНачисление, "ЧДЦ=; ЧГ=3,0");
			//ОблМакета.Параметры.денег = "КГЛ";
			ТабДок.Вывести(ОблМакета);
		КонецЕсли;
			
		Если ПоказатьБаланс = Истина Тогда
			ОблМакета = Макет.ПолучитьОбласть("СтрокаКГЛ");
			ОблМакета.Параметры.Текст = "Баланс карты:";
			ОблМакета.Параметры.Сумма = Формат(Баланс + НачислениеНачисление, "ЧДЦ=; ЧГ=3,0");
			//ОблМакета.Параметры.денег = "КГЛ";
			ТабДок.Вывести(ОблМакета);
		КонецЕсли;
		
	КонецЕсли;

	Пока ТабДок.ВысотаТаблицы < 4 Цикл
		ОблМакета = Макет.ПолучитьОбласть("СтрокаТекст");
		ТабДок.Вывести(ОблМакета);
	КонецЦикла;
		
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Процедура ОбновитьПодписиКнопок()
	
	ПоказатьБаланс = НЕ Элементы.ПоказатьБаланс.Заголовок = ПоказатьБалансЗаголовок;
	ПодвалКеГЛи.Очистить();
	ПодвалКеГЛи.Вывести(ПолучитьТабДокПодписьКнопки("КеГЛи", ПоказатьБаланс));
	ПодвалКеГЛи.ФиксацияСверху = 6;
	ПодвалКеГЛи.Защита = Истина;
	
	ПодвалРубли.Очистить();
	ПодвалРубли.Вывести(ПолучитьТабДокПодписьКнопки("Рубли", ПоказатьБаланс));
	ПодвалРубли.ФиксацияСверху = 6;
	ПодвалРубли.Защита = Истина;
	
	
КонецПроцедуры

#КонецОбласти
