// Обработчик события ПриИзменении поля ввода ВремяНачала.
//
Процедура ВремяНачалаПриИзменении(Элемент)
	
	РассчитатьДлительность();
	
КонецПроцедуры

// Процедура рассчитывает длительность смены.
//
Процедура РассчитатьДлительность()

	мВремяНачала = Дата(1,1,1,Час(ВремяНачала), Минута(ВремяНачала),0);
	мВремяОкончания = Дата(1,1,1,Час(ВремяОкончания), Минута(ВремяОкончания),0);
	
	Если мВремяОкончания < мВремяНачала Тогда
		мВремяОкончания = мВремяОкончания + 60*60*24;
	КонецЕсли;
	
	ВсегоМинут = Цел((мВремяОкончания - мВремяНачала) / 60);
	ДлительностьЧасов = Цел(ВсегоМинут / 60);
	ДлительностьМинут = ВсегоМинут - ДлительностьЧасов * 60;
	Длительность = Дата(1,1,1,ДлительностьЧасов, ДлительностьМинут,0);
	
КонецПроцедуры

// Обработчик события ПриИзменении поля ввода ДлительностьЧас.
//
Процедура ДлительностьЧасПриИзменении(Элемент)
	
	мВремяОкончания = ВремяНачала + Час(Длительность)*60*60 + Минута(Длительность)*60;
	ВремяОкончания = Дата(1,1,1,Час(мВремяОкончания), Минута(мВремяОкончания),0);
	
КонецПроцедуры
