
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	докПротокол = ПротоколРасчетовПоЗаказу(ПараметрКоманды);
	Если докПротокол <> ПредопределенноеЗначение("Документ.ПротоколРасчетов.ПустаяСсылка") Тогда
		ПараметрыФормы = Новый Структура("Ключ", докПротокол);
		ОткрытьФорму("Документ.ПротоколРасчетов.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе
		Предупреждение("Протокол отсутствует!");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПротоколРасчетовПоЗаказу(Заказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПротоколРасчетов.Ссылка
	|ИЗ
	|	Документ.ПротоколРасчетов КАК ПротоколРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПротоколРасчетов.Протокол КАК ПротоколТЧ
	|		ПО ПротоколТЧ.Ссылка = ПротоколРасчетов.Ссылка
	|ГДЕ
	|	ПротоколРасчетов.Заказ = &Заказ
	|	И НЕ ПротоколРасчетов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПротоколРасчетов.Дата УБЫВ,
	|	ПротоколТЧ.СуммаФакт УБЫВ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Рез = Запрос.Выполнить();            
	Если Рез.Пустой() Тогда
		Возврат Документы.ПротоколРасчетов.ПустаяСсылка();
	Иначе 
		Возврат Рез.Выгрузить()[0][0];
	КонецЕсли;

КонецФункции
