Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон("Смена ТТ %3 %1 от %2",
					Число(УбратьВсеБуквы(Данные.Номер)),
					Формат(Данные.Дата, "ДФ='дд.ММ.гг'"),
					Данные.МестоРеализации);
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("МестоРеализации");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
