
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	глПараметрыРМ = глПараметрыРМ;
	
	
	Если ТипЗнч(глПараметрыРМ) = Тип("Структура") Тогда
		
		//глПараметрыРМ.Вставить("НомерСмены", Вычислить("ИнтерфейсРМ.ТекущаяСмена().Номер"));Обработки.ОткрытиеЗакрытиеСмены.
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ОткрытиеСмены.Ссылка
		|ИЗ
		|	Документ.ОткрытиеСмены КАК ОткрытиеСмены
		|ГДЕ
		|	ОткрытиеСмены.Ссылка <> &Ссылка
		|	И НАЧАЛОПЕРИОДА(ОткрытиеСмены.Дата, ДЕНЬ) = &Дата
		|	И ОткрытиеСмены.МестоРеализации = &МестоРеализации и не ПометкаУдаления");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
		Запрос.УстановитьПараметр("МестоРеализации", МестоРеализации);
		Если Не Запрос.Выполнить().Пустой() Тогда
			#Если Клиент Тогда
				Если глРабочееМесто = Неопределено Тогда
					Предупреждение("Смена в этом дне уже открыта!",5,"Ошибка");
				Иначе
					Текст1="Ошибка открытия смены";
					Текст2="Смена в этом дне уже открыта!";
					ИнтерфейсРМ.ВопросПредупреждение("Предупреждение",Текст1,Текст2,"","ОК","");
				КонецЕсли;
				
				
			#КонецЕсли
			
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// для автономной кассы добавим запись в текстовый файл
	//ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	//ЗаписатьОбъектВФайл(ИмяФайла,ЭтотОбъект);
	//Фирма = ПараметрыСеанса.ТекущаяИБ.ПолучитьОбъект().Фирма(МестоРеализации, Истина);
	//Отбор = новый Структура;
	//Отбор.Вставить("МестоРеализации",МестоРеализации);
	//Спр = Справочники.РабочиеМеста.Выбрать(,,Отбор);
	//Пока Спр.Следующий() Цикл
	//	Если Фирма <> Спр.Фирма Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	Если Спр.Тест Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	Если Спр.ПометкаУдаления Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	Профиль = Спр.ПрофильВхода;
	//	Поз = СтрНайти(Профиль,"\",НаправлениеПоиска.СКонца);
	//	СтрПуть = Лев(Профиль,Поз-1);
	//	Сеть.ПодключитьШару(СтрПуть);
	//	СтрПуть = СтрПуть + "\";
	//	Каталог = Константы.ПутьДляЛогирования.Получить();
	//	СтрПуть = СтрПуть + СтрЗаменить(Каталог,":","$");
	//	СтрПуть = ?(Прав(СтрПуть,1) = "\",СтрПуть,СтрПуть + "\");
	//	ИмяфайлаПолучателя = СтрПуть + "ОткрытиеСмены_" + МестоРеализации.Наименование + ".txt";
	//	Попытка
	//		ир = ирКэш.Получить(); //:ир = Обработки.ирПлатформа.Создать();
	//		ир.ЗапуститьСкрытоеПриложениеИДождатьсяЗавершения(СтрШаблон("copy %1 %2", ИмяФайла, ИмяфайлаПолучателя),,,,Ложь);
	//		//КопироватьФайл(ИмяФайла,ИмяфайлаПолучателя);
	//	Исключение
	//		ЗаписьЖурналаРегистрации("Ошибка записи файла открытия смены",УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект,,"Ошибка доступа до " + ИмяфайлаПолучателя + "
	//		|ОписаниеОшибки: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));			
	//	КонецПопытки;
	//КонецЦикла;
КонецПроцедуры
