
&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("ВремяНач,ВремяКон",ВремяНач,ВремяКон));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ВремяНач = Параметры.ВремяНач;
	ЭтаФорма.ВремяКон = Параметры.ВремяКон; 
	Элементы.ВремяКон.МинимальноеЗначение = ВремяНач+1;
КонецПроцедуры

&НаКлиенте
Процедура Регулирование(Элемент, Направление, СтандартнаяОбработка)
	ЭтаФорма[Элемент.ПутьКДанным] = ЭтаФорма[Элемент.ПутьКДанным] +?(Направление-1,86400,-86400);
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачПриИзменении(Элемент)
	Элементы.ВремяКон.МинимальноеЗначение = ВремяНач+1;
КонецПроцедуры

&НаКлиенте
Процедура ВремяКонПриИзменении(Элемент)
	Элементы.ВремяНач.МаксимальноеЗначение = ВремяНач;
КонецПроцедуры


