
Функция ВерсияЛояльности(Тест=Ложь) Экспорт
	
	Возврат Лояльность.ВерсияЛояльности(Тест);
	
КонецФункции

Функция ПолучитьТекущийРегион() Экспорт
	Возврат Лояльность.ПолучитьТекущийРегион();
КонецФункции

Функция ТестовыйРежим(РабочееМесто) Экспорт
	
	Возврат Лояльность.ТестовыйРежим(РабочееМесто);
	
КонецФункции

Функция ОтладкаВключена() Экспорт
	Возврат Лояльность.ОтладкаВключена();
КонецФункции

Функция СоответствиеЗаголовковПлашек_Активная() Экспорт 
	
	Результат = Новый Соответствие;
	Результат.Вставить(7, "Показать все ПП");
	Результат.Вставить(8, "Показать 
							|ЛУЧший покупатель");
	Результат.Вставить(9, "Расчет
							|КеГЛей");
	Результат.Вставить(10, "Показать СПИСАНИЕ");
	Результат.Вставить(11, "Скрыть персональные данные");
	Результат.Вставить(12, "Показать АКЦИИ");
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеЗаголовковПлашек_Неактивная() Экспорт 
	
	Результат = Новый Соответствие;
	Результат.Вставить(7, "Показать все ПП");
	Результат.Вставить(8, "Подключить ЛУЧ");
	Результат.Вставить(9, "Расчет
							|КеГЛей");
	Результат.Вставить(10, "Показать СПИСАНИЕ");
	Результат.Вставить(11, "Скрыть персональные данные");
	Результат.Вставить(12, "Показать АКЦИИ");
	
	Возврат Результат;
	
КонецФункции
