
Функция ВерсияЛояльности(Тест=Ложь) Экспорт
	
	Возврат Лояльность.ВерсияЛояльности(Тест);
	
КонецФункции

Функция ПолучитьТекущийРегион() Экспорт
	Возврат Лояльность.ПолучитьТекущийРегион();
КонецФункции

Функция ТестовыйРежим(РабочееМесто) Экспорт
	
	Возврат Лояльность.ТестовыйРежим(РабочееМесто);
	
КонецФункции

Функция ОтладкаВключена() Экспорт
	Возврат Лояльность.ОтладкаВключена();
КонецФункции

Функция СоответствиеЗаголовковПлашек_Активная(МестоРеализации = Неопределено) Экспорт 
	
	Результат = Новый Соответствие;
	Результат.Вставить(7, "Показать все ПП");
	Если МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Ресторан") Тогда
		Результат.Вставить(8, "Показать рецепты INSPIRED");
	Иначе	
		Результат.Вставить(8, "Показать 
								|ЛУЧший покупатель");
	КонецЕсли;
	Результат.Вставить(9, "Расчет
							|КеГЛей");
	Результат.Вставить(10, "Показать СПИСАНИЕ");
	Результат.Вставить(11, "Скрыть перс. данные");
	Результат.Вставить(12, "Показать АКЦИИ");
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеЗаголовковПлашек_Неактивная(МестоРеализации = Неопределено) Экспорт 
	
	Результат = Новый Соответствие;
	Результат.Вставить(7, "Показать все ПП");
	Если МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Ресторан") Тогда
		Результат.Вставить(8, "Предл. сохранить рецепт INSPIRED");
	Иначе	
		Результат.Вставить(8, "Подключить ЛУЧ");
	КонецЕсли;
	Результат.Вставить(9, "Расчет
							|КеГЛей");
	Результат.Вставить(10, "Показать СПИСАНИЕ");
	Результат.Вставить(11, "Показать перс. данные");
	Результат.Вставить(12, "Показать АКЦИИ");
	
	Возврат Результат;
	
КонецФункции

Функция МестоРеализацииПоПроекту(Проект = Неопределено, Строкой = Ложь, Падеж = 1) Экспорт 
	
	Если Проект = 1 Тогда
		МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Отдохни");
	ИначеЕсли Проект = 2 Тогда
		МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Мяснов");
	ИначеЕсли Проект = 3 Тогда
		МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Ресторан");
		Если Строкой Тогда
			Если Падеж = 1 Тогда
				МестоРеализации = "Кухня Полли";
			ИначеЕсли Падеж = 2 Тогда	
				МестоРеализации = "Кухни Полли";
			ИначеЕсли Падеж = 4 Тогда	
				МестоРеализации = "Кухню Полли";
			ИначеЕсли Падеж = 5 Тогда	
				МестоРеализации = "Кухней Полли";
			Иначе	
				МестоРеализации = "Кухне Полли";
			КонецЕсли;
		КонецЕсли;
	Иначе
		МестоРеализации = ?(Строкой, "", Неопределено);
	КонецЕсли;
	
	Возврат ?(Строкой, СокрЛП(МестоРеализации), МестоРеализации);
	
КонецФункции

Функция ПроектПоМестуРеализации(МестоРеализации = Неопределено) Экспорт 
	
	Если МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Отдохни") Тогда
		Возврат 1;
	ИначеЕсли МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Мяснов") Тогда
		Возврат 2;
	ИначеЕсли МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Ресторан") Тогда
		Возврат 3;
	Иначе
		Возврат 0;
	КонецЕсли;
		
КонецФункции
