Перем фЗакрыть;
Процедура Мигнуть() Экспорт
	глОтсечкаПростоя();
КонецПроцедуры

Процедура ПриОткрытии()
	ПодключитьОбработчикОжидания("Мигнуть",3);
	ДействияПриОткрытии();
	КонтрольныеПоказатели.ПрерватьЗамер();
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
	Стиль = БиблиотекаСтилей.СтанцияОплаты;
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	глОтсечкаПростоя();
	Если глСтекОкон[0].Форма <> ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	
	НомерКартыДоступа = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник,Событие,Данные);
	Если Не ЗначениеЗаполнено(НомерКартыДоступа) Тогда
		Возврат;
	КонецЕсли;
	
	СпособРегистрацииБейджа = 0;
	КартаДоступа = ПолучитьКартуДоступаПоИдентификатору(НомерКартыДоступа, СпособРегистрацииБейджа);
	Если ЗначениеЗаполнено(КартаДоступа) Тогда
		Если Не МожноСлужебныйБейдж Тогда
		Попытка
			Если КартаДоступа.СлужебныйБейдж Тогда
				РаботаСокнами.ПоказатьПлашку(,"Это служебный бейдж");
				Возврат;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

		_Результат = Новый Структура("КартаДоступа,СпособРегистрацииБейджа", КартаДоступа, СпособРегистрацииБейджа);
		Закрыть(_Результат);                            
		//Закрыть(КартаДоступа);                            
	Иначе
		РаботаСокнами.ПоказатьПлашку("Некорректный бэйдж", "Бэйдж не найден в базе",1,"3000",10,230);
		Попытка
			ВызватьИсключение "Бэйдж " + НомерКартыДоступа + " не найден в базе";
		Исключение
			ЗарегистрироватьСобытиеОшибки(ИнформацияОбОшибке());	
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗакрытии()
	ДействияПриЗакрытии();
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если фЗакрыть = Ложь Тогда
		фЗакрыть = Истина;
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
	глОтсечкаПростоя();
	фЗакрыть = Истина;
	ПДФ = "";
	Закрыть(ПДФ);
КонецПроцедуры

Функция _ПрименитьКарту(НомерКарты) Экспорт
	_КартаДоступаКлиента = Неопределено;
	ТипПривязки = Новый ОписаниеТипов("СправочникСсылка.Клиенты");
	_Объект = ИнтерфейсРМ.ИдентификацияПоКарте("Идентификатор_"+НомерКарты, ТипПривязки, 0, _КартаДоступаКлиента);
	//:_КартаДоступаКлиента = Справочники.КартыДоступа.ПустаяСсылка();
	Если Не МожноСлужебныйБейдж Тогда
		Попытка
			Если _КартаДоступаКлиента.СлужебныйБейдж Тогда
				РаботаСокнами.ПоказатьПлашку(,"Это служебный бейдж");
				Возврат Неопределено;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	_Результат = Новый Структура("КартаДоступа,СпособРегистрацииБейджа", _КартаДоступаКлиента, 1);
	Закрыть(_Результат);                            
	//Закрыть(_КартаДоступаКлиента);	
КонецФункции

Процедура Кнопка1Нажатие(Элемент)
	НомерКартыДоступа = ВосстановитьЗначение("НомерКартыДоступа");	
	ВвестиСтроку(НомерКартыДоступа);
	СохранитьЗначение("НомерКартыДоступа",НомерКартыДоступа);
	_ПрименитьКарту(НомерКартыДоступа);
	
КонецПроцедуры

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
