Процедура СформироватьОтчетФО() Экспорт
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	//ЗаписатьОбъектВФайл(ИмяФайла,ЭтотОбъект);
	//
	//Отбор = новый Структура;
	//Отбор.Вставить("МестоРеализации",МестоРеализации);
	//Фирма = ПараметрыСеанса.ТекущаяИБ.ПолучитьОбъект().Фирма(МестоРеализации, Истина);
	//Спр = Справочники.РабочиеМеста.Выбрать(,,Отбор);
	//Пока Спр.Следующий() Цикл
	//	Если Фирма <> Спр.Фирма Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	Если Спр.Тест Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	Если Спр.ПометкаУдаления Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Профиль = Спр.ПрофильВхода;
	//	Поз = СтрНайти(Профиль,"\",НаправлениеПоиска.СКонца);
	//	СтрПуть = Лев(Профиль,Поз-1);
	//	Сеть.ПодключитьШару(СтрПуть);
	//	СтрПуть = СтрПуть + "\";
	//	Каталог = Константы.ПутьДляЛогирования.Получить();
	//	СтрПуть = СтрПуть + СтрЗаменить(Каталог,":","$");
	//	СтрПуть = ?(Прав(СтрПуть,1) = "\",СтрПуть,СтрПуть + "\");
	//	ИмяфайлаПолучателя = СтрПуть + "ЗакрытиеСмены_" + МестоРеализации.Наименование + ".txt";
	//	Попытка
	//		КопироватьФайл(ИмяФайла,ИмяфайлаПолучателя);
	//	Исключение
	//		ЗарегистрироватьСобытие("Ошибка записи файла закрытия смены",УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект,,"Ошибка доступа до " + Профиль);
	//	КонецПопытки;
	//КонецЦикла;
КонецПроцедуры
