Перем Список;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ФормированиеОтчетов.ПередОткрытиемОтчета(ЭтаФорма);
КонецПроцедуры

Процедура ДействияФормыСформировать(Кнопка)
	СформироватьОтчет(ЭлементыФормы.Результат)
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

Список = Новый СписокЗначений;
Список.Добавить(1,"Раздел1. Выручка");
Список.Добавить(2,"Раздел2. Удаления");
Список.Добавить(3,"Раздел3. Средние показатели");
Список.Добавить(4,"Раздел4. Расшифровка по статусу заказов");
Список.Добавить(5,"Раздел5. Скидки/Наценки");
