
// Обработчик события Действие элемента КоменднаяПанель.ДействиеПодбор.
//
Процедура ДействияФормыДействиеПодбор(Кнопка)
	
	Справочники.КлассификаторЕдиницИзмерения.ПолучитьФорму("ФормаПодбораИзКлассификатора", ЭтаФорма, "ФормаПодбораИзКлассификатора").Открыть();
	
КонецПроцедуры


Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
	Если ТолькоПросмотр Тогда
		ЭлементыФормы.ДействияФормы.Кнопки.ДействиеПодбор.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

