
Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.РазрешитьПовторение.Доступность	= НЕ ОднаИзГруппы;
	
	Флаг = ВыбиратьПоГруппам;
	ЭлементыФормы.ЗапретитьПропускВГруппе.Видимость	= Флаг;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда
		ЕстьПодгруппы = Ложь;
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ Ссылка
		|ИЗ Справочник.Специфики 
		|
		|ГДЕ НЕ ПометкаУдаления И ЭтоГруппа И 
		|	Родитель = &ГруппаСпецифик
		|");
		
		Запрос.УстановитьПараметр("ГруппаСпецифик", Ссылка);
		
		ЕстьПодгруппы = НЕ Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	ЭлементыФормы.ВыбиратьПоГруппам.Видимость = ЕстьПодгруппы;
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ВыбиратьПоГруппамПриИзменении(Элемент)
	
	Если Не ВыбиратьПоГруппам Тогда
		ЗапретитьПропускВГруппе	= ВыбиратьПоГруппам;
	КонецЕсли;	
	
КонецПроцедуры

// < КС_ВДВ ------------------------------------------------------------ 
Процедура МинУдельныйВесПриИзменении(Элемент)
	
	Если ЭтотОбъект.МаксУдельныйВес < ЭтотОбъект.МинУдельныйВес Тогда
		ЭтотОбъект.МаксУдельныйВес = ЭтотОбъект.МинУдельныйВес
	КонецЕсли; 
	
КонецПроцедуры // КС_ВДВ > ------------------------------------------------------------ 

// < КС_ВДВ ------------------------------------------------------------ 
Процедура МаксУдельныйВесПриИзменении(Элемент)
	
	Если ЭтотОбъект.МаксУдельныйВес < ЭтотОбъект.МинУдельныйВес Тогда
		ЭтотОбъект.МинУдельныйВес = ЭтотОбъект.МаксУдельныйВес
	КонецЕсли; 
	
КонецПроцедуры // КС_ВДВ > ------------------------------------------------------------ 

