////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИИ СОБЫТИЙ ФОРМЫ

Процедура ДействияФормыДобавитьНесколькоФайлов(Кнопка)
	ХранилищеДополнительнойИнформации.ДобавитьФайлы();
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда 
	Если не Элемент.ТекущиеДанные.ЭтоГруппа тогда
		ТекущаяКартинка = Элемент.ТекущиеДанные.Ссылка.Хранилище.Получить();
		Попытка
			ЭлементыФормы.ПолеИзображения.Картинка = ?(ТекущаяКартинка <> Неопределено, ТекущаяКартинка, Новый Картинка());
		Исключение
			ЭлементыФормы.ПолеИзображения.Картинка = Новый Картинка();
		КонецПопытки;		
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура СправочникСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если ВыбраннаяСтрока = Справочники.ХранилищеДополнительнойИнформации.ШаблонПисьма_РучноеЗакрытиеКассовойСмены Тогда
		СтандартнаяОбработка = Ложь;
		Текст = "Выполнено ручное закрытие кассовой смены на ТТ [ПараметрыСеанса.ТекущаяИБ].
				|Документ: [ЭтотОбъект.Ссылка]";
		ИзХранилища = ВыбраннаяСтрока.Хранилище.Получить();
		Если ТипЗнч(ИзХранилища)=Тип("Строка") Тогда
			Текст = ИзХранилища;
		КонецЕсли;
		ирОбщий.ОткрытьФормуПроизвольногоЗначенияЛкс(Текст);
		об = ВыбраннаяСтрока.ПолучитьОбъект();
		об.Хранилище = Новый ХранилищеЗначения(Текст);
		об.Записать();
	КонецЕсли;
КонецПроцедуры


