
Процедура СправочникСписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекСтрока = Элемент.ТекущиеДанные;
		ТекСтрока.СтавкаНДС			= Константы.ОсновнаяСтавкаНДС.Получить();
		ТекСтрока.ПравилоОкругления	= Константы.ОсновноеПравилоОкругления.Получить();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
	ЭлементыФормы.СправочникСписок.Колонки.ГруппаОплаты.Видимость	= Константы.ИспользоватьГруппыОплаты.Получить();
	ЭлементыФормы.СправочникСписок.Колонки.Скидка.Видимость			= глВерсия>1;
	
КонецПроцедуры

Процедура СправочникСписокСкидкаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтерфейсАдмина.ВыборСкидкиБонуса(Элемент, Ложь);
	
КонецПроцедуры
