Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием()
	ЭлементыФормы.ПолеHTML.УстановитьТекст("");
КонецПроцедуры

Процедура ПриОткрытии()
    
	// создаем файл xml
	АдресOutput = КаталогВременныхФайлов() + "geores.xml";
	
	Если Не YandexGeoCodeGetFile(АдресOutput) Тогда
		
		Возврат;	
	
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(АдресOutput);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументДОМ = ПостроительDOM.Прочитать(ЧтениеXML);
	СписокPos = ДокументДОМ.ПолучитьЭлементыПоИмени("pos");
	СтрокаКоординат = СтрЗаменить(СписокPos[0].ТекстовоеСодержимое," ",Символы.ПС);
	Широта = СтрПолучитьСтроку(СтрокаКоординат, 1);
	Долгота = СтрПолучитьСтроку(СтрокаКоординат, 2);
	
	GM = Новый ТекстовыйДокумент;
	
	МинШирота = 0; МинДолгота = 0; МаксШирота = 0; МаксДолгота = 0;
	флПерваяСтрока = Истина;
	
	ТекстHTML =" 
	|<HTML><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<SCRIPT type=text/javascript src=""http://api-maps.yandex.ru/2.0/?load=package.full&amp;mode=debug&amp;lang=ru-RU""></SCRIPT>
	|<BASE href=""v8config://7b992f15-a89f-4bdc-b88f-0d7e5fb698b8/mdobject/id43aea454-e707-4709-aa09-f09d1255f565/8eb4fad1-1fa6-403e-970f-2c12dbb43e23""></BASE>
	|<META name=GENERATOR content=""MSHTML 8.00.7601.17824""></HEAD>
	|<BODY>
	|<SCRIPT>
   	|ymaps.ready(function () {
    |           var myMap = new ymaps.Map(""YMapsIDBig"", {center: [" +Формат(Долгота,"ЧРД=.; ЧН=; ЧГ=0")+","+Формат(Широта,"ЧРД=.; ЧН=; ЧГ=0")+"], zoom: 15, behaviors: [""default"", ""scrollZoom""], type: ""yandex#map""});
    |           var myPlacemark = new ymaps.Placemark(["+Формат(Долгота,"ЧРД=.; ЧН=; ЧГ=0")+","+Формат(Широта,"ЧРД=.; ЧН=; ЧГ=0")+"], {balloonContent: ""Тест""}, {draggable: false, hideIconOnBallon: false});
    |           myMap.geoObjects.add(myPlacemark);
    |           myMap.controls.add(""mapTools"").add(""zoomControl"").add(""typeSelector"");
    |        });

	|</SCRIPT>

	|<DIV style=""WIDTH: 560px; HEIGHT: 350px"" id=YMapsIDBig></DIV></BODY></HTML>";
	
	ЭлементыФормы.ПолеHTML.УстановитьТекст(ТекстHTML);
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция YandexGeoCodeGetFile(АдресOutput)

	HTTPСервис = Новый HTTPСоединение("geocode-maps.yandex.ru"); 
	
	Попытка 
		HTTPСервис.Получить("1.x/?geocode=" + АдреснаяСтрока, АдресOutput); 
	Исключение 
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное); 
		Возврат Ложь;
	КонецПопытки; 

	Возврат Истина;
	
КонецФункции // YandexGeoCodeGetFile()


////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
