

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КартинкаИзХранилища = Объект.Ссылка.Хранилище.Получить();
	Если ТипЗнч(КартинкаИзХранилища) = Тип("Картинка") Тогда
		//:КартинкаИзХранилища = Новый Картинка;
		ДД = КартинкаИзХранилища.ПолучитьДвоичныеДанные(Ложь);
//		Картинка.НаборВариантов = Ложь;
		
		Картинка = ПоместитьВоВременноеХранилище(ДД, ЭтаФорма.УникальныйИдентификатор)
		//ЭтаФорма.Элементы.Декорация.Картинка = Новый Картинка(ДД);
	КонецЕсли;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ДатаС = Объект.ДействуетС;
		ДатаПО = Объект.ДействуетПо;
		ВремяС = УстановитьВремяВДате('00010101', Объект.ДействуетС);
		ВремяПО = УстановитьВремяВДате('00010101', Объект.ДействуетПО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Картинка = НовыйКартинка);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(ПолучитьИзВременногоХранилища(Картинка)));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	ДатаВремяПриИзменении("С");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПОПриИзменении(Элемент)
	ДатаВремяПриИзменении("ПО");
КонецПроцедуры

&НаКлиенте
Процедура ВремяСПриИзменении(Элемент)
	ДатаВремяПриИзменении("С");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПОПриИзменении(Элемент)
	ДатаВремяПриИзменении("ПО");
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяПриИзменении(СПО)
	Если СПО = "ПО" И НЕ ЗначениеЗаполнено(ЭтаФорма.ВремяПО) Тогда
		ЭтаФорма.ВремяПО = '00010101235959';
	КонецЕсли;
	Объект["Действует" + СПО] = УстановитьВремяВДате(ЭтаФорма["Дата" + СПО], ЭтаФорма["Время" + СПО]);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура КартинкаНажатиеНаСервере()
	КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Д.Выбрать() Тогда    
		Картинка = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Д.ПолноеИмяФайла), УникальныйИдентификатор);
	КонецЕсли;

	КартинкаНажатиеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

