
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КартинкаИзХранилища = Объект.Ссылка.Хранилище.Получить();
	Если ТипЗнч(КартинкаИзХранилища) = Тип("Картинка") Тогда
		//:КартинкаИзХранилища = Новый Картинка;
		ДД = КартинкаИзХранилища.ПолучитьДвоичныеДанные(Ложь);
//		Картинка.НаборВариантов = Ложь;
		
		Картинка = ПоместитьВоВременноеХранилище(ДД, ЭтаФорма.УникальныйИдентификатор)
		//ЭтаФорма.Элементы.Декорация.Картинка = Новый Картинка(ДД);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КартинкаНажатиеНаСервере()
	КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Д.Выбрать() Тогда    
		Картинка = ПоместитьВоВременноеХранилище(Новый Картинка(Д.ПолноеИмяФайла), УникальныйИдентификатор);
	КонецЕсли;

	КартинкаНажатиеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Хранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Картинка));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Картинка = НовыйКартинка);

КонецПроцедуры
