
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
		Картинка = Объект.Ссылка.Хранилище.Получить();	
	Исключение
	КонецПопытки;
	
	ЭтаФорма.Элементы.Декорация.Картинка = Объект.Ссылка.Хранилище.Получить();
	
	
	
КонецПроцедуры

&НаСервере
Процедура КартинкаНажатиеНаСервере()
	КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Д.Выбрать() Тогда    
		Картинка = Новый Картинка(Д.ПолноеИмяФайла);
	КонецЕсли;

	КартинкаНажатиеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Хранилище = Новый ХранилищеЗначения(Картинка);
КонецПроцедуры
