
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если ТонкийКлиент Или ВебКлиент Тогда
		ОткрытьФорму("Обработка.ЖурналРегистрацииТонкийКлиент.Форма.EventsJournal", Новый Структура("FilterData", ПараметрКоманды));
	#Иначе
		АнализЖурналаРегистрации = ирОбщий.ПолучитьОбъектПоПолномуИмениМетаданныхЛкс("Обработка.ирАнализЖурналаРегистрации");
		Отбор=Новый Структура("Данные", ПараметрКоманды);            
		АнализЖурналаРегистрации.ОткрытьСОтбором(, ,Отбор);
		
	#КонецЕсли 
	
КонецПроцедуры
