
Перем СписокВремениРаботы;

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Стр = Новый Структура;
	Стр.Вставить("ВремяНачала", ВремяНачала);
	Стр.Вставить("ВремяОкончания" , ВремяОкончания);
	
	Закрыть(Стр);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОтмена(Кнопка)
	
	Закрыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭлементыФормы.ВремяНачала.СписокВыбора = СписокВремениРаботы;
	ЭлементыФормы.ВремяОкончания.СписокВыбора  = СписокВремениРаботы;
	
КонецПроцедуры

СписокВремениРаботы = Новый СписокЗначений;

Для Сч = 0 по 23 Цикл
	Часы = Формат(Сч, "ЧЦ=2; ЧВН=; ЧН='00'");
	СписокВремениРаботы.Добавить(Дата("00010101" + Часы + "00"), Часы + ":00");
	СписокВремениРаботы.Добавить(Дата("00010101" + Часы + "30"), Часы + ":30");
КонецЦикла;