// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
	
	
КонецПроцедуры

Процедура УстановитьПометкуКнопки(Кнопка, Нажата = Ложь, Текст = "") Экспорт 
	
	Если Нажата Тогда
		Кнопка.ЦветФонаКнопки = ЦветаСтиля.ЦветФонаГлавнойФормы;
		Кнопка.ЦветТекстаКнопки =  ЦветаСтиля.ЦветТемы;
	Иначе
		Кнопка.ЦветФонаКнопки = ЦветаСтиля.ЦветТемы;
		Кнопка.ЦветТекстаКнопки = ЦветаСтиля.ЦветФонаГлавнойФормы;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Текст) Тогда
		Кнопка.Заголовок = Текст;
	КонецЕсли;
	
КонецПроцедуры
