
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ИмяРецепта = "" Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Блюдо", Блюдо);
		Запрос.УстановитьПараметр("ТТ", ТТ);
		Запрос.УстановитьПараметр("НомерКартыЛояльности", НомерКартыЛояльности);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РецептГостя.Ссылка) КАК Кво
		|ИЗ
		|	Документ.РецептГостя КАК РецептГостя
		|ГДЕ
		|	РецептГостя.Блюдо = &Блюдо
		|	И РецептГостя.ТТ = &ТТ
		|	И РецептГостя.НомерКартыЛояльности = &НомерКартыЛояльности";
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Если РезультатЗапроса.Следующий() Тогда
			ИмяРецепта = "Рецепт № " + Формат(РезультатЗапроса.Кво + 1, "ЧДЦ=; ЧГ=0");
		Иначе
			ИмяРецепта = "Рецепт № 1";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
