
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

Процедура ПослеЗаписи()
	
	ОповеститьОЗаписиНовогоОбъекта(Ссылка);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ВебСтраницаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если не сокрЛП(Представление) = "" Тогда 
		 Web = Обработки.Браузер.ПолучитьФорму("ФормаВебБраузера");
		 Web.АдреснаяСтрока = сокрЛП(Представление);
		 Web.ОткрытьМодально();
	КонецЕсли;	 
		 
КонецПроцедуры

