
&НаСервере
Процедура КомандаCALCНаСервере()
	РезультатJSON = ЛояльностьКлиентСервер.СформироватьJSON_Новый(Лояльность.ПредварительныйРасчетЗаказаПоСсылке(Заказ, Истина));
КонецПроцедуры

&НаКлиенте
Процедура КомандаCALC(Команда)
	КомандаCALCНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаACTIONSНаСервере()
	Лояльность.ОбновитьАкцииГостяПоЗаказу(Заказ);
	РезультатJSON = ЛояльностьКлиентСервер.СформироватьJSON_Новый(Лояльность.ПолучитьДанныеЛояльностиПоЗаказу(Заказ, "ACTIONS"));
КонецПроцедуры

&НаКлиенте
Процедура КомандаACTIONS(Команда)
	КомандаACTIONSНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПривязатьКартуНаСервере()
	Данные = Новый Структура;
	Данные.Вставить("err", 0);
	Данные.Вставить("err_msg");
	Данные.Вставить("request", "REG");
	Данные.Вставить("guest", Новый Структура);
	ДанныеГостя = Данные.guest;
	ДанныеГостя.Вставить("guest_number", КартаДоступа.Идентификатор);
	ДанныеГостя.Вставить("card_number", НомерКарты);
	
	Лояльность.ОбработатьЗапрос_edit(ЛояльностьКлиентСервер.СформироватьJSON_Новый(Данные));
КонецПроцедуры

&НаКлиенте
Процедура КомандаПривязатьКарту(Команда)
	КомандаПривязатьКартуНаСервере();
КонецПроцедуры
