
Функция PricesRegistry(Знач Объект,Знач КодТТ,Знач КатегорияЦен,ОписаниеОшибки)
	Попытка
		
		ДокОбъект = СериализаторXDTO.ПрочитатьXDTO(Объект);
		ДокОбъект.ТТ = Справочники.ИнформационныеБазы.НайтиПоКоду(КодТТ);
		ДокОбъект.КатегорияЦен = Справочники.ТипыЦен.НайтиПоНаименованию(КатегорияЦен);
		ДокОбъект.Автор = Справочники.Пользователи.ПустаяСсылка();
		ДокОбъект.Записать();
		Возврат Истина;
	Исключение
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Ошибка вэбсервиса.",,,,ОписаниеОшибки);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
