Перем фЗакрыть;
Перем ТоваровНаСтранице;

Процедура ПриОткрытии()
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);

	Стиль = БиблиотекаСтилей.СтанцияОплаты;
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
	фЗакрыть = Истина;
	Закрыть("");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаОКНажатие(Элемент)
	
	ОК();
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
КонецПроцедуры

Процедура тпЧекиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	ОК();	
КонецПроцедуры

Процедура тпЧекиПриАктивизацииСтроки(Элемент)
	ТД = ЭлементыФормы.тпЧеки.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Заказ = Документы.Заказ.ПустаяСсылка();
	Иначе
		Заказ = ТД.Заказ;
	КонецЕсли;
КонецПроцедуры

Процедура тпЧекиПриПолученииДанных(Элемент, ОформленияСтрок)
	Для Каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		ДанныеСтроки = ОформлениеСтроки.ДанныеСтроки;
		ОформлениеСтроки.Ячейки.НомерЧека.УстановитьТекст(УбратьВсеБуквы(ДанныеСтроки.НомерЧека));	
	КонецЦикла;
КонецПроцедуры

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

ТоваровНаСтранице = 15;
