
Функция ИмэйлКорректенДопустимыеСимволы(Знач ИсходнаяСтрока)
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	Для зю = 1 По СтрДлина(ИсходнаяСтрока) Цикл
		КодСим = КодСимвола(Сред(ИсходнаяСтрока,зю,1));
		Если (КодСим < 48 ИЛИ КодСим > 57) И (КодСим < 64 ИЛИ КодСим > 90) И (КодСим < 97 ИЛИ КодСим > 122) И (КодСим < 45 ИЛИ КодСим > 46) И (КодСим <> 95) Тогда
            Возврат Ложь;    
        КонецЕсли;
	КонецЦикла;
    
    Возврат Истина;
    
КонецФункции

Функция ИмэйлКорректенНеобходимыеСимволы(Знач ИсходнаяСтрока)
	// пока очень банальная проверка, посмотрим - если потребуется сложная потом допишем
    Если Найти(ИсходнаяСтрока, "@") = 0 Тогда
        Возврат Ложь;	
    КонецЕсли; 
    
    Если Найти(ИсходнаяСтрока, ".") = 0 Тогда
        Возврат Ложь;	
    КонецЕсли; 
    
    Возврат Истина;
    
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПослеЗаписи()
	
	ОповеститьОЗаписиНовогоОбъекта(Ссылка);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
    
    // проверить есть ли собачка, точка и т.д
    Если НЕ ИмэйлКорректенНеобходимыеСимволы(Представление) И СокрЛП(Представление) <> "" Тогда
        Сообщить("Адрес электронной почты некорректен!");
        Отказ = Истина;
        ЭтаФорма.ТекущийЭлемент = ЭтаФорма.ЭлементыФормы.Представление;
        
    // проверить - не содержит ли недопустимые символы строка E-mail
    ИначеЕсли НЕ ИмэйлКорректенДопустимыеСимволы(Представление) Тогда
        Сообщить("Адрес электронной почты содержит недопустимые символы!");
        Отказ = Истина;
        ЭтаФорма.ТекущийЭлемент = ЭтаФорма.ЭлементыФормы.Представление;
    КонецЕсли;
	
	//ПроверитьРассылкиПоАдресу(Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

