&НаСервере
Перем ФЗ;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
		ФЗ = ФоновыеЗадания.Выполнить("ВыполнениеРегламентныхЗаданий.ВыполнитьОбновлениеПризнакаНаличияВпродаже",,"ВыполнитьОбновлениеПризнакаНаличияВпродаже","ВыполнитьОбновлениеПризнакаНаличияВпродаже");
		ФоновоеЗадание = ФЗ.УникальныйИдентификатор;
	Исключение
		ФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ", "ВыполнитьОбновлениеПризнакаНаличияВпродаже"))[0];
		ФоновоеЗадание = ФЗ.УникальныйИдентификатор;
	КонецПопытки;
	Если Параметры.ФоновыйРежим Тогда
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.Независимый;
	КонецЕсли;
	ОбновитьСтатусФоновогоЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусФоновогоЗаданияНаСервере(фЗавершеноУспешно=Ложь) Экспорт
	//:ФЗ= ФоновыеЗадания.Выполнить();
	ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ФоновоеЗадание);
	Если ФЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ФЗ.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Сообщения = ФЗ.ПолучитьСообщенияПользователю(Истина);
		Если Сообщения.Количество() Тогда
			
			ПоследнееСообщение = Сообщения.Получить(Сообщения.ВГраница()).Текст;
			СостояниеФЗ = ЗначениеИзСтрокиВнутр(ПоследнееСообщение);
			ИндикаторХода = Цел(СостояниеФЗ.Прогресс);
			Элементы.Заголовок.Заголовок = СостояниеФЗ.Заголовок;
		Иначе
			Элементы.Заголовок.Заголовок = "..";
		КонецЕсли;		
	Иначе
		Элементы.Заголовок.Заголовок = Строка(ФЗ.Состояние);
		ИндикаторХода = 100;
		Если ФЗ.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Сообщить(ПодробноеПредставлениеОшибки(ФЗ.ИнформацияОбОшибке));
			Элементы.Закрыть.Видимость = 1;
		КонецЕсли;
		Элементы.Декорация1.Видимость = 0;
	КонецЕсли;
	Состояние = Строка(ФЗ.Состояние);
	фЗавершеноУспешно = ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусФоновогоЗадания() Экспорт
	фЗавершеноУспешно = Ложь;
	ОбновитьСтатусФоновогоЗаданияНаСервере(фЗавершеноУспешно);	
	Если фЗавершеноУспешно Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если МодальныйРежим Тогда
		Элементы.Закрыть.Видимость = 0;
		ЭтаФорма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	КонецЕсли;                                                                       	
	ПодключитьОбработчикОжидания("ОбновитьСтатусФоновогоЗадания",1);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Состояние = "Задание выполняется" Тогда
		Отказ = Не ЗавершениеРаботы;	
	КонецЕсли;
	
КонецПроцедуры
