
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
	НомерКнопки = 1;
	Для Каждого Вар ИЗ ВариантыОтвета Цикл
	
		Кнопка = ЭлементыФормы["Кнопка"+НомерКнопки];
		КнопкаТень = ЭлементыФормы["Кнопка"+НомерКнопки+"Тень"];
		
		Кнопка.Видимость = Истина;
		КнопкаТень.Видимость = Истина;
		
		Кнопка.Заголовок = Вар.Представление;
		
		НомерКнопки = НомерКнопки + 1;
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	_Знач = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник,Событие,Данные);
	
	Если ЗначениеЗаполнено(_Знач) Тогда
		Закрыть( _Знач );
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура Кнопка1Нажатие(Элемент)
	
	Закрыть( ВариантыОтвета[0].Значение );
	
КонецПроцедуры

Процедура Кнопка2Нажатие(Элемент)
	
	Закрыть( ВариантыОтвета[1].Значение );
	
КонецПроцедуры

Процедура Кнопка3Нажатие(Элемент)
	
	Закрыть( ВариантыОтвета[2].Значение );
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
