
Перем мОбработкаТайпинга;
Перем мТекстТайпинга;
Перем мПоследнееЗначениеЭлементаТайпинга;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ
// 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	Если ЗначениеЗаполнено(глРабочееМесто) Тогда
		ЭлементыФормы.ДействияФормы.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПослеЗаписи()

	ОповеститьОЗаписиНовогоОбъекта(Ссылка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ТелефонСформироватьПредставление();
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	//инОбновлениеОтображенияВФормеПриТайпинге(ЭтаФорма, ЭтаФорма.ЭлементыФормы.Вид, мОбработкаТайпинга, мТекстТайпинга);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

// Процедура вызывается при изменении реквизита Поле3 - собственно номер телефона.
Процедура Поле3ПриИзменении(Элемент)

	Элемент.Значение = киПривестиНомерТелефонаКШаблону(Элемент.Значение);
	ТелефонСформироватьПредставление();
	
КонецПроцедуры

// Процедура вызывается при изменении реквизита Поле4 - добавочный номер телефона.
Процедура Поле4ПриИзменении(Элемент)
	
	Элемент.Значение = киПривестиНомерТелефонаКШаблону(Элемент.Значение);
	ТелефонСформироватьПредставление();
	
КонецПроцедуры

// Процедура вызывается при изменении реквизита Поле1 - код страны.
Процедура Поле1ПриИзменении(Элемент)
	
	Если Лев(СокрЛ(Поле1), 1) <> "+" И НЕ ПустаяСтрока(Поле1) Тогда
		Поле1 = СокрЛП(Поле1);
		Пока Лев(Поле1, 1) = "0" Цикл
			Поле1 = Сред(Поле1, 2);
		КонецЦикла;
		Если НЕ ПустаяСтрока(Поле1) Тогда
			Поле1 = "+" + Поле1;
		КонецЕсли; 
	КонецЕсли; 
	
	ТелефонСформироватьПредставление();
	
КонецПроцедуры

// Процедура вызывается при изменении реквизита Поле2 - код города.
Процедура Поле2ПриИзменении(Элемент)
	
	ТелефонСформироватьПредставление();
	
КонецПроцедуры

мОбработкаТайпинга                 = Ложь;
мТекстТайпинга                     = "";
мПоследнееЗначениеЭлементаТайпинга = Неопределено;
