
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии()
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		ЭлементыФормы.ПланОбменаСписок.ИзменятьСоставСтрок = Ложь;
	КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ПОЛЕЙ ФОРМЫ

// Обработчик события ПередНачалоДобавления ТП ПланОбменаСписок.
//
Процедура ПланОбменаСписокПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	Если Не ЗначениеЗаполнено(ПланыОбмена.Основной.ЭтотУзел().Код) Тогда
		Предупреждение("Перед добавлением узлов необходимо настроить главный узел.");
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры
