
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

СписокТипов = ЭлементыФормы.ТипГруппы.СписокВыбора;
СписокТипов.Добавить(0,"Группа");
СписокТипов.Добавить(1,"Схема, использовать первую");
СписокТипов.Добавить(2,"Схема, использовать последнюю");
СписокТипов.Добавить(3,"Схема, использовать максимальную");
СписокТипов.Добавить(4,"Схема, использовать минимальную");
СписокТипов.Добавить(5,"Схема, складывать все");
