Перем БылВерх, Разность,БылаВысота;
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭлементыФормы.КнопкаТочка.Доступность = Точность <> 0;
	
	КнопкаОк = ЭлементыФормы.КнопкаОк;
	КнопкаОтмена = ЭлементыФормы.Отмена;
	КнопкаОкТень = ЭлементыФормы.ОкТень;

	КнопкаОк.Верх = 277;
	КнопкаОк.Высота = 290;
	Если ЗапретОтмены Тогда
		КнопкаОтмена.Видимость = 0;
		
				
		КнопкаОк.Верх = КнопкаОтмена.Верх;
		Разность = БылВерх - КнопкаОк.Верх;
		КнопкаОк.Высота = КнопкаОк.Высота + Разность;
		КнопкаОкТень.Верх =КнопкаОк.Верх +2;		
		РазрешитьЗакрытие = Ложь;
	Иначе

		КнопкаОтмена.Видимость = 1;

		КнопкаОк.Высота = БылаВысота;
		КнопкаОк.Верх = БылВерх;     		
	КонецЕсли;
	
	КнопкаОкТень.Высота = КнопкаОк.Высота;
	КнопкаОкТень.Верх = КнопкаОк.Верх+2;
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	ЭлементыФормы.НадписьЗаголовок.Заголовок = ЭтаФорма.Заголовок;	
	Если глПараметрыРМ.ОбрезкаОкон Тогда
		
	Иначе
		Заголовок = "";
	КонецЕсли;

 
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	_Знач = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник,Событие,Данные);
	
	Если ЗначениеЗаполнено(_Знач) Тогда
		Закрыть( _Знач );
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаОКНажатие(Элемент)
	
	ОК();
	
КонецПроцедуры

Процедура КнопкаТочкаНажатие(Элемент)
	
	Точка();
	
КонецПроцедуры

Процедура КнопкаСбросНажатие(Элемент)
	
	Сброс();
	
КонецПроцедуры

Процедура Кнопка0Нажатие(Элемент)
	
	НажатиеКнопки("0");
	
КонецПроцедуры

Процедура Кнопка1Нажатие(Элемент)
	
	НажатиеКнопки("1");
	
КонецПроцедуры

Процедура Кнопка2Нажатие(Элемент)
	
	НажатиеКнопки("2");
	
КонецПроцедуры

Процедура Кнопка3Нажатие(Элемент)
	
	НажатиеКнопки("3");
	
КонецПроцедуры

Процедура Кнопка4Нажатие(Элемент)
	
	НажатиеКнопки("4");
	
КонецПроцедуры

Процедура Кнопка5Нажатие(Элемент)
	
	НажатиеКнопки("5");
	
КонецПроцедуры

Процедура Кнопка6Нажатие(Элемент)
	
	НажатиеКнопки("6");
	
КонецПроцедуры

Процедура Кнопка7Нажатие(Элемент)
	
	НажатиеКнопки("7");
	
КонецПроцедуры

Процедура Кнопка8Нажатие(Элемент)
	
	НажатиеКнопки("8");
	
КонецПроцедуры

Процедура Кнопка9Нажатие(Элемент)
	
	НажатиеКнопки("9");
	
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
	Закрыть();
КонецПроцедуры

Процедура БэкспейсНажатие(Элемент)
	глОтсечкаПростоя();
	стр = элементыформы.ЗначениеВвода.Значение;
	стр = СтрЗаменить(стр, ".", "");
	стр = СтрЗаменить(стр, "_", "");
	стр = СтрЗаменить(стр, "-", "");
	стр = СтрЗаменить(стр, "(", "");
	стр = СтрЗаменить(стр, ")", "");
	стр = СтрЗаменить(стр, "89", "");
	стр = СокрЛП(стр);
	Если СтрДлина(стр) Тогда
		стрЗначениеВвода = "";
		стрЗначениеВвода = Лев(стр, СтрДлина(стр)-1);
		Элементыформы.ЗначениеВвода.Значение = "";
		Элементыформы.ЗначениеВвода.Значение = Лев(стр, СтрДлина(стр)-1);
		
		Если ТипЗначения = "Строка" Тогда
			ЗначениеВвода = стрЗначениеВвода;
		КонецЕсли;
	КонецЕсли;
	Обновить();
	НажатиеКнопки("");
КонецПроцедуры

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота, ", Истина);


КнопкаОк = ЭлементыФормы.КнопкаОк;
БылВерх = КнопкаОк.Верх;
БылаВысота = КнопкаОк.Высота;