
Функция ПолучитьИмяФормыПоТипу(Тип) Экспорт

	Если Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		Возврат "ФормаЗаписиАдреса";
	ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		Возврат "ФормаЗаписиАдресаЭП";
	ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
		Возврат "ФормаЗаписиВебСтраницы";
	ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		Возврат "ФормаЗаписиТелефона";
	Иначе
		Возврат "ФормаЗаписи";
	КонецЕсли;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Тип) Тогда
		Меню = Новый СписокЗначений();
		Для а = 0 По Перечисления.ТипыКонтактнойИнформации.Количество()-1 Цикл
			Меню.Добавить(Перечисления.ТипыКонтактнойИнформации[а], Перечисления.ТипыКонтактнойИнформации[а]);
		КонецЦикла; 
		
		//ВыбранныйПункт = ВладелецФормы.ВыбратьИзМеню(Меню);
		ВыбранныйПункт = Меню.ВыбратьЭлемент();

		Если ВыбранныйПункт = Неопределено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Тип = ВыбранныйПункт.Значение;

	КонецЕсли;

	Если ПолучитьИмяФормыПоТипу(Тип) <> "ФормаЗаписи" Тогда
		Если ЭтаФорма.МодальныйРежим Тогда
			ФормаЗаписи = ПолучитьФорму(ПолучитьИмяФормыПоТипу(Тип), ВладелецФормы, );
			ФормаЗаписи.ЗакрыватьПриВыборе = Ложь;
			ФормаЗаписи.ОткрытьМодально();
		Иначе
			ФормаЗаписи = ПолучитьФорму(ПолучитьИмяФормыПоТипу(Тип), ВладелецФормы, );
			ФормаЗаписи.ЗакрыватьПриВыборе = Ложь;
			ФормаЗаписи.Открыть();
		КонецЕсли; 
		Отказ = Истина;
	КонецЕсли;

	ЭтаФорма.ЗакрыватьПриВыборе = Ложь;
	
КонецПроцедуры

Процедура ПослеЗаписи()

	ОповеститьОЗаписиНовогоОбъекта(Ссылка);
	
КонецПроцедуры
