
Процедура ПриОткрытии()
	ТабличноеПоле1.Очистить();
	Свойства = ПараметрыСмены.Получить();
	Если Свойства <> Неопределено Тогда
		
		Для каждого эл из Свойства Цикл
			Стр = ТабличноеПоле1.Добавить();
			Стр.НаименованиеСвойства = Эл.Ключ;
			Стр.ЗначениеСвойства = Эл.Значение;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

Процедура ОсновныеДействияФормыОсновныеДействияФормыЗакрыть(Кнопка)
	Если ЭтоНовый() Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Модифицированность = Ложь;
КонецПроцедуры
