
#Если Клиент Тогда

Перем ТекущийКаталог Экспорт;	// используется в форме

// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
КонецПроцедуры

// Возвращает таблицу значений с позициями Стоп-листа из основного каталога товаров
//
//
Функция ПолучитьПозицииСтопЛиста() Экспорт

	ТекущийКаталог = глПараметрыРМ.ЗаказМенюОсновное;
	//Если глПараметрыРМ.ЗаказМенюВид = 1 Тогда
		// каталог надо получить из настройки кнопочного меню
		Попытка
			ПараметрыНастройки = ТекущийКаталог.ПолучитьОбъект().ПолучитьСтруктуруПараметров();
			ТекущийКаталог = ПараметрыНастройки.КаталогТоваров;
		Исключение
			ТекущийКаталог = Неопределено;
		КонецПопытки;
	//КонецЕсли; 
	
	Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	СтопЛистСрезПоследних.Товар КАК Товар,
			|	СтопЛистСрезПоследних.Остаток
			|ИЗ
			|	РегистрСведений.СтопЛист.СрезПоследних КАК СтопЛистСрезПоследних
			|ГДЕ
			|	СтопЛистСрезПоследних.ИнформационнаяБаза = &ИнформационнаяБаза
			|	И СтопЛистСрезПоследних.вСтопе
			|	И СтопЛистСрезПоследних.Товар.Владелец = &КаталогТоваров
			|
			|УПОРЯДОЧИТЬ ПО
			|	Товар.Наименование ИЕРАРХИЯ
			|");
	
	Запрос.УстановитьПараметр("ИнформационнаяБаза"	,ПараметрыСеанса.ТекущаяИБ);
	Запрос.УстановитьПараметр("КаталогТоваров"		,ТекущийКаталог);
	
	ПозицииСтопЛиста = Запрос.Выполнить().Выгрузить();
	
	Возврат ПозицииСтопЛиста;
КонецФункции
 
#КонецЕсли
