#Если ТонкийКлиент Тогда
	&НаСервере
#КонецЕсли
Функция Инициализация() Экспорт
	Если ирКэш.ЭтоФайловаяБазаЛкс() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстЗапроса = "
	|IF OBJECT_ID('КонтрольныеПоказатели_Значения') IS NULL BEGIN
	|	CREATE TABLE КонтрольныеПоказатели_Значения (
	|	
	|	 Ид bigint IDENTITY PRIMARY KEY
	|	 ,ДатаРегистрации datetime NOT NULL DEFAULT ((GETDATE()))
	|	 ,Хост VARCHAR(30) NOT NULL
	|	 ,КодПоказателя smallint NOT NULL
	|	 ,ЗначениеПоказателя numeric(19,5) NOT NULL
	|	 ,ДатаВыгрузки datetime  NULL
	|	) 
	|
	|	CREATE INDEX IX_ДатаРегистрации ON КонтрольныеПоказатели_Значения (ДатаРегистрации)
	|	CREATE INDEX IX_ДатаВыгрузки ON КонтрольныеПоказатели_Значения (ДатаВыгрузки)
	|END
	|";
	
	Отказ = Ложь; ТексОшибки = "";
	SQL.ВыполнитьЗапрос(Коннект(ТекущаяУниверсальнаяДатаВМиллисекундах()/(1000*600)),ТекстЗапроса,Отказ,ТексОшибки);
	Если Отказ Тогда
		ЗаписьЖурналаРегистрации("ЖР.Ошибка", УровеньЖурналаРегистрации.Ошибка, ,,ТексОшибки + Символы.ПС + ТекстЗапроса);
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
#Если ТонкийКлиент Тогда
	&НаСервере
#КонецЕсли
Функция Коннект(ПризнакДляСбросаКэша=0) Экспорт
	Возврат SQL.ПодключитьсяКsup_kkm(ПараметрыСеанса.ТекущаяИБ);	
КонецФункции
#Если ТонкийКлиент Тогда
	&НаСервере
#КонецЕсли
Функция Записать(Знач КодПоказателя, Знач ЗначениеПоказателя, Знач Примечание = неопределено) Экспорт
	Если Не ПараметрыСеанса.ЕстьКонтрольныеПоказатели тогда
		Возврат Новый Структура("Отказ, ТекстОшибки",Истина, "нет таблицы контрольных показателей");
	КонецЕсли;
	
	Компьютер = ЖурналРегистрации.Компьютер();
	
	ТекстЗапроса = СтрШаблон("INSERT INTO dbo.КонтрольныеПоказатели_Значения
	|(
	|  ДатаРегистрации
	| ,Хост
	| ,КодПоказателя
	| ,ЗначениеПоказателя
	|)
	|VALUES
	|(
	| GetDate()  -- Дата
	| ,'%4' -- Хост - varchar(25)
	| ,%2 	-- КодПоказателя
	| ,%3 	-- ЗначениеПоказателя
	|)"
	, Компьютер
	, КодПоказателя
	, ЗначениеПоказателя
	);
	
	Отказ = Ложь;
	ТекстОшибки = "";
	Попытка
		SQL.ВыполнитьЗапросАсинхронно(Коннект(), ТекстЗапроса, Отказ, ТекстОшибки);	
		Если Отказ Тогда
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Исключение
		SQL.ВыполнитьЗапрос(SQL.ПодключитьсяКsup_kkm(ПараметрыСеанса.ТекущаяИБ), ТекстЗапроса, Отказ, ТекстОшибки);
	КонецПопытки;
	
	Возврат Новый Структура("Отказ, ТекстОшибки",Отказ, ТекстОшибки);
КонецФункции
