
Процедура ВыгрузитьДанные(Кнопка)
	
	ТекущиеДанные = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	АвтообменДанными.ВыгрузитьДанныеXML(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

Процедура ОткрытьОбработкуВыгрузки(Кнопка)
	
	ТекущиеДанные = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.Ссылка.ПолучитьОбъект().ОткрытьОбработкуУниверсальныйОбменДаннымиXML();
	
КонецПроцедуры

Процедура ЗагрузитьДанные(Кнопка)

	ТекущиеДанные = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	АвтообменДанными.ЗагрузитьДанныеXML(ТекущиеДанные.Ссылка, Истина);
	
КонецПроцедуры
