
Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеСтроки.Ссылка.Режим=1 Тогда
		СтрРежим = "в меньшую";
	ИначеЕсли ДанныеСтроки.Ссылка.Режим=2 Тогда
		СтрРежим = "в большую";
	ИначеЕсли ДанныеСтроки.Ссылка.Режим=3 Тогда
		СтрРежим = "по правилам";
	Иначе
		СтрРежим = "???";
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Режим.УстановитьТекст(СтрРежим);
	
КонецПроцедуры


Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
КонецПроцедуры

