
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Не заполнено наименование!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	ПровСсылка = Ссылка;
	Если НЕ ПроверкаУникальностиРеквизитаСправочника(ПровСсылка, "Наименование", Наименование) Тогда
		Сообщить("Набор прав с таким наименованием уже есть!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
