
Процедура ПриОткрытии()
	ИнтерфейсАдмина.ЗаполнитьСписокДнейНедели(СписокДниНедели,Привязка);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ПустаяСтрока(Наименование) Тогда
		Предупреждение("Необходимо задать наименование");
		ТекущийЭлемент = ЭлементыФормы.Наименование;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
					|ВЫБРАТЬ Ссылка,
					|	Привязка
					|ИЗ Справочник.ТипыДней
					|ГДЕ Ссылка <> &Ссылка
					|И НЕ ПометкаУдаления
					|");
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для н=1 По СписокДниНедели.Количество() Цикл
			
			Если СписокДниНедели[н-1].Пометка И ДеньНеделиВключен(Выборка.Привязка,н) Тогда
				Предупреждение( """" + СписокДниНедели[н-1].Значение + """ уже привязан к типу дней """ + Выборка.Ссылка + """");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Привязка = ИнтерфейсАдмина.СписокПометокВЧисло(СписокДниНедели);
	
КонецПроцедуры

Процедура ПолеСпискаДниНеделиПриИзмененииФлажка(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры
