
// формирует текстовое сообщение для оповещения
Функция СформироватьСообщениеДляОповещенияПоШаблону(Заказ, ГруппаПечати, АвторЗаказа, Подача, Товар, РежимПодтверждения=0, ОтменаГотовности, СЗаголовком = Истина) Экспорт 
	
	ТекстСообщения = ?(СЗаголовком, "От " + ГруппаПечати.Наименование + ", для " + АвторЗаказа + Символы.ПС , "") +
						НаимПосадочногоМеста(Заказ.ПосадочноеМесто) + " - Заказ " + Заказ.Номер;
		
	Если РежимПодтверждения = 2 Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + Товар.Наименование + ?(ОтменаГотовности, " - НЕ готов!", " - готов");
	ИначеЕсли РежимПодтверждения = 1 Тогда
		ТекстСообщения = ТекстСообщения + " Подача " + Подача + ?(ОтменаГотовности, " - НЕ готова!", " - готова");
	Иначе
		ТекстСообщения = ТекстСообщения + ?(ОтменаГотовности, " - НЕ готов!", " - готов");
	КонецЕсли;

	Возврат ТекстСообщения;
	
КонецФункции