
Функция ПолучитьОтчет(ТекстJSON) Экспорт 
	
	ТекущаяИБ = ПараметрыСеанса.ТекущаяИБ;
	АдресСервиса = ПолучитьДополнительноеСвойствоИнформационнойБазы("СерверСУПУП_ТЕСТ", ТекущаяИБ);		
		
	Определение = Новый WSОпределения(АдресСервиса);   
    Прокси = Новый WSПрокси(Определение, "http://URI.com", "supUP", "supUPSoap");       
	
	Возврат Прокси.Report(ТекстJSON);
     
КонецФункции 

Функция ПолучитьДополнительноеСвойствоИнформационнойБазы(Свойство, ИБ = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ДополнительныеСвойства.Значение
					|ИЗ
					|	РегистрСведений.ДополнительныеСвойства КАК ДополнительныеСвойства
					|ГДЕ
					|	ДополнительныеСвойства.Свойство = &Свойство";
	
	Если ЗначениеЗаполнено(ИБ) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ДополнительныеСвойства.ИнформационнаяБаза = &ИнформационнаяБаза";
		Запрос.УстановитьПараметр("ИнформационнаяБаза", ИБ);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		ВыборкаРезультата = Результат.Выбрать();
		ВыборкаРезультата.Следующий();
		Возврат ВыборкаРезультата.Значение;
	КонецЕсли;
	
КонецФункции

