
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ИнформационныеБазы") Тогда
		Хост = ПараметрКоманды.СерверХост;
		Хост = СтрЗаменить(Хост, "-ost", "-serv");
		ИБ = ПараметрКоманды;
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.РабочиеМеста") Тогда
		Хост = Сеть.ИмяХостаРМ(ПараметрКоманды, Истина);
		ИБ = ПараметрКоманды.ИнформационнаяБаза;
	КонецЕсли;
	Сеть.ЗапуститьDameWare(Хост, ИБ);
КонецПроцедуры
