
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПослеЗаписи()
	
	ОповеститьОЗаписиНовогоОбъекта(Ссылка);
	
КонецПроцедуры

// Обработка внешнего события
//
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	ШтрихКод = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник, Событие, Данные);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Формирование внутреннего ШК EAN13
//
// Параметры:
//  ШтрихКод     - штрих-код (без контрольной цифры)
//  Тип          - тип штрих-кода: 13 - EAN13, 8 - EAN8
//
// Возвращаемое значение:
//  Контрольный символ штрих-кода
//
Процедура КнопкаСформироватьНажатие(Элемент)
	
	ПрефиксВнутреннихШК = Константы.ПрефиксВнутреннихШК.Получить();
	
	Если НЕ ЗначениеЗаполнено(ПрефиксВнутреннихШК) Тогда
		ПрефиксВнутреннихШК = 21;
		Константы.ПрефиксВнутреннихШК.Установить(ПрефиксВнутреннихШК);
	КонецЕсли;
	
	ШтрихКод = СформироватьШК( Строка(ПрефиксВнутреннихШК) + Код );
	
КонецПроцедуры

