
// Обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Не заполнено наименование!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если ЕстьПринтер И НЕ ПараметрыСеанса.РаспределенныйРежим Тогда
		Если Оборудование.Количество() = 0 Тогда
			Сообщить("Нужно указать хотя бы один принтер!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		Для каждого СтрокаТЧ Из Оборудование Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Принтер) Тогда
				Сообщить("Не выбран принтер № "+СтрокаТЧ.НомерСтроки,СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры
