
Процедура ОтобразитьРезультат()
	
	Если Результат.Ошибка Тогда
		ТестРезультат = Результат.Описание+Символы.ВК+Символы.ПС+Результат.Подробно;
	Иначе
		ТестРезультат = "Ошибок нет";
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ОписаниеПрофиля) ТОгда
		
		Предупреждение("Данная обработка используется для работы конфигурации. Вручную ее вызывать запрещено.");	
		Отказ = Истина;
		Возврат;  		
	КонецЕсли;   
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ОК(Кнопка)
	
	ПараметрыТО.CurrentDeviceNumber	= CurrentDeviceNumber;
	
	Закрыть("ОК");
	
КонецПроцедуры

Процедура КнопкаПараметрыДействие(Элемент)
	
	Пока DRV.DeviceCount < CurrentDeviceNumber Цикл
        DRV.AddDevice();
	КонецЦикла;
	
	DRV.CurrentDeviceNumber	= CurrentDeviceNumber;
	
	DRV.ShowProperties();
	
	Если DRV.EnableKeyboardCardEntry=1 Тогда
		DRV.EnableKeyboardCardEntry=0;
		Предупреждение("Клавиатурный ввод карты не поддерживается!",5);
	КонецЕсли;
	
КонецПроцедуры
