
Перем ЭлАдресРазработчика Экспорт; // элемктронный адрес разработчика программы.


///////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Формирует начальный текст сообщения.
//
Функция СформироватьТекстИнформацииОСистеме() Экспорт
	
	Текст = "Конфигурация: " + СокрЛП(Метаданные.Синоним) + "
	|Номер версии: " + СокрЛП(Метаданные.Версия) + "
	|Описание проблемы: " + Символы.ПС;
	
	Возврат Текст;
	
КонецФункции

// Формирует префикс темы сообщения.
//
Функция СформироватьПрефиксТемыСообщения() Экспорт
	
	Возврат "[" + СокрЛП(Метаданные.Имя) + ВидСообщения + "]";
	
КонецФункции

ЭлАдресРазработчика = "traktir@softbal.spb.ru";
