
Перем ТаблицаЗадания;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ОписаниеПрофиля) ТОгда
		Предупреждение("Данная обработка открывается только из справочника торгового оборудования!",5);
		Отказ = Истина;
		Возврат;  		
	КонецЕсли;   
	
	// заполнение списка COM, LPT и Ethernet портов
	Для н=1 По 32 Цикл
		ЭлементыФормы.ПортПодключения.СписокВыбора.Добавить(н, "COM"+н);
	КонецЦикла;
	//Для н=1 По 4 Цикл
	//	ЭлементыФормы.ПортПодключения.СписокВыбора.Добавить("LPT"+н);
	//КонецЦикла;
	
	НомерПозиции = 1;
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.СерверIPадрес			.Доступность = ИспользоватьСервер;
	ЭлементыФормы.СерверIPпорт			.Доступность = ИспользоватьСервер;
	ЭлементыФормы.НадписьСерверIPадрес	.Доступность = ИспользоватьСервер;
	ЭлементыФормы.НадписьСерверIPпорт	.Доступность = ИспользоватьСервер;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Сохранение параметров и закрытие формы
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	ЗаполнитьЗначенияСвойств(ПараметрыТО,ЭтотОбъект);
	
	Закрыть("ОК");
	
КонецПроцедуры

Процедура КнопкаДобавитьПозициюНажатие(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("НомерПозиции", НомерПозиции);
	ПараметрыДействия.Вставить("Количество", 1);
	
	ВыполнитьДействие("ДобавитьПозицию", ПараметрыДействия);
	
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
	Иначе
		Предупреждение("ОК!");
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаУдалитьПозициюНажатие(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("НомерПозиции", НомерПозиции);
	ПараметрыДействия.Вставить("Количество", 1);
	
	ВыполнитьДействие("УдалитьПозицию", ПараметрыДействия);
	
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
	Иначе
		Предупреждение("ОК!");
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаРазрешитьВсеНажатие(Элемент)
	
	ВыполнитьДействие("РазрешитьВсе");
	
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
	Иначе
		Предупреждение("ОК!");
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаЗапретитьВсеНажатие(Элемент)
	
	ВыполнитьДействие("ЗапретитьВсе");
	
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
	Иначе
		Предупреждение("ОК!");
	КонецЕсли;
	
КонецПроцедуры

