
Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтотОбъект.Количество() Тогда
		Возврат;
	КонецЕсли;
	//:Источник = РегистрыСведений.ДоступностьКаталоговТоваров.СоздатьНаборЗаписей();
	
	Попытка
		ИнформационнаяБаза = ЭтотОбъект[0].ИнформационнаяБаза;
		ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		ОбменДанными.Получатели.Очистить();
		ОбменДанными.Получатели.Добавить(ИнформационнаяБаза.ПолучитьОбъект().ПолучитьУзелРИБ());
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры
