
Процедура УстановитьНажатие(Элемент)
	Установить();	
КонецПроцедуры

Процедура РедактироватьНажатие(Элемент)
	Если НЕ Константы.ДопЯзыки.Получить() Тогда
		Предупреждение("Использование доп. языков отключено!");
		Возврат;
	КонецЕсли;
	
	ПечатьЗаказа = Обработки.ПечатьЗаказа.ПолучитьФорму("Словарь");
	ПечатьЗаказа.ПрочитатьСловарь();
	ПечатьЗаказа.Открыть();
	
КонецПроцедуры


Процедура СправочникСписокПередУстановкойПометкиУдаления(Элемент, Отказ)
	Язык = Элемент.ТекущаяСтрока.Ссылка.ПолучитьОбъект();
	Язык.ПометкаУдаления = НЕ Язык.ПометкаУдаления;
	Если Язык.ПометкаУдаления Тогда 
		Отказ = Истина;
        Ответ = Вопрос("Очистить перевод справочников и служебных слов для данного языка?",РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ =  КодВозвратаДиалога.Да Тогда
			НаборЗаписей = РегистрыСведений.СловарьСлужебныхСлов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Язык.Установить(Язык.Ссылка);
			НаборЗаписей.Прочитать();
			Наборзаписей.Очистить();
			НаборЗаписей.Записать();
			НаборЗаписей = РегистрыСведений.ДопНаименования.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Язык.Установить(Язык.Ссылка);
			НаборЗаписей.Прочитать();
			Наборзаписей.Очистить();
			НаборЗаписей.Записать();
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;  
		Язык.Записать();
     КонецЕсли;
		
КонецПроцедуры

// установка и обновление словаря служебных слов
Функция Установить(Обновляем=Ложь) Экспорт 
	Перем ЗагрузитьПеревод;
	Таб = Справочники.Языки.ПолучитьМакет("ДопЯзыки"); 
	Список = Новый СписокЗначений;
	Для НомСтр=1 По Таб.ВысотаТаблицы  Цикл
		_Код = Лев(Таб.Область(НомСтр, 1).Текст,3);
		Пока СтрДлина(_Код) < 3 Цикл
			_Код = _Код+" ";
		КонецЦикла;
		
		_Наим = СокрЛП(Таб.Область(НомСтр, 2).Текст);
		
		СпрЯзыки = Справочники.Языки;
		НайденнаяСсылка = СпрЯзыки.НайтиПоКоду(_Код);
		
		Если Обновляем И НайденнаяСсылка <> СпрЯзыки.ПустаяСсылка()Тогда
			Если  НЕ НайденнаяСсылка.ПометкаУдаления Тогда
				Список.Добавить(_Код,_Код+" - "+_Наим);
			КонецЕсли;
		ИначеЕсли НЕ Обновляем И НайденнаяСсылка = СпрЯзыки.ПустаяСсылка() Тогда
			Список.Добавить(_Код,_Код+" - "+_Наим);
		КонецЕсли;
	КонецЦикла;
	
	Если Список.Количество() = 0 Тогда
		Предупреждение("Все типовые языки уже установлены!",50);
		Возврат Ложь;
	КонецЕсли;
	
	Если Список.ОтметитьЭлементы("Выберите нужные языки...")  Тогда
		Если Обновляем Тогда 
			Ответ = Вопрос("Для выбранных языков словарь служебных слов будет заполнен стандартными настройками.
			|Все сделанные изменения будут потеряны! Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		УстКоды = "";
		Для каждого ДопЯзык Из Список Цикл
			Если НЕ(ДопЯзык.Пометка)  Тогда
				Продолжить;
			КонецЕсли;
			
			УстКоды = УстКоды + Лев(ДопЯзык.Представление,3)+",";
			Если Обновляем Тогда
				НайденнаяСсылка = СпрЯзыки.НайтиПоКоду(Лев(ДопЯзык.Представление,3));
				Если НайденнаяСсылка <> СпрЯзыки.ПустаяСсылка() Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СпрЯзыки = Справочники.Языки.СоздатьЭлемент();
			СпрЯзыки.Код = Лев(ДопЯзык.Представление,3);
			СпрЯзыки.Наименование = Сред(ДопЯзык.Представление,7);
			СпрЯзыки.Записать();
		КонецЦикла;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
	Если НЕ ПустаяСтрока(УстКоды) Тогда
		ФормаПечатиЗаказа = Обработки.ПечатьЗаказа.ПолучитьФорму("Словарь");
		ФормаПечатиЗаказа.Данные = УстКоды;
		ЗагрузитьПеревод = Истина;
		ФормаПечатиЗаказа.ПрочитатьСловарь(ЗагрузитьПеревод);
		ФормаПечатиЗаказа.ОК();
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Процедура ДействияФормыОбновитьСловарь(Кнопка)
 Установить(Истина);	  
КонецПроцедуры

Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
	Если ТолькоПросмотр Тогда
		ЭлементыФормы.ДействияФормы.Кнопки.Установить.Доступность = Ложь;
		ЭлементыФормы.ДействияФормы.Кнопки.Словарь.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

