
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Наименование) ТОгда
		Сообщить("Не заполнено наименование!", СтатусСообщения.Важное);
		Отказ = Истина;
	Иначе
		
		//Поз1 = Найти(Наименование,"["); 
		//Поз2 = Найти(Наименование,"]"); 
		//Наименование = лев(Наименование,Поз1-1) + сред(Наименование,поз2+1);
		//Наименование = СтрЗаменить(Наименование,"->","");
		//Если Не  ЭтоГруппа Тогда
		//
		//	Наименование = "["+НаборПейджеров+"]"+"->"+Наименование;	
		//
		//КонецЕсли; 
		//
	КонецЕсли;
	
	Если ЭтоГруппа И не ЭтоНовый() Тогда
	
		Выб = Справочники.Пейджеры.Выбрать(Ссылка);
		Пока Выб.Следующий() Цикл
		
			об = выб.ПолучитьОбъект();
			об.НаборПейджеров = НаборПейджеров;
			об.Записать();
		
		КонецЦикла; 
	
	КонецЕсли; 
	
КонецПроцедуры
