
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпособПолученияЧека = -1;
	Email = Параметры.Email;
	НомерТелефона = Параметры.НомерТелефона;
	ВариантОтправкиЭлектронногоЧека = Параметры.ВариантОтправкиЭлектронногоЧека;
//УДАЛИТЬ	ДекорацияКеглиРубли = Параметры.ДекорацияКеглиРубли;
	
	ПодвалКеГЛиРубли.Очистить();
	ПодвалКеГЛиРубли.Вывести(Параметры.ПодвалКеГЛиРубли);
	//ПодвалКеГЛиРубли.ФиксацияСверху = 5;
	//ПодвалКеГЛиРубли.ФиксацияСлева = 3;
	//ПодвалКеГЛиРубли.Защита = Истина;
	
	ОбновитьОтображениеЭлементовДляМестаРеализации(Параметры.РабочееМесто.МестоРеализации, Параметры.РабочееМесто.Фирма.ТипТТ);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьEmail();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ГлавнаяФормаАК_СбросЗаказаСоСтандартнойКассы" Тогда
		Если (Параметр = глРабочееМесто ИЛИ СокрЛП(Параметр) = СокрЛП(глРабочееМесто.ПрофильВхода)) И Открыта() Тогда
			Закрыть(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , , "Форма=" + ИмяФормы + Символы.ПС + "Кнопка=" + ТекущийЭлемент.Заголовок);
	СпособПолученияЧека = -1;
	Закрыть(СтруктураРезультата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВыбор(Команда)

	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , , "Форма=" + ИмяФормы + Символы.ПС + "Кнопка=" + ТекущийЭлемент.Заголовок);
	Закрыть(СтруктураРезультата());
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбора(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , , "Форма=" + ИмяФормы + Символы.ПС + "Кнопка=" + ТекущийЭлемент.Заголовок);
	глОтсечкаПростоя();
	
	ОтобразитьНачальнуюСтраницу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантВыбор(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , , "Форма=" + ИмяФормы + Символы.ПС + "Кнопка=" + ТекущийЭлемент.Заголовок);
	глОтсечкаПростоя();
	
	СпособПолученияЧека = Число(Прав(ТекущийЭлемент.Имя, 1));
	Если СпособПолученияЧека = 0 Тогда
		Закрыть(СтруктураРезультата());
	ИначеЕсли СпособПолученияЧека = 1 Тогда
		Если ВариантОтправкиЭлектронногоЧека = 1 Тогда
			
			СтруктураОшибки = Новый Структура;
			СтруктураОшибки.Вставить("ТекстОшибки1", "К сожалению, сервис временно недоступен.");
			СтруктураОшибки.Вставить("ТекстОшибки2", "Вы можете отправить чек по email, или обратитесь к продавцу-консультанту.");
			СтруктураОшибки.Вставить("РезультатКнопкиОК", "");
			ОткрытьФорму("Обработка.ГлавнаяФормаАК.Форма.ФормаОшибка", СтруктураОшибки, ЭтотОбъект, Истина);
			
			Если ПустаяСтрока(Email) Тогда
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Страница_3_5;
			Иначе
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Страница_3_4;
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(НомерТелефона) Тогда
			ВвестиНомерТелефона();
			Возврат;
		КонецЕсли;
		ОбновитьНадписьНомерТелефона();
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Страница_3_2;
	ИначеЕсли СпособПолученияЧека = 2 Тогда
		Если ПустаяСтрока(Email) Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Страница_3_5;
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Страница_3_4;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводНомера(Команда)
	
	ЗарегистрироватьСобытие("Автокасса.Нажатие кнопки", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Информация"), , , "Форма=" + ИмяФормы + Символы.ПС + "Кнопка=" + ТекущийЭлемент.Заголовок);
	глОтсечкаПростоя();
	
	ВвестиНомерТелефона();
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНомерТелефона()
	
	глОтсечкаПростоя();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НомерТелефона", НомерТелефона); 
	ПараметрыФормы.Вставить("ВидРезультата", 0);
	ПараметрыФормы.Вставить("ДлинаПоля", 10);
	ПараметрыФормы.Вставить("РежимПароля", Ложь);
	ПараметрыФормы.Вставить("ЗаголовокНадписиВведитеНомер", "Введите номер мобильного телефона, 
	|на который будет отправлен чек:");
	ПараметрыФормы.Вставить("РабочееМесто", глРабочееМесто);
//УДАЛИТЬ	ПараметрыФормы.Вставить("ДекорацияКеглиРубли", ДекорацияКеглиРубли);
	ПараметрыФормы.Вставить("ПодвалКеГЛиРубли", ПодвалКеГЛиРубли);
	
	ОткрытьФорму("Обработка.ГлавнаяФормаАК.Форма.ВводЧисла", ПараметрыФормы, ЭтотОбъект, , , , Новый ОписаниеОповещения("ОбрабокаЗакрытияФормыВводЧисла", ЭтотОбъект));
	
КонецПроцедуры


&НаКлиенте
Процедура ОбрабокаЗакрытияФормыВводЧисла(Результат, ДополнительныеПараметры) Экспорт 
	
	глОтсечкаПростоя();
	
	Если Результат = Неопределено Тогда
		// по таймауту
		Возврат;
		//СпособПолученияЧека = -1;
		//Закрыть(СтруктураРезультата());
	КонецЕсли;
	
	Если Результат.Ошибка = -1 Тогда
		// нажали назад 		
		СпособПолученияЧека = -1;
		Закрыть(СтруктураРезультата());
		
	ИначеЕсли Результат.Ошибка = -2 Тогда
		
		ОтобразитьНачальнуюСтраницу();
		
	Иначе
		
		Если ЗначениеЗаполнено(Результат.ЗначениеВвода) Тогда
			НомерТелефона = Результат.ЗначениеВвода;
		КонецЕсли;
		
		Закрыть(СтруктураРезультата());
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СтруктураРезультата()
	
	Возврат Новый Структура("СпособПолученияЧека,Email,НомерТелефона", СпособПолученияЧека, Email, НомерТелефона);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьEmail()
	
	ШрифтПомельче = Новый Шрифт(Элементы.НадписьEmail.Шрифт,,14);
	
	Собака = СтрНайти(Email, "@");
	ПредставлениеEmail = Лев(Email, Мин(4, Цел(Собака / 2))) + "*****" + Сред(Email, Собака);
	
	Элементы.НадписьEmail.Заголовок = Новый ФорматированнаяСтрока(
	"Чек будет отправлен на Ваш e-mail:" + Символы.ПС,
	Новый ФорматированнаяСтрока(ПредставлениеEmail + Символы.ПС + Символы.ПС, Новый Шрифт(Элементы.НадписьEmail.Шрифт, , , Истина, Истина)),
	Новый ФорматированнаяСтрока("Изменить e-mail Вы можете" + Символы.ПС, ШрифтПомельче),
	Новый ФорматированнаяСтрока("в Личном кабинете на ", ШрифтПомельче),
	Новый ФорматированнаяСтрока("www.kegelbum.ru" + Символы.ПС, Новый Шрифт(ШрифтПомельче, , , Истина, Истина, Истина)),
	Новый ФорматированнаяСтрока("или в Мобильном приложении КуулКЛЕВЕР", ШрифтПомельче)
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьНомерТелефона()
	
	//ПредставлениеНомераТелефона = СтрШаблон("+7 (%1) ***-*%2-%3", Лев(НомерТелефона, 3), Сред(НомерТелефона, 8, 1), Сред(НомерТелефона, 9, 2));
	ПредставлениеНомераТелефона = СтрШаблон("+7 (%1) %2-%3-%4", Лев(НомерТелефона, 3), Сред(НомерТелефона, 4, 3), Сред(НомерТелефона, 7, 2), Сред(НомерТелефона, 9, 2));
	Элементы.НадписьНомерТелефона.Заголовок = Новый ФорматированнаяСтрока(
	"Чек будет отправлен" + Символы.ПС + "в СМС на номер" + Символы.ПС,
	Новый ФорматированнаяСтрока(ПредставлениеНомераТелефона, Новый Шрифт(Элементы.НадписьEmail.Шрифт, , , Истина, Истина)));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьНачальнуюСтраницу()

	СпособПолученияЧека = -1;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Страница_3_1;

КонецПроцедуры // ()

&НаСервере
Процедура ОбновитьОтображениеЭлементовДляМестаРеализации(МестоРеализации, ТипТТ = Неопределено)
	
	Если ТипТТ = Неопределено Тогда
		ТипТТ = ПредопределенноеЗначение("Справочник.ТипыТТ.КМ");
	КонецЕсли;
	
	// блок Кухни Полли
	Если ТипТТ = ПредопределенноеЗначение("Справочник.ТипыТТ.Ресторан") Тогда
		
		Элементы.ЛогоККГурмэ.Картинка = БиблиотекаКартинок.ЛогоКухняПолли;

//УДАЛИТЬ		Элементы.ГруппаСтрокаСостояния.Видимость = Истина;
		
//УДАЛИТЬ		Элементы.ДекорацияКеглиРубли.Видимость = Ложь;
//УДАЛИТЬ		Элементы.ПодвалКеГЛиРубли.Видимость = Истина;
		
	КонецЕсли;
	
	// блок Классного магазина
	Если ТипТТ = ПредопределенноеЗначение("Справочник.ТипыТТ.КМ") Тогда
		
		// шапка
		
//УДАЛИТЬ		Элементы.ГруппаСтрокаСостояния.Видимость = Истина;
		
//УДАЛИТЬ		Элементы.ДекорацияКеглиРубли.Видимость = Ложь;
//УДАЛИТЬ		Элементы.ДекорацияКеглиРубли.Заголовок = ДекорацияКеглиРубли;
		
//УДАЛИТЬ		Элементы.ПодвалКеГЛиРубли.Видимость = Истина;
		
		Элементы.ВариантВыбор1.Доступность = Ложь;
		Элементы.ВариантВыбор2.Доступность = Ложь;
	КонецЕсли; 
	
	// блок МОКП
	Если ТипТТ = ПредопределенноеЗначение("Справочник.ТипыТТ.МОКП") Тогда
		//TODO проверка на ФН
		Элементы.ВариантВыбор1.Доступность = Параметры.ФискальныйРежим И Параметры.ВариантОтправкиЭлектронногоЧека > 0;
		Элементы.ВариантВыбор2.Доступность = Параметры.ФискальныйРежим И Параметры.ВариантОтправкиЭлектронногоЧека > 0;
		Элементы.ПодвалКеГЛиРубли.Ширина = 75;
		Элементы.ПодвалКеГЛиРубли.Высота = 7;
	КонецЕсли; 
	
	// блок Общий
	

	
КонецПроцедуры

#КонецОбласти

