
Перем ПараметрыТО Экспорт;   // Параметры торгового оборудования.
Перем Результат Экспорт;     // Результат выполнения действия.
Перем AHK;
// Производит инициализацию торгового оборудования.
//
Процедура Инициализация() Экспорт
	РаботаСокнами = РаботаСокнами;
	Если РаботаСокнами = Неопределено Тогда
		
		Попытка
			AHK = Новый COMОбъект("AutoHotkey.Script.Unicode");
		Исключение
		КонецПопытки;
		
		Если AHK = Неопределено Тогда
			Попытка
				AHK = Новый COMОбъект("AutoHotkey.Script");	
			Исключение
			КонецПопытки;
			
			
		КонецЕсли;
	Иначе
		AHK = РаботаСокнами.AHK();	
	КонецЕсли;
	
	Скрипт = "
	|#NoTrayIcon
	|#SingleInstance Force
	|
	|Global Text := ""%Текст""
	|
	|Global THEME_COLOR := 0x068A3F
	|Global ACCENT_COLOR := 0xFF6E3F
	|Global AW_BLEND := 0x00080000
	|Global AW_HOR_POSITIVE = 1
	|Global AW_SLIDE = 0x00040000
	|
	|animateEffect := AW_SLIDE|AW_HOR_POSITIVE
	|
	|Gui, +AlwaysOnTop -Caption +ToolWindow +LastFound +hwndHwnd
	|Gui, Color, % THEME_COLOR
	|Gui, Font, , Consolas
	|Gui, Font, s10, Consolas	
	|Gui, Add, Text, cWhite vTxt xCenter YCenter, %Text%
	|
	|return
	|
	|
	|~LButton::
	|	MouseGetPos,X,Y,curHwnd
	|	if (hwnd == curHwnd)
	|	{
	|		animateEffect := AW_SLIDE|2
	|		DllCall(""AnimateWindow"", Ptr, hwnd, UInt, 300, UInt, animateEffect) 
	|		Gui, Hide
	|	}
	|return";
	
	Текст = "";
	Текст = СтрЗаменить(Текст, Символы.ПС, "`n");
	Текст = СтрЗаменить(Текст, ";", "");
	Текст = СтрЗаменить(Текст, """", """""");
	
	Скрипт = СтрЗаменить(Скрипт, "%Текст", Текст);
	
	
	Попытка
		AHK.ahkTextDLL(Скрипт);
	Исключение
	КонецПопытки;

	
КонецПроцедуры

// Выполняет действие с ТО.
//
// Параметры:
//  Действие - имя действия,
//  ПараметрыДействия - произвольный набор параметров, туда же присваивается возвращаемое значение функции.
//
Процедура ВыполнитьДействие(Действие,ПараметрыДействия) Экспорт
	ПараметрыВыходные = Новый Структура;
	ВыполнитьКоманду(Действие, ПараметрыДействия, ПараметрыВыходные);	
КонецПроцедуры

Функция ВыполнитьКоманду(Действие, ПараметрыВходные, ПараметрыВыходные) Экспорт
	Если ПараметрыВходные.Свойство("Строки") Тогда
		Текст = СтрСоединить(ПараметрыВходные.Строки,"`n");
		ПоказатьОкошкоСТекстом(Текст);
	КонецЕсли;		
	Возврат Истина;
КонецФункции

Процедура ПоказатьОкошкоСТекстом(Текст) Экспорт
	
	
	Скрипт = "GuiControl, , Txt,% ""%Текст""
	|GuiControl,MoveDraw,Txt,W350,H600
	|Gui, Show, autosize x1 hide ; 
	|
	|DllCall(""AnimateWindow"", Ptr, hwnd, UInt, 1000, UInt, animateEffect) 
	|WinSet, Redraw";
	Текст = СтрЗаменить(Текст, Символы.ПС, "`n");
	Текст = СтрЗаменить(Текст, ";", "");
	Текст = СтрЗаменить(Текст, """", """""");
	
	Скрипт = СтрЗаменить(Скрипт, "%Текст", Текст);

	Попытка
		AHK.addScript(Скрипт,2);
	Исключение
	КонецПопытки;

	

КонецПроцедуры


Результат = Новый Структура("Ошибка,Описание,Подробно",Ложь,"","");
