Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон("Заказ %1 от %2 чек %3 ",
					УбратьВсеБуквы(Данные.Номер),
					Формат(Данные.Дата, "ДФ='дд.ММ.гг ЧЧ:мм:сс'"),
					Данные.НомерЧека);
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("НомерЧека");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
