
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заказ") Тогда
		УстановитьПараметрыОтбораСписка(Параметры.Заказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОтбораСписка(ДокументСсылка)
	ОтборыСписка = Список.Отбор.Элементы;
	ОтборыСписка.Очистить();
	
	НовыйОтбор = ОтборыСписка.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументСсылка");
	НовыйОтбор.Использование = Истина;
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйОтбор.ПравоеЗначение = ДокументСсылка;
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Лояльность.ОбработатьСпулЛояльности(ТекущаяСтрока.ДокументСсылка, ТекущаяСтрока.Протокол);
КонецПроцедуры
