
#Если Клиент Тогда

Перем КолвоКнопок Экспорт;
Перем ФормаРежимаАдминистратора;
Перем ДеревоМеню;
Перем МенюТекущегоУровня;
Перем НомерКнопкиТекущегоУровня;

// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при получении объекта обработки.
// Здесь надо прописать сброс реквизитов и переменных в начальные значения
Процедура УстановкаНачальныхЗначений() Экспорт
	
КонецПроцедуры

// Вызывается из обработчика ПередОткрытием форм этой обработки,
// выполняет инициализацию рабочего места
//
Процедура ДействияПередОткрытиемФормы(ТекущаяФорма, Отказ) Экспорт
	
	ДеревоМеню = Новый ДеревоЗначений;
	ДеревоМеню.Колонки.Добавить("Заголовок"	, Новый ОписаниеТипов("Строка") );
	ДеревоМеню.Колонки.Добавить("Действие"	, Новый ОписаниеТипов("Строка") );
	ДеревоМеню.Колонки.Добавить("Парам1"	, Новый ОписаниеТипов("Строка") );
	ДеревоМеню.Колонки.Добавить("Парам2"	, Новый ОписаниеТипов("Строка") );
	
	Таб=ПолучитьМакет("ДеревоМеню"+глВерсия+глПараметрыРМ.ИнтерфейсТип);
	
	ЗаполнитьДеревоМеню(ДеревоМеню.Строки, 1, Таб, 1);
	
	Если ДеревоМеню.Строки.Количество()=0 Тогда
		Текст1="Недостаточно прав!";
		Текст2="Нет прав на вход в режим Администратора...";
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2, "", "ОК", "");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	ФормаРежимаАдминистратора = ТекущаяФорма;
	
	МенюТекущегоУровня = ДеревоМеню.Строки;
	НомерКнопкиТекущегоУровня = 1;
	ВывестиМеню();
	
	ТекущаяФорма.Стиль = БиблиотекаСтилей[глПараметрыРМ.ИмяСтиля];
	
	ИнтерфейсРМ.ЗаписьСобытия(Справочники.События.РежимАдминаВход, глПользователь);
	
КонецПроцедуры

// Вызывается из обработчика ПередЗакрытием форм этой обработки,
//
Процедура ДействияПередЗакрытиемФормы(ТекущаяФорма, Отказ) Экспорт
	
	ИнтерфейсРМ.ЗаписьСобытия(Справочники.События.РежимАдминаВыход, глПользователь);
	
	ФормаРежимаАдминистратора = Неопределено; // иначе объект обработки остается в памяти и работают обработчики ожидания
	
КонецПроцедуры

Процедура ЗаполнитьДеревоМеню(СтрокиУровня, Уровень, Таб, НомСтр)
	Перем СтрокаДереваТО;
	
	Если Уровень > 1 Тогда
		СтрокаДерева = СтрокиУровня.Добавить();
		СтрокаДерева.Заголовок	= "...";
		СтрокаДерева.Действие	= "Возврат";
	КонецЕсли; 
	
	Пока НомСтр <= Таб.ВысотаТаблицы Цикл
		
		Если Уровень > 1 И ЗначениеЗаполнено(Таб.Область(НомСтр, Уровень - 1).Текст) Тогда
			Возврат;
		КонецЕсли;
		
		Заголовок	= Таб.Область(НомСтр, Уровень).Текст;
		Действие	= Таб.Область(НомСтр, Уровень+1).Текст;
		
		Если ПустаяСтрока(Заголовок) Тогда
			НомСтр = НомСтр + 1;
			Продолжить;
		КонецЕсли;
		
						
		Если Лев(Действие,1) = ">" Тогда
			Действие = Сред(Действие,2);
			ФлагПодменю = Истина;
		Иначе
			ФлагПодменю = Ложь;
		КонецЕсли; 
		
		Если Действие = "УправлениеКоммутатором" Тогда
			// надо проверить наличие коммутатора и 2 права
			ЕстьДоступККоммутатору = ЗначениеЗаполнено(глПараметрыРМ.СписокКЭП)
									И ( ИнтерфейсРМ.ПроверкаПраваДоступа(Действие+"Вкл") ИЛИ ИнтерфейсРМ.ПроверкаПраваДоступа(Действие+"Выкл") );
			ПропуститьСтроку = НЕ ЕстьДоступККоммутатору;
		Иначе
			Попытка
				// если есть такое право доступа, то мы его проверим
				ПравоДоступа = ПланыВидовХарактеристик.ПраваДоступа[Действие+Таб.Область(НомСтр, Уровень+2).Текст];
				ЕстьПравоДоступа = Истина;
			Исключение
				ЕстьПравоДоступа = Ложь;
			КонецПопытки;
			ПропуститьСтроку = ЕстьПравоДоступа И НЕ ИнтерфейсРМ.ПроверкаПраваДоступа(Действие+Таб.Область(НомСтр, Уровень+2).Текст);
		КонецЕсли; 
		
		Если Не глПараметрыРМ.ККМЕсть Тогда
			Если ПунктМенюОтноситсяКккм(Действие) Тогда
				ПропуститьСтроку = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ПропуститьСтроку Тогда
			НомСтр = НомСтр + 1;
			Продолжить;
		КонецЕсли; 
		
		Если Действие="ВнешняяОбработка" Тогда
			Если глПараметрыРМ.ВнешняяОбработка Тогда
				Заголовок = глПараметрыРМ.ВнешняяОбработкаНазвание;
			Иначе
				НомСтр = НомСтр + 1;
				Продолжить;
			КонецЕсли; 
		КонецЕсли; 
		
		СтрокаДерева = СтрокиУровня.Добавить();
		СтрокаДерева.Заголовок	= Заголовок;
		СтрокаДерева.Действие	= ?(ФлагПодменю, "Подменю", Действие);
		
		Если ФлагПодменю Тогда
			НомСтр = НомСтр + 1;
			ЗаполнитьДеревоМеню(СтрокаДерева.Строки, Уровень+1, Таб, НомСтр);
			// если подменю оказалось пустое, то его надо удалить
			Если СтрокаДерева.Строки.Количество()=1 Тогда
				СтрокиУровня.Удалить(СтрокаДерева);
			КонецЕсли; 
		Иначе
			СтрокаДерева.Парам1	= Таб.Область(НомСтр, Уровень+2).Текст;
			СтрокаДерева.Парам2	= Таб.Область(НомСтр, Уровень+3).Текст;
			НомСтр = НомСтр + 1;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПунктМенюОтноситсяКккм(НаименованиеПункта) Экспорт
	Возврат СтрНайти(НаименованиеПункта, "ККМ") + СтрНайти(НаименованиеПункта, "деньг");
КонецФункции

// Описание процедуры
//
// Параметры:
//	Параметр1	- описание параметра
//
Процедура ВывестиМеню()
	
	Если МенюТекущегоУровня.Количество() Тогда
		Если МенюТекущегоУровня[0].Действие = "Возврат" Тогда
			Хоткей = 0;
		Иначе
			Хоткей = 1;
		КонецЕсли;
	КонецЕсли;
	Для н=1 По МенюТекущегоУровня.Количество() Цикл
		
		Кнопка = ФормаРежимаАдминистратора.ЭлементыФормы["Кнопка"+н];
		Заголовок = МенюТекущегоУровня[н-1].Заголовок;
		Попытка
			фНетНомера = Ложь;
			Хоткей = Число(сред(Заголовок,2,1));
		Исключение
			Хоткей = 0;
			фНетНомера = Истина;
		КонецПопытки;
		Если МенюТекущегоУровня.Родитель <> Неопределено И фНетНомера = Ложь И н > 1 Тогда
			Заголовок = Сред(МенюТекущегоУровня.Родитель.Заголовок,1,3) + СокрЛ(Заголовок);
		КонецЕсли;
		Кнопка.Заголовок = Заголовок;
		
		Если Хоткей Тогда
			Кнопка.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша["_"+Хоткей]);
		Иначе
			Кнопка.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.BackSpace);
		КонецЕсли;
		
		Кнопка.Видимость = Истина;
	КонецЦикла; 
	
	Для н=МенюТекущегоУровня.Количество()+1 По КолвоКнопок Цикл
		Кнопка = ФормаРежимаАдминистратора.ЭлементыФормы["Кнопка"+н];
		Кнопка.Видимость = Ложь;
	КонецЦикла;
	
	ФормаРежимаАдминистратора.ТекущийЭлемент = ФормаРежимаАдминистратора.ЭлементыФормы["Кнопка"+НомерКнопкиТекущегоУровня];
	
КонецПроцедуры

// Описание процедуры
//
Процедура ОбработкаНажатияКнопки(НомерКнопки) Экспорт
	
	ВыбМеню = МенюТекущегоУровня[НомерКнопки-1];
	
	Если ВыбМеню.Действие = "Подменю" Тогда
		МенюТекущегоУровня = ВыбМеню.Строки;
		НомерКнопкиТекущегоУровня = 1;
		ВывестиМеню();
	ИначеЕсли ВыбМеню.Действие = "Возврат" Тогда
		СтрокаРодитель = МенюТекущегоУровня.Родитель;
		МенюТекущегоУровня = ?(СтрокаРодитель.Родитель=Неопределено, ДеревоМеню.Строки, СтрокаРодитель.Родитель.Строки);
		НомерКнопкиТекущегоУровня = МенюТекущегоУровня.Индекс(СтрокаРодитель) + 1;
		ВывестиМеню();
	ИначеЕсли ВыбМеню.Действие = "ОформитьВозврат" Тогда
		ФормаРежимаАдминистратора.Закрыть("Возврат");

		
	ИначеЕсли ВыбМеню.Действие = "ОтчетККМ" Тогда
		ИнтерфейсРМ.ОтчетККМ( ВыбМеню.Парам1 );
		
	ИначеЕсли ВыбМеню.Действие = "ОтчетПС" Тогда
		
	ИначеЕсли ВыбМеню.Действие = "Отчет" Тогда
		ФормированиеОтчетов.ПолучитьОтчетРМ( ВыбМеню.Парам1, ВыбМеню.Парам2 );
		
	ИначеЕсли ВыбМеню.Действие = "ВводНачислений" Тогда
		Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ВводНачислений");
		Обработка.ЗнакОперации = Число( ВыбМеню.Парам1 );
		Обработка.ПолучитьФорму().ОткрытьМодально();;
		
	ИначеЕсли ВыбМеню.Действие = "ВводКлиента" ИЛИ 
		ВыбМеню.Действие = "КарточкаКлиента" Тогда
		Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ВводКлиента");
		Обработка.ВводНового = (ВыбМеню.Действие="ВводКлиента");
		Обработка.ПолучитьФорму().ОткрытьМодально();;
		
	ИначеЕсли ВыбМеню.Действие = "БлокироватьКарту" Тогда
		
		
	ИначеЕсли ВыбМеню.Действие = "ОткрытиеСмены" Тогда
		ФормаРежимаАдминистратора.Закрыть();
		Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ОткрытиеЗакрытиеСмены");
		Обработка.ПолучитьФорму("Открытие"+глПараметрыРМ.ИнтерфейсТип).ОткрытьМодально();;
		
	ИначеЕсли ВыбМеню.Действие = "ЗакрытиеСмены" Тогда
		ФормаРежимаАдминистратора.Закрыть();
		Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ОткрытиеЗакрытиеСмены");
		Обработка.ПолучитьФорму("Закрытие").ОткрытьМодально();;
	ИначеЕсли ВыбМеню.Действие = "ОтменаЗакрытияСмены" Тогда			
		ФормаРежимаАдминистратора.Закрыть();
		Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ОткрытиеЗакрытиеСмены");
		Обработка.ПолучитьФорму("ОтменаЗакрытия").ОткрытьМодально();;
	ИначеЕсли ВыбМеню.Действие = "ЖурналЗакрытых" ИЛИ 
		ВыбМеню.Действие = "ЖурналНедоЗакрытых" Тогда
		
		Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ЖурналЗаказов");
		Обработка.РежимЗакрытых = Истина;
		Обработка.РежимНедоЗакрытых = ВыбМеню.Действие="ЖурналНедоЗакрытых";
		Обработка.ПолучитьФорму("Форма" + глПараметрыРМ.ИнтерфейсТип).ОткрытьМодально();;
		
	ИначеЕсли ВыбМеню.Действие = "ВыходОС" Тогда
		//ГлавнаяФорма = глСтекОкон[0];
		//ГлавнаяФорма.ВыходОС = Истина;
		ФормаРежимаАдминистратора.Закрыть("ВыходОС");
		
		//ГлавнаяФорма = глСтекОкон[глСтекОкон.Количество()-1].Форма;
		
		//ГлавнаяФорма.Закрыть();
		
	ИначеЕсли ВыбМеню.Действие = "ОбновлениеТоваров" Тогда
		ФормаРежимаАдминистратора.Закрыть();
		Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ОбновлениеТоваров");
		Обработка.ПолучитьФорму().ОткрытьМодально();
		
	ИначеЕсли ВыбМеню.Действие = "УходСРаботы" Тогда
		Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("РегистрацияКассиров");
		Обработка.Сотрудник = глПользователь;
		Обработка.ТипФормы = "Уход";
		Рез = Обработка.ПолучитьФорму("РегистрацияКассиров" + глПараметрыРМ.ИнтерфейсТип).ОткрытьМодально();
		Если ЗначениеЗаполнено(Рез) и Рез = истина Тогда ;
			ИнтерфейсРМ.ВопросПредупреждение("Регистрация", "Окончание рабочей смены", "Ваш уход с работы зарегистрирован","","ОК","");
			ФормаРежимаАдминистратора.Закрыть("Заблокировать");
			//глПользователь = Справочники.Сотрудники.ПустаяСсылка();
			//глСтекОкон[глСтекОкон.Количество()-1].Форма.ЭтотОбъект.Заблокировать();
		Иначе
			ФормаРежимаАдминистратора.Закрыть();
		КонецЕсли;
		
		глПользователь = "";
		глАвтоблокировка();
		
	ИначеЕсли ВыбМеню.Действие = "ОперацииСденьгами" Тогда
		Если ВыбМеню.Парам1 = "Внесение" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ДенежныеОперации");
			Обработка.ПолучитьФорму("Внесение" + глПараметрыРМ.ИнтерфейсТип).ОткрытьМодально();
		ИначеЕсли ВыбМеню.Парам1 = "Изъятие" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ДенежныеОперации");
			Обработка.ПолучитьФорму("Выплата" + глПараметрыРМ.ИнтерфейсТип).ОткрытьМодально();
		КонецЕсли;
	ИначеЕсли ВыбМеню.Действие = "ОперацииККМ" Тогда
		Если ВыбМеню.Парам1 = "ОткрытиеСмены" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = Обработки.ОткрытиЗакрытиеСменыКасса.Создать();//ИнтерфейсРМ.ПолучитьОбъектОбработки("ОткрытиЗакрытиеСменыКасса");
			Обработка.ОткрытьСмену();
		ИначеЕсли ВыбМеню.Парам1 = "ЗакрытиеСмены" Тогда
			Обработка = Обработки.ОткрытиЗакрытиеСменыКасса.Создать();//ИнтерфейсРМ.ПолучитьОбъектОбработки("ОткрытиЗакрытиеСменыКасса");
			Обработка.ЗакрытьСмену();
			ФормаРежимаАдминистратора.Закрыть("Заблокировать");
		ИначеЕсли ВыбМеню.Парам1 = "ОтчетБезГашения" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = Обработки.ОткрытиЗакрытиеСменыКасса.Создать();//ИнтерфейсРМ.ПолучитьОбъектОбработки("ОткрытиЗакрытиеСменыКасса");
			Обработка.ОтчетБезГашения();
		ИначеЕсли ВыбМеню.Парам1 = "ЗакрытиеДняСбербанк" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = Обработки.ОтчетыККМ.Создать();//ИнтерфейсРМ.ПолучитьОбъектОбработки("ОтчетыККМ");
			Обработка.ЗакрытиеДняСбербанк();
		ИначеЕсли ВыбМеню.Парам1 = "Внесение" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ДенежныеОперации");
			Обработка.ПолучитьФорму("Внесение" + глПараметрыРМ.ИнтерфейсТип).ОткрытьМодально();
		ИначеЕсли ВыбМеню.Парам1 = "Изъятие" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ДенежныеОперации");
			Обработка.ПолучитьФорму("Выплата" + глПараметрыРМ.ИнтерфейсТип).ОткрытьМодально();
		КонецЕсли;

	ИначеЕсли ВыбМеню.Действие = "СлужебныеОперации" Тогда
		Если ВыбМеню.Парам1 = "ЗапуститьСУПтт" Тогда
			ЗапуститьПриложение(СтрШаблон("\\%1-serv\1c\BIN\1cv7s.exe enterprise /D\\%1-serv\loyality\ /nuser", формат(ПараметрыСеанса.ТекущаяИБ.ПолучитьОбъект().НомерТТ(),"ЧГ=0")));
			КомандаСистемы("taskkill /im 1cv8.exe /f");
		ИначеЕсли ВыбМеню.Парам1 = "ОткрытиеСмены" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ОткрытиеЗакрытиеСмены");
			Обработка.ПолучитьФорму("Открытие"+глПараметрыРМ.ИнтерфейсТип).ОткрытьМодально();;
		КонецЕсли;
		
	ИначеЕсли ВыбМеню.Действие = "ОтчетыККМ" Тогда
		Если ВыбМеню.Парам1 = "КассовыйКраткий" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = Обработки.ОтчетыККМ.Создать();//ИнтерфейсРМ.ПолучитьОбъектОбработки("ОтчетыККМ");
			Обработка.КассовыйОтчетКраткий();
		ИначеЕсли ВыбМеню.Парам1 = "КассовыйПодробный" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = Обработки.ОтчетыККМ.Создать();//ИнтерфейсРМ.ПолучитьОбъектОбработки("ОтчетыККМ");
			Обработка.КассовыйОтчетПодробный();
		ИначеЕсли ВыбМеню.Парам1 = "Кассовый" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = Обработки.ОтчетыККМ.Создать();//ИнтерфейсРМ.ПолучитьОбъектОбработки("ОтчетыККМ");
			Обработка.КассовыйОтчет();
		ИначеЕсли ВыбМеню.Парам1 = "НаличиеДенег" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = Обработки.ОтчетыККМ.Создать();//ИнтерфейсРМ.ПолучитьОбъектОбработки("ОтчетыККМ");
			Обработка.НаличиеВКассе();
		ИначеЕсли ВыбМеню.Парам1 = "ОтчетСбербанк" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = Обработки.ОтчетыККМ.Создать();//ИнтерфейсРМ.ПолучитьОбъектОбработки("ОтчетыККМ");
			Обработка.ОтчетСбербанк();
			
		ИначеЕсли ВыбМеню.Парам1 = "ПечатьКопииЧекаЛояльности" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ПечатьКопииЧека");
			Заказ = Обработка.ПолучитьФорму("Форма" + глПараметрыРМ.ИнтерфейсТип).ОткрытьМодально();
			Если ЗначениеЗаполнено(Заказ) Тогда
				ИнтерфейсРМ.ПечатьКопииЧекаЛояльности(Заказ);
			КонецЕсли;
			
		ИначеЕсли ВыбМеню.Парам1 = "Сторно" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			ИнтерфейсРМ.ОтчетСторно();
			
		ИначеЕсли ВыбМеню.Парам1 = "ЗакрытиеДняСбербанк" Тогда
			ФормаРежимаАдминистратора.Закрыть();
			Обработка = Обработки.ОтчетыККМ.Создать();//ИнтерфейсРМ.ПолучитьОбъектОбработки("ОтчетыККМ");
			Обработка.ЗакрытиеДняСбербанк();
		
		КонецЕсли;
		//WshShell.AppActivate(?(ТекущийЯзыкСистемы()="en","1C:Enterprise", "1С:Предприятие") + " - " + ПолучитьЗаголовокСистемы() );	
	Иначе
		ИнтерфейсРМ.БетаВерсия();
		
	КонецЕсли;
	
	глОтсечкаПростоя();
	
КонецПроцедуры

#КонецЕсли
