
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "НетВозможностиОплатить,ОплатаМР1,ОплатаМР2");
	
	ЕстьДвойнаяОплата = НЕ ПустаяСтрока(ОплатаМР1) И НЕ ПустаяСтрока(ОплатаМР2);
	ЕстьМР_БезОплаты = НЕ ПустаяСтрока(НетВозможностиОплатить);
	
	Элементы.ГруппаНадписей1.Видимость = ЕстьМР_БезОплаты;
	Элементы.ГруппаНадписей2.Видимость = ЕстьДвойнаяОплата;
	
	Отказ = НЕ ЕстьМР_БезОплаты И НЕ ЕстьДвойнаяОплата;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(1);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
