

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Не ЭтоГруппа Тогда
		Если БазоваяЕдиницаИзмерения.Пустая() Тогда
			Если Справочники.ГруппыИнформационныхБаз.ГруппыПоИБ(ПараметрыСеанса.ТекущаяИБ).Найти(Справочники.ГруппыИнформационныхБаз.Рестораны) <> Неопределено Тогда
				БазоваяЕдиницаИзмерения = ОбщегоНазначенияПовтИсп.НайтиПоРеквизиту("Справочник.КлассификаторЕдиницИзмерения","Наименование", "порц.");
			КонецЕсли;
		КонецЕсли;
		
		Состав = СокрЛП(Состав);
		НаименованиеПолное = СокрЛП(НаименованиеПолное);
		
		
	КонецЕсли;
	
	Наименование = СокрЛП(Наименование);
	
КонецПроцедуры
 	 