
//
//
Процедура ПриОткрытии()
	
	//ЭлементыФормы.ИБДляОчистки.Доступность		= глВерсия > 1 И ПараметрыСеанса.РаспределенныйРежим И ПланыОбмена.ГлавныйУзел() = Неопределено;
	//ЭлементыФормы.ИБДляОчистки.ВыделенныйТекст	= ?(ЭлементыФормы.ИБДляОчистки.Доступность, "", "Текущую базу");
	
КонецПроцедуры

//
//
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если НЕ ЗначениеЗаполнено(ДатаОчистки) Тогда
		Предупреждение("Не указана дата и время до которго нужно оичистить информационную базу.", 7, "ОШИБКА!");
		Возврат;
	КонецЕсли;	
	
	Текст = "Очистить информационную базу до " + ЭлементыФормы.ДатаОчисткиИБ.Значение;

	Если Вопрос(Текст, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
        КомандаОчиститьИБ();
	КонецЕсли;
	
КонецПроцедуры

//
//
Процедура ОсновныеДействияФормыОтменитьОчистку(Кнопка)
	
	Если НЕ ПараметрыСеанса.РаспределенныйРежим Тогда
		Предупреждение("Отменить команду на очистку базы можно только в распределенной системе", 7, "ОШИБКА!");
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ЭлементыФормы.ИБДляОчистки.Значение) Тогда
		Предупреждение("Не указана информационная база для отмены команды на очистку.", 7, "ОШИБКА!");
		Возврат;
	КонецЕсли;	
	
	Текст = "Отменить очистку информациооной базы";

	Если Вопрос(Текст, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
        КомандаОтменитьОчисткуИБ();
	КонецЕсли;

КонецПроцедуры



