Перем ТекущаяНастройка Экспорт;
Перем ПараметрыНастройки Экспорт;
Перем РежимНастройки Экспорт;
Перем ГруппаПечати Экспорт;
Перем МестоПроизводстваСписок Экспорт;
Перем ФормаМонитора Экспорт;
                               
// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
КонецПроцедуры

Функция 
 ПолучитьФормуМОКП() Экспорт
	Если ФормаМонитора = Неопределено Тогда
		ФормаМонитора = ПолучитьФорму("ФормаМОКП");
		Возврат ФормаМонитора;
	Иначе
		Возврат ФормаМонитора;
	КонецЕсли;
КонецФункции

//Документы.Акция.ОбновитьЦветаАкций(глЦветаАкционныхТоваров);
