// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Заголовок = "Запись справочника: " + Ссылка;
	
	Если НЕ ЗначениеЗаполнено(ВидИспользованияРабочегоВремени) Тогда
		СообщитьОбОшибке("Необходимо заполнить вид использования времени.", Отказ, Заголовок);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НеоплачиваемоеВремя > Длительность Тогда
		СообщитьОбОшибке("Неоплативаемое время не должно превышать длительность смены.", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры
