

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере()
	ДополнительныеСвойства.Параметры.УстановитьЗначениеПараметра("Объект", Объект.Ссылка);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос("выбрать * из регистрСведений.ДополнительныеСвойства где объект = &Объект и свойство=""email_ОТК""");
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		МЗ = РегистрыСведений.ДополнительныеСвойства.СоздатьМенеджерЗаписи();
		МЗ.Объект = Объект.Ссылка;
		МЗ.Свойство = "email_ОТК";
		МЗ.Записать();
	КонецЕсли;
	ДополнительныеСвойства.Параметры.УстановитьЗначениеПараметра("Объект", Объект.Ссылка);
	//ДополнительныеСвойства.Отбор.
КонецПроцедуры
