
#Если Клиент Тогда

Перем КолвоКнопок Экспорт;
Перем ВсегоСтраниц Экспорт;
Перем ТекСтраница Экспорт;

// Описание процедуры
//
Процедура ВывестиТекущуюСтраницу(Форма) Экспорт
	
	ИндексЗначенияПервойКнопки = (ТекСтраница-1) * КолвоКнопок;
	
	Для НомерКнопки=1 По КолвоКнопок Цикл
		
		Кнопка = Форма.ЭлементыФормы["Кнопка"+НомерКнопки];
		
		ТекИндекс = ИндексЗначенияПервойКнопки + НомерКнопки-1;
		Если ТекИндекс <= Шаблоны.Количество()-1 Тогда
			Кнопка.Видимость = Истина;
			Кнопка.Заголовок = Шаблоны[ТекИндекс].Текст;
		Иначе
			Кнопка.Видимость = Ложь;
		КонецЕсли; 
		
	КонецЦикла;
	
	// выводим счетчик страниц
	Форма.ЭлементыФормы.ТекстКолвоСтраниц.Заголовок = ?(ВсегоСтраниц>1, Строка(ТекСтраница)+"/"+Строка(ВсегоСтраниц), "");
	// показываем только доступные направления листания
	Форма.ЭлементыФормы.КнопкаСтрелкаВверх.Видимость = ТекСтраница > 1;
	Форма.ЭлементыФормы.КнопкаСтрелкаВниз .Видимость = ТекСтраница < ВсегоСтраниц;
	
КонецПроцедуры
 
// Описание процедуры
//
Процедура ЗаполнитьШаблоны() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.ШаблоныСообщений.Текст ГДЕ НЕ ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Шаблоны.Добавить().Текст = Выборка.Текст;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
