
Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ОформлениеСтроки.Ячейки.Списание.ОтображатьТекст = Истина;
	
	Если ДанныеСтроки.Тип = Перечисления.ТипыПричинУдалений.Удаление Тогда
		ОформлениеСтроки.Ячейки.Списание.Текст = ?(ДанныеСтроки.Списание, "со списанием", "");
	Иначе
		ОформлениеСтроки.Ячейки.Списание.Текст = ?(ДанныеСтроки.Списание, "с возвратом количества", "");
	КонецЕсли; 
	
	//ОформлениеСтроки.Ячейки.ВводКомментария.ОтображатьТекст = Истина;
	//ОформлениеСтроки.Ячейки.ВводКомментария.Текст = ?(ДанныеСтроки.ВводКомментария, "нужен", "");
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
КонецПроцедуры
