
// Обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Не заполнено наименование!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Тип) Тогда
		Сообщить("Не выбран тип оплаты!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если Тип<>Перечисления.ТипыОплаты.Нал И НомерВККМ=1 Тогда
		Сообщить("В ККМ номер 1 зарезервирован для наличных расчетов!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если НомерВККМ>4 Тогда
		Сообщить("Максимальный номер варианта оплаты в ККМ - 4",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если ПараметрыСеанса.Версия>1 И Тип = Перечисления.ТипыОплаты.Сертификат И ЭтотОбъект.НоминалСертификата = 0 Тогда
		Сообщить("Укажите номинал сертификата!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипОграниченияКатегорий) Тогда 
		ТипОграниченияКатегорий = Перечисления.ТипыОграниченийПоСписку.Нет;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УровеньДоступа) Тогда 
		УровеньДоступа = Перечисления.УровниДоступа.Свободный;
	КонецЕсли;
	
КонецПроцедуры
