#Если Клиент Тогда

#Область ОписаниеПеременных
Перем МассивДействий Экспорт;
#КонецОбласти
	
#Область ПрограммныйИнтерфейс

Функция ВыбратьРецептГостя() Экспорт 
	
	ФормаВыбора = ЭтотОбъект.ПолучитьФорму("ВыборРецептаГостя");
	Возврат ФормаВыбора.ОткрытьМодально();
	
КонецФункции

Функция ВыбратьВыполнитьДействие() Экспорт 
	
	Результат = ПолучитьСтруктуруРезультата();
	ВыбранноеДействие = ИнтерфейсРМ.ВыборИзСписка(МассивДействий);
	
	Если ВыбранноеДействие = "ВыбратьРецептГостя" Тогда
		
		Результат.Вставить(ВыбранноеДействие, ВыбратьРецептГостя());
	ИначеЕсли ВыбранноеДействие = "РедактироватьРецептГостя" Тогда
		
		Результат.Вставить(ВыбранноеДействие, Неопределено);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановкаНачальныхЗначений() Экспорт 
	ИнициализацияРеквизитов();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализацияРеквизитов()
	
	МассивДействий = Новый Массив;
	МассивДействий.Добавить("ВыбратьРецептГостя");
	МассивДействий.Добавить("РедактироватьРецептГостя");
	
КонецПроцедуры

//
Функция ПолучитьСтруктуруРезультата()
	
	Возврат Новый Структура(СтрСоединить(МассивДействий, ","));
	
КонецФункции

#КонецОбласти


#КонецЕсли