#Если Клиент Тогда

#Область ОписаниеПеременных
Перем МассивДействий Экспорт;
#КонецОбласти
	
#Область ПрограммныйИнтерфейс

Функция ВыбратьРецептГостя() Экспорт 
	
	ФормаВыбора = ЭтотОбъект.ПолучитьФорму("ВыборРецептаГостя");
	Возврат ФормаВыбора.ОткрытьМодально();
	
КонецФункции

Функция ВыбратьВыполнитьДействие() Экспорт 
	
	Результат = ПолучитьСтруктуруРезультата();
	ВыбранноеДействие = ИнтерфейсРМ.ВыборИзСписка(МассивДействий);
	
	Если ВыбранноеДействие = "ВыбратьРецептГостя" Тогда
		
		Результат.Вставить(ВыбранноеДействие, ВыбратьРецептГостя());
	ИначеЕсли ВыбранноеДействие = "РедактироватьРецептГостя" Тогда
		
		Результат.Вставить(ВыбранноеДействие, Неопределено);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановкаНачальныхЗначений() Экспорт 
	ИнициализацияРеквизитов();	
КонецПроцедуры

Процедура ОбновитьТовары() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТТ", ТТ);
	Запрос.УстановитьПараметр("НомерКартыЛояльности", НомерКартыЛояльности);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РецептГостяТовары.Ссылка.Блюдо КАК Блюдо,
	|	РецептГостяТовары.Ссылка КАК Рецепт,
	|	РецептГостяТовары.Специфика КАК Специфика,
	|	РецептГостяТовары.СпецификаНоменклатура КАК СпецификаНоменклатура,
	|	РецептГостяТовары.Количество КАК Количество
	|ИЗ
	|	Документ.РецептГостя.Товары КАК РецептГостяТовары
	|ГДЕ
	|	РецептГостяТовары.Ссылка.НомерКартыЛояльности = &НомерКартыЛояльности
	|	И РецептГостяТовары.Ссылка.ТТ = &ТТ";
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализацияРеквизитов()
	
	МассивДействий = Новый Массив;
	МассивДействий.Добавить("ВыбратьРецептГостя");
	МассивДействий.Добавить("РедактироватьРецептГостя");
	
КонецПроцедуры

//
Функция ПолучитьСтруктуруРезультата()
	
	Возврат Новый Структура(СтрСоединить(МассивДействий, ","));
	
КонецФункции

#КонецОбласти


#КонецЕсли