
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//СписокЭлементы.Параметры.УстановитьЗначениеПараметра("Шаблон", Объект.Ссылка);
	СписокЭлементы.Отбор.Элементы[0].ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//	СписокЭлементы.Параметры.УстановитьЗначениеПараметра("Шаблон", ТекущийОбъект.Ссылка);
КонецПроцедуры
