
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		МассивЗадач = ПараметрКоманды;
	Иначе
		МассивЗадач = Массив(ПараметрКоманды);
	КонецЕсли;
	
	Для Каждого Задача Из МассивЗадач Цикл
		//:Задача = Справочники.Задачи.СоздатьЭлемент();
		обЗадача = Задача.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Задача.ИдентификаторРегламентногоЗадания) Тогда
			Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Задача.ИдентификаторРегламентногоЗадания));
		Иначе
			Задание = Неопределено;
		КонецЕсли;
		
		Если Не Задание = Неопределено Тогда
			Задание.Удалить();				
		КонецЕсли;
		обЗадача.ИдентификаторРегламентногоЗадания = "";
		обЗадача.Записать();
	КонецЦикла;
КонецПроцедуры

