// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
	НомерКартыДоступа = "";	
		
КонецПроцедуры

#Если ТолстыйКлиентОбычноеПриложение Тогда
Процедура ДействияПриОткрытии() Экспорт
	ИнтерфейсРМ.ВыводНаИнфоДисплей("Приглашение", Неопределено, Неопределено, Неопределено, Неопределено);
КонецПроцедуры

Процедура ДействияПриЗакрытии() Экспорт
	ИнтерфейсРМ.ВыводНаИнфоДисплей("Реклама", Неопределено, Неопределено, Неопределено, Неопределено);
КонецПроцедуры

#КонецЕсли