// Возвращает массив узлов плана обмена по группе ИБ
//
// Параметры:
//	ГруппаИБ  	 - СправочникСсылка.ГруппыИнформационныхБаз - группа ИБ
//
// Возвращаемое значение:
//   Массив   - узлы
//
Функция УзлыПоГруппе(ГруппаИБ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СоставГруппИнформационныхБаз.ИнформационнаяБаза КАК ИнформационнаяБаза
	|ПОМЕСТИТЬ ИнформационныеБазы
	|ИЗ
	|	РегистрСведений.СоставГруппИнформационныхБаз КАК СоставГруппИнформационныхБаз
	|ГДЕ
	|	СоставГруппИнформационныхБаз.Группа = &Группа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основной.Ссылка КАК Узел
	|ИЗ
	|	ИнформационныеБазы КАК ИнформационныеБазы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.Основной КАК Основной
	|		ПО ИнформационныеБазы.ИнформационнаяБаза = Основной.ИнформационнаяБаза");
	Запрос.УстановитьПараметр("Группа", ГруппаИБ);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Узел");
КонецФункции

Функция ИБпоГруппе(ГруппаИБ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СоставГруппИнформационныхБаз.ИнформационнаяБаза КАК ИнформационнаяБаза
	|ИЗ
	|	РегистрСведений.СоставГруппИнформационныхБаз КАК СоставГруппИнформационныхБаз
	|ГДЕ
	|	СоставГруппИнформационныхБаз.Группа = &Группа");
	Запрос.УстановитьПараметр("Группа", ГруппаИБ);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция ГруппыПоИБ(ИБ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СоставГруппИнформационныхБаз.Группа КАК Группа
	|ИЗ
	|	РегистрСведений.СоставГруппИнформационныхБаз КАК СоставГруппИнформационныхБаз
	|ГДЕ
	|	СоставГруппИнформационныхБаз.ИнформационнаяБаза = &ИБ");
	Запрос.УстановитьПараметр("ИБ", ИБ);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции