
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ПоискПоНомеруНажатие(Элемент)
	
	СтрокаПоиска = ВводСтроки("Поиск по номеру заказа");
	
	Если СтрокаПоиска=Неопределено Тогда
		Возврат;
	КонецЕсли;

	Закрыть(СтрокаПоиска);
КонецПроцедуры

Процедура ПоискПоКлиентуНажатие(Элемент)
	
	ВыбКлиент = ИнтерфейсРМ.ИдентификацияКлиента();
	
	Если ВыбКлиент=Неопределено Тогда
		Возврат;
		
	ИначеЕсли ВыбКлиент.Пустая() Тогда
		Текст1="Убрать клиента?";
		Текст2="Вы уверены, что хотите отключить отбор по клиенту?";
		Если ИнтерфейсРМ.ВопросПредупреждение("Вопрос",Текст1,Текст2,"Да","","Esc=Нет") = "Нет" Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//СводныйЖурнал = Ложь;
	//СоздатьСтруктуруЖурнала();
	//ОбновитьЖурнал(,ВыбКлиент);
	Закрыть(ВыбКлиент);
	
КонецПроцедуры

Процедура ПоискПоКурьеруНажатие(Элемент)
	МассивСотрудников = Новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Сотрудники
	|ГДЕ НЕ ЭтоГруппа И НЕ ПометкаУдаления И Курьер
	|УПОРЯДОЧИТЬ ПО Наименование");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСотрудников.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	ВыбАвтор = ИнтерфейсРМ.ВыборИзСписка(МассивСотрудников);
	//СводныйЖурнал = Ложь;
	//СоздатьСтруктуруЖурнала();
	//ОбновитьЖурнал(,ВыбАвтор);
	Закрыть(ВыбАвтор);
	
КонецПроцедуры

Процедура ПоискПоАдресуНажатие(Элемент)
	
	СтрокаПоиска = ВводСтроки("Поиск по адресу");
	
	Если СтрокаПоиска=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//СводныйЖурнал = Ложь;
	//СоздатьСтруктуруЖурнала();
	//ОбновитьЖурнал(,,СтрокаПоиска);
	Закрыть(СтрокаПоиска);
	
КонецПроцедуры

Процедура ПоискПоТелефонуНажатие(Элемент)
						
	СтрокаПоиска = ВводСтроки("Поиск по Телефону");
	
	Если СтрокаПоиска=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//СводныйЖурнал = Ложь;
	//СоздатьСтруктуруЖурнала();
	//ОбновитьЖурнал(,,СтрокаПоиска);
	Закрыть(СтрокаПоиска);
	
КонецПроцедуры

Процедура ПоискПоСтатусуНажатие(Элемент)
	
	МассивСтатусов = Новый Массив;
	//
	//МассивСтатусовЗакрытыхЗаказов = Новый Массив;
	//МассивСтатусовЗакрытыхЗаказов.Добавить(Перечисления.СтатусыДоставки.Доставлен);
	//МассивСтатусовЗакрытыхЗаказов.Добавить(Перечисления.СтатусыДоставки.Отказ);
	
	Для каждого Статус Из Перечисления.СтатусыДоставки Цикл
		//Если РежимЗакрытых И МассивСтатусовЗакрытыхЗаказов.Найти(Статус) = Неопределено Тогда
		//	Продолжить;
		//ИначеЕсли НЕ РежимЗакрытых И МассивСтатусовЗакрытыхЗаказов.Найти(Статус) <> Неопределено Тогда
		//	Продолжить;
		//КонецЕсли;
		МассивСтатусов.Добавить(Статус);
	КонецЦикла;
	
	ВыбСтатус = ИнтерфейсРМ.ВыборИзСписка(МассивСтатусов);
	//СводныйЖурнал = Ложь;
	//СоздатьСтруктуруЖурнала();
	//ОбновитьЖурнал(,ВыбСтатус);
	Закрыть(ВыбСтатус);
	
КонецПроцедуры

Процедура ОтключитьОтборНажатие(Элемент)
	
	ВыбЗначение = Неопределено;
	//ОбновитьЖурнал(,ВыбЗначение);
	Закрыть(ВыбЗначение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

