
// Проверка заполнения наименования и профиля входа
//
Функция ПроверкаОсновныхРеквизитов() Экспорт
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Не заполнено наименование!",СтатусСообщения.Важное);
		Результат = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПрофильВхода) Тогда
		Сообщить("Не указан профиль входа!",СтатусСообщения.Важное);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	ИначеЕсли ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если не ЭтоГруппа Тогда
		Отказ = НЕ ПроверкаОсновныхРеквизитов();
	КонецЕсли;
	
КонецПроцедуры
