Перем мСтруктураПараметров Экспорт;

// Проверка заполнения наименования и профиля входа
//
Функция ПроверкаОсновныхРеквизитов() Экспорт
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Не заполнено наименование!",СтатусСообщения.Важное);
		Результат = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПрофильВхода) Тогда
		Сообщить("Не указан профиль входа!",СтатусСообщения.Важное);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СтруктураПараметров() Экспорт
	Если ЗначениеЗаполнено(ПараметрыРМ) Тогда
		мСтруктураПараметров = ЗначениеИзСтрокиВнутр(ПараметрыРМ)	
	КонецЕсли;
	
	Возврат мСтруктураПараметров;
КонецФункции


// Обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	ИначеЕсли ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если не ЭтоГруппа Тогда
		Отказ = НЕ ПроверкаОсновныхРеквизитов();
	КонецЕсли;
	
	
	мСтруктураПараметров = СтруктураПараметров();
	ККМ=ККМ;
	Если ЗначениеЗаполнено(мСтруктураПараметров) Тогда
		Если мСтруктураПараметров.Свойство("ККМ", ККМ) Тогда
			Попытка
				НомерККМ = ККМ.КодСУП;	
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ОсновнаяККМ() Экспорт
	Если мСтруктураПараметров = Неопределено Тогда
		мСтруктураПараметров = СтруктураПараметров();
	КонецЕсли;	
	Возврат мСтруктураПараметров.ККМ;
КонецФункции

