Перем фЗакрыть;
Процедура Мигнуть() Экспорт
	глОтсечкаПростоя();
КонецПроцедуры

Процедура ПриОткрытии()
	ПодключитьОбработчикОжидания("Мигнуть",3);
	Заголовок = "ПДФ";
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	Стиль = БиблиотекаСтилей.СтанцияОплаты;
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	глОтсечкаПростоя();
	Если глСтекОкон[0].Форма <> ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	
	ПДФ = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник,Событие,Данные);
	Если Не ЗначениеЗаполнено(ПДФ) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = Алкоголь.ПроверитьПДФ(ПДФ, ПДФЧека, Товар, ЭтоВозврат, глОбработки.ГлавнаяФорма.ТекущийДокумент.Ссылка);
	Если РезультатПроверки.Успех Тогда
		фЗакрыть = Истина;
		Закрыть(РезультатПроверки.ПДФ);
	Иначе
		ЗарегистрироватьСобытие("Excise.Повтор ПДФ", УровеньЖурналаРегистрации.Ошибка,,,ПДФ + Символы.ПС + РезультатПроверки.ОшибкаТекст);
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",РезультатПроверки.ОшибкаЗаголовок,РезультатПроверки.ОшибкаТекст,"","ОК","",,0);
		фЗакрыть = Истина;
		Закрыть("");
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если фЗакрыть = Ложь Тогда
		фЗакрыть = Истина;
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
	глОтсечкаПростоя();
	фЗакрыть = Истина;
	ПДФ = "";
	Закрыть(ПДФ);
КонецПроцедуры


ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
