
// Обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Не заполнено наименование!",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ВремяЦены) Тогда
		Сообщить("Укажите базовую единицу времени",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Дискретность) Тогда
		Сообщить("Укажите дискретность тарификации",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ПравилоОкругления) Тогда
		Сообщить("Укажите правило округления!",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли ПравилоОкругления.Кратность <> 1 Тогда
		Сообщить("Правило округления для учета времени должно иметь кратность равную единице!",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Валюта) Тогда
		Сообщить("Укажите валюту тарифа",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Цена) И ВариантРасчета = 2 Тогда
		Сообщить("Укажите фиксированный тариф",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(МинВремя) Тогда
		Сообщить("Укажите минимальное время заказа!",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли МинВремя.Код < Дискретность.Код Тогда
		Сообщить("Минимальное время не может быть меньше дискретности!",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли ВариантРасчета < 2 И ТарифнаяСетка.Количество() = 0 Тогда
		Сообщить("Необходимо заполнить тарифную сетку",СтатусСообщения.Важное);
		Отказ = Истина;
		
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

