
// Форма открывается для подбора.
Перем ФормаОткрытаДляВыбора Экспорт;
Перем ИспользоватьПереданныеНастройки Экспорт;

Процедура НадписьТекущийКаталогНажатие(Элемент)
	СписокКаталогов = Новый СписокЗначений;
	
	Выборка = Справочники.КаталогиТоваров.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ПометкаУдаления Тогда
			СписокКаталогов.Добавить(Выборка.Ссылка);
		КонецЕсли; 
	КонецЦикла; 
	
	ВыбЭлемент = ВыбратьИзМеню(СписокКаталогов);
	Если ВыбЭлемент <> Неопределено Тогда
		Отбор.Владелец.Установить(ВыбЭлемент.Значение);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ПорядокСортировкиСписок = ВосстановитьЗначение("ТекущаяСортировкаСписок");
	ПорядокСортировкиДерево = ВосстановитьЗначение("ТекущаяСортировкаДерево");
	Если ПорядокСортировкиСписок <> Неопределено Тогда
		СправочникСписок.Порядок.Установить(ПорядокСортировкиСписок);
	КонецЕсли;
	Если ПорядокСортировкиДерево <> Неопределено Тогда
		СправочникДерево.Порядок.Установить(ПорядокСортировкиДерево);
	КонецЕсли;
	
	Если НЕ ИспользоватьПереданныеНастройки И ЭтаФорма.ПараметрОтборПоВладельцу = Неопределено И ЭтаФорма.ПараметрВыборПоВладельцу = Неопределено Тогда
		ТекущийКаталог = ВосстановитьЗначение("ТекущийКаталог");
		
		Если ТипЗнч(ТекущийКаталог) <> Тип("СправочникСсылка.КаталогиТоваров") Тогда
			ТекущийКаталог = Справочники.КаталогиТоваров.Мяснов;
		КонецЕсли;
		
		ЭлементыФормы.НадписьТекущийКаталог.Заголовок = ТекущийКаталог.Наименование;
		Отбор.Владелец.Установить(ТекущийКаталог);

	КонецЕсли;
	
	ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = Истина;
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	ТекущийКаталог = Отбор.Владелец.Значение;
	ЭлементыФормы.НадписьТекущийКаталог.Заголовок	= ТекущийКаталог.Наименование;

КонецПроцедуры

Процедура СправочникСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если ФормаОткрытаДляВыбора И НЕ ВыбраннаяСтрока.ЭтоГруппа Тогда
		СтандартнаяОбработка = Ложь;
		ОповеститьОВыборе(ВыбраннаяСтрока.Ссылка);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗакрытии()
	СтрокаСортировкиСписок = ""; 
	СтрокаСортировкиДерево = "";
	
	Для Каждого СтрПорядка Из СправочникСписок.Порядок Цикл
		СтрокаСортировкиСписок = СтрокаСортировкиСписок + СтрПорядка.Данные+" "+СтрПорядка.Направление+",";
	КонецЦикла;
		
	Для Каждого СтрПорядка Из СправочникДерево.Порядок Цикл
		СтрокаСортировкиДерево = СтрокаСортировкиДерево + СтрПорядка.Данные+" "+СтрПорядка.Направление+",";
	КонецЦикла;
	
	СтрокаСортировкиСписок = Лев(СтрокаСортировкиСписок,СтрДлина(СтрокаСортировкиСписок)-1);
	СтрокаСортировкиДерево = Лев(СтрокаСортировкиДерево,СтрДлина(СтрокаСортировкиДерево)-1);
	
	СохранитьЗначение("ТекущаяСортировкаСписок",СтрокаСортировкиСписок);
	СохранитьЗначение("ТекущаяСортировкаДерево",СтрокаСортировкиДерево);
	

КонецПроцедуры

ФормаОткрытаДляВыбора = Ложь;
ИспользоватьПереданныеНастройки = Ложь;