////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ОбменДанными.Загрузка Тогда
		
		Если ПутьДоОбработки = "<путь до обработки не задан>" Тогда
			
			Сообщить("Не указан путь до обработки.", СтатусСообщения.Важное);
			Отказ = Истина;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидОбработки) Тогда	
			
			Сообщить("Не указан вид обработки.", СтатусСообщения.Важное);
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
