
Процедура ОчиститьПривязкиДоДатыВключительно(Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОткрытыеЗаказыПоКартам.КартаДоступа КАК КартаДоступа,
	|	ОткрытыеЗаказыПоКартам.Заказ КАК Заказ,
	|	ОткрытыеЗаказыПоКартам.ТекущийАвтор КАК ТекущийАвтор,
	|	ОткрытыеЗаказыПоКартам.ВремяПоследнейАктивности КАК ВремяПоследнейАктивности,
	|	ОткрытыеЗаказыПоКартам.МестоПоследнейАктивности КАК МестоПоследнейАктивности
	|ИЗ
	|	РегистрСведений.ОткрытыеЗаказыПоКартам КАК ОткрытыеЗаказыПоКартам
	|ГДЕ
	|	РАЗНОСТЬДАТ(&Дата, ОткрытыеЗаказыПоКартам.Заказ.Дата, ДЕНЬ) > 0";
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Загрузить(Запрос.Выполнить().Выгрузить());
	НЗ.Записывать(Истина);
		
КонецПроцедуры
