
Процедура ПередЗаписью(Отказ, Замещение)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	ТекОтбор = Неопределено;
	О = Отбор.Найти("КартаДоступа");
	Если НЕ О = Неопределено Тогда
		ТекОтбор = О.Значение;
	КонецЕсли;
	ЗарегистрироватьСобытие("Ловушка.РегистрСведений.ОткрытыеЗаказыПоКартам", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Примечание"),, ТекОтбор, ЛояльностьКлиентСервер.СформироватьJSON(ТаблицаЗначенийВМассив(ЭтотОбъект.Выгрузить())));
КонецПроцедуры
