////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ
// 

// Процедура итображает картинку, которая в данный момент находится в хранилище
// Параметры
//  Нет
// Возвращаемые значения
//  Нет
Процедура ОтображениеИзображения()
	
	Если Хранилище.Получить() = Неопределено Тогда
		ЭлементыФормы.ПолеИзображения.Картинка = Новый Картинка();
		Возврат;
	КонецЕсли;
	
	ИзХранилища = Хранилище.Получить();
	Если Тип("Картинка") = ИзХранилища Тогда
		ЭлементыФормы.ПолеИзображения.Картинка = ИзХранилища; 
	Иначе
		ЭлементыФормы.ПолеИзображения.ТекстНевыбраннойКартинки = ИзХранилища;
	КонецЕсли;
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
// 

// Процедура - вызывается при открытии формы
Процедура ПриОткрытии()
	
	ТекущийЭлемент = ЭлементыФормы.Наименование;
	
	ОтображениеИзображения();
	
КонецПроцедуры

// Процедура - вызывается перед записью элемента
Процедура ПередЗаписью(Отказ)
	
	Если Хранилище.Получить() = Неопределено ИЛИ Хранилище.Получить().Вид = ВидКартинки.Пустая Тогда
		Предупреждение("Выберите изображение.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - вызывается после записи элемента
Процедура ПослеЗаписи()
	
	Если ЭтаФорма.РежимВыбора Тогда
		ОповеститьОВыборе(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ДЕЙСТВИЙ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ
// 

// Процедура изменяет текущее изображение на выбираемое из диалога выбора файлов
// Параметры
//  Кнопка - кнопка формы
// Возвращаемые значения
//  Нет
Процедура ДействияФормыИзменитьИзображение(Кнопка)
	
	ВыбранноеФото = ВыбратьИзображениеИзФайла(Ложь);
	Если ВыбранноеФото <> Ложь Тогда
		ЭлементыФормы.ПолеИзображения.Картинка = ВыбранноеФото;	
	КонецЕсли;
	
	ОтображениеИзображения();
	
КонецПроцедуры

// Процедура сохраняет текущее изображение в файл на диск
// Параметры
//  Кнопка - кнопка формы
// Возвращаемые значения
//  Нет
Процедура ДействияФормыСохранитьИзображение(Кнопка)
	
	ЗаписываемаяКартинка = ЭлементыФормы.ПолеИзображения.Картинка;
	Если ЗаписываемаяКартинка.Вид <> ВидКартинки.Пустая Тогда
		
		ДиалогЗаписиФайла                             = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогЗаписиФайла.Заголовок                   = "Укажите имя файла";
		ДиалогЗаписиФайла.ПолноеИмяФайла              = "";
		ДиалогЗаписиФайла.Фильтр                      = ЗаписываемаяКартинка.ФильтрИменФайлов(); // картинки
		ДиалогЗаписиФайла.ПроверятьСуществованиеФайла = Истина;
		
		Если Не ДиалогЗаписиФайла.Выбрать() Тогда
			Возврат;
		КонецЕсли;
		
		Попытка
			ЗаписываемаяКартинка.Записать(ДиалогЗаписиФайла.ПолноеИмяФайла);
		Исключение
			Предупреждение("Ошибка при записи файла: " + ДиалогЗаписиФайла.ПолноеИмяФайла + Символы.ПС
			+ ОписаниеОшибки() + Символы.ПС + "Файл не записан.");
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
