
Процедура ЗарегистрироватьСобытие(ИмяСобытия, Уровень = Неопределено, ОбъектМетаданных = Неопределено, Данные = Неопределено, Комментарий = "", РежимТранзакции = Неопределено) Экспорт
	#Если НЕ ТонкийКлиент Тогда
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий, РежимТранзакции);	
	#КонецЕсли
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
	ОбщегоНазначенияКлиент.ЗарегистрироватьСобытиеКлиент(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий, РежимТранзакции);
	#КонецЕсли
КонецПроцедуры


Функция глОтладкаУровень() Экспорт
	#Если Клиент Тогда
		глПараметрыРМ = глПараметрыРМ;
		Попытка
			Тест = глПараметрыРМ.Тест;
		Исключение
			Тест = Ложь;
		КонецПопытки;
		ИК = ИмяКомпьютера();
		Если СтрНайти(ИК,"ws_it") Или СтрНайти(ИК,"s0") Или СтрНайти(ИК,"m0") Или СтрНайти(ИК,"k0") Или Тест Тогда
			Возврат 1;
		Иначе
			Возврат 0;
		КонецЕсли;
	#Иначе
		Возврат 0;
	#КонецЕсли
КонецФункции


