Перем СтрокаСправочника Экспорт;  //Ссылка на строку из табличной части печатной формы, для которой открыли эту форму

Процедура ОсновныеДействияФормыОК(Кнопка)
	ОсновныеДействияФормыЗаписать(Кнопка);
	ЭтаФорма.Закрыть();
КонецПроцедуры

Процедура ОсновныеДействияФормыЗаписать(Кнопка)
	СтрокаСправочника.Процедура=ЭлементыФормы.ТекстПроцедуры.ПолучитьТекст();
КонецПроцедуры


Процедура ПриОткрытии()
	ЭлементыФормы.ТекстПроцедуры.УстановитьТекст(СтрокаСправочника.Процедура);
КонецПроцедуры


Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Ответ=Вопрос("Сохранить изменения ?", РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОсновныеДействияФормыЗаписать(0);
		ИначеЕсли Ответ=КодВозвратаДиалога.Отмена Тогда
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

