
Процедура ОбновлениеОтображения()
	
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ОписаниеПрофиля) ТОгда
		Предупреждение("Данная обработка открывается только из справочника торгового оборудования!",5);
		Отказ = Истина;
		Возврат;  		
	КонецЕсли; 
	
	ЗаполнитьСписокВыбораРазмеровОкна();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если НЕ Изображение.Пустая() Тогда
		ЭлементыФормы.ПолеКартинки.Картинка = Изображение.Хранилище.Получить();
	КонецЕсли;

КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	ЗаполнитьЗначенияСвойств(ПараметрыТО,ЭтотОбъект);
	Закрыть("ОК");
	
КонецПроцедуры

Процедура ИзображениеНажатие(Элемент)
	
	ХранилищеДополнительнойИнформации.ОткрытьФормуИзображения(ЭтаФорма, Изображение);

КонецПроцедуры

// Заполняет список выбора элемента формы РазмерОкна
//
Процедура ЗаполнитьСписокВыбораРазмеровОкна()
	
	СписокВыбора = ЭлементыФормы.РазмерОкнаИнфоДисплея.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(0, "Во весь экран");
	СписокВыбора.Добавить(2, "800х600");
	СписокВыбора.Добавить(3, "1024х768");
	
	Если СписокВыбора.НайтиПоЗначению(РазмерОкнаИнфоДисплея) = Неопределено Тогда
		ИнтерфейсРазмерОкна = СписокВыбора[0].Значение;
	Иначе
		ИнтерфейсРазмерОкна = ЭлементыФормы.РазмерОкнаИнфоДисплея.Значение;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзображениеПриИзменении(Элемент)
	
	Если НЕ Изображение.Пустая() Тогда
		ЭлементыФормы.ПолеКартинки.Картинка = Изображение.Хранилище.Получить();
	КонецЕсли;
	
КонецПроцедуры

Результат = Новый Структура("Ошибка,Описание,Подробно", Ложь,"","");
