
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.Список.ТекущийЭлемент.Имя = "ДатаЗакрытия" Тогда
		СтандартнаяОбработка = Ложь;
		ДС = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
		Если ДС = Неопределено Тогда
			Возврат;	
		КонецЕсли;
		СсылкаЗакрытие = ДС.Закрытие;
		Если ЗначениеЗаполнено(СсылкаЗакрытие) Тогда
		КонецЕсли;
		Попытка
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				СсылкаЗакрытие.ПолучитьФорму().Открыть();
			#Иначе
				ОткрытьФорму("Документ.Касса_ЗакрытиеСмены.Форма.ФормаДокументаУправляемая", Новый Структура("Ключ", СсылкаЗакрытие));
			#КонецЕсли
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
