////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ТолькоПросмотр = Истина;
	
	Если глВерсия=1 Тогда
		ЭлементыФормы.Панель1.Страницы.Специфики.Видимость = Ложь;
	КонецЕсли; 
	//Если ЭтоНовый() Тогда
	//	ДокументОбработан = Ложь;
	//КонецЕсли; 
	
КонецПроцедуры

// Процедура обновляет отображение элементов формы.
//
Процедура ОбновлениеОтображения()
	
	ОбновитьПодвал();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ТАБЛИЧНОЙ ЧАСТИ ТОВАРЫ НА ЗАКЛАДКЕ СПЕЦИФИКИ

// Процедура - обработчик события ПриВыводеСтроки табличной части
// "Товары". Формирует данные в колонке "Всего".
//
Процедура Товары1ПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)

	Если ЗначениеЗаполнено(ДанныеСтроки.КогдаВПродаже) Тогда
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.ОтображатьФлажок = Истина;
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.Флажок	= Истина;
	Иначе
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.ОтображатьФлажок = Ложь;
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ТАБЛИЧНОЙ ЧАСТИ СПЕЦИФИКИ


// Заполнить дерево товаров специфик
//
Процедура ЗаполнитьДеревоТоваровСпецифик()

	ДеревоТоваров.Строки.Очистить();
	Для Каждого СтрокаТЧ Из Товары Цикл  
		СтрокаТовара = ДеревоТоваров.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовара, СтрокаТЧ);
		
		МассивСпецифик = Специфики.НайтиСтроки(Новый Структура("ИдентификаторТовара", СтрокаТЧ.ИдентификаторТовара));
		Для Каждого СтрокаСпецифики Из МассивСпецифик Цикл 
			НоваяСтрока = СтрокаТовара.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСпецифики);
			НоваяСтрока.Номенклатура = СтрокаСпецифики.Номенклатура;
		КонецЦикла;
		ЭлементыФормы.ДеревоТоваров.Развернуть(СтрокаТовара);
		
	КонецЦикла;			

КонецПроцедуры // ЗаполнитьДеревоТоваровСпецифик()


///////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ОБРАБОТЧИКИ 

// Процедура формирует текст в информационной надписи об итогах документа.
//
// Параметры:
//  Нет.
//
Процедура ОбновитьПодвал()

	ВременнаяСтрока = "";
	Если ЗначениеЗаполнено(КатегорияЦен) Тогда
		ВременнаяСтрока = ВременнаяСтрока + "Категория цен: " + КатегорияЦен;
	Иначе
		ВременнаяСтрока = ВременнаяСтрока + "Категория цен: Не заполнено!";
	КонецЕсли;

	ЭлементыФормы.ИнфНадписьТоварыИтоги.Заголовок = ВременнаяСтрока;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

Процедура Панель2ПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ЭлементыФормы.Панель2.ТекущаяСтраница = ЭлементыФормы.Панель2.Страницы.ДеревоСпецифик Тогда
		ЗаполнитьДеревоТоваровСпецифик();
	КонецЕсли;
	
КонецПроцедуры

Процедура Панель1ПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ЭлементыФормы.Панель2.ТекущаяСтраница = ЭлементыФормы.Панель2.Страницы.ДеревоСпецифик Тогда
		ЗаполнитьДеревоТоваровСпецифик();
	КонецЕсли;
	
КонецПроцедуры

Процедура Товары1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Элемент.ТекущаяСтрока.ИдентификаторТовара = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура Товары1ПриАктивизацииСтроки(Элемент)
	
	Если НЕ ЭлементыФормы.Товары1.ТекущиеДанные = Неопределено Тогда
		ЭлементыФормы.Специфики.ОтборСтрок.ИдентификаторТовара.Значение			= ЭлементыФормы.Товары1.ТекущиеДанные.ИдентификаторТовара;
		ЭлементыФормы.Специфики.ОтборСтрок.ИдентификаторТовара.Использование	= Истина;
		
		МассивСтрок = Новый Массив;
		Для каждого ВыделеннаяСтрока Из ЭлементыФормы.Товары1.ВыделенныеСтроки Цикл
			МассивСтрок.Добавить(ВыделеннаяСтрока);
		КонецЦикла;
		
		Оповестить("АктивизацияСтрокиТабличнойЧастиДокументаПланМеню", МассивСтрок, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры


Процедура НаличиеВПродаже(Кнопка)
	
	ФормаРедактированияНаличияВПродаже = ЭтотОбъект.ПолучитьФорму("ФормаРедактированияНаличияВПродаже", ЭтаФорма, ЭтотОбъект);
	ФормаРедактированияНаличияВПродаже.ДокументОбъект = ЭтотОбъект;
	ФормаРедактированияНаличияВПродаже.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаРедактированияНаличияВПродаже.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	ФормаРедактированияНаличияВПродаже.Открыть();
	
	Если Кнопка.Имя = "НаличиеВПродажеТовары" Тогда
		МассивСтрок = Новый Массив;
		Для каждого ВыделеннаяСтрока Из ЭлементыФормы.Товары1.ВыделенныеСтроки Цикл
			Если НЕ ЗначениеЗаполнено(ВыделеннаяСтрока.ИдентификаторТовара) Тогда
				ВыделеннаяСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
			КонецЕсли;
			МассивСтрок.Добавить(ВыделеннаяСтрока);
		КонецЦикла;
	Иначе
		МассивСтрок = Новый Массив;
		Для каждого ВыделеннаяСтрока Из ЭлементыФормы.Специфики.ВыделенныеСтроки Цикл
			МассивСтрок.Добавить(ВыделеннаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ МассивСтрок = Неопределено Тогда
		Оповестить("АктивизацияСтрокиТабличнойЧастиДокументаПланМеню", МассивСтрок, ЭтотОбъект);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура СпецификиПриАктивизацииСтроки(Элемент)
	
	МассивСтрок = Новый Массив;
	Для каждого ВыделеннаяСтрока Из ЭлементыФормы.Специфики.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	Оповестить("АктивизацияСтрокиТабличнойЧастиДокументаПланМеню", МассивСтрок, ЭтотОбъект);
	
КонецПроцедуры

Процедура СпецификиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ЗначениеЗаполнено(ДанныеСтроки.КогдаВПродаже) Тогда
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.ОтображатьФлажок	= Истина;
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.Флажок	= Истина;
	Иначе
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.ОтображатьФлажок	= Ложь;
	КонецЕсли;
	
КонецПроцедуры
