
&НаКлиенте
Процедура ЗаполнитьПоДаннымСУПцентр(Команда)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Регион = Параметры.Регион;
	НомерТТ = Параметры.НомерТТ;
	Если Не Параметры.Свойство("СтандартныеПорты", СтандартныеПорты) Тогда
		СтандартныеПорты = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьРМНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРМ(Команда)
	ЗаполнитьРМНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоказатьДанныеСУП_ЦЕНТРАНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанныеСУП_ЦЕНТРА(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСУПцентр;
	Элементы.СтраницыНавигации.ТекущаяСтраница = Элементы.СтраницаНавигацииСтраницаНавигацииОсновнаяСУПцентр;
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НазадКосновной(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновная;
	Элементы.СтраницыНавигации.ТекущаяСтраница = Элементы.СтраницаНавигацииОсновная;
КонецПроцедуры
