
&НаКлиенте
Процедура ЗаполнитьПоДаннымСУПцентр(Команда)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Регион = Параметры.Регион;
	НомерТТ = Параметры.НомерТТ;
	
	Если Не ЗначениеЗаполнено(НомерТТ) Тогда
		НомерТТ = НомерТТ();
	КонецЕсли;
	
	Если Не Параметры.Свойство("СтандартныеПорты", СтандартныеПорты) Тогда
		СтандартныеПорты = Истина;
	КонецЕсли;
	Фирмы.Параметры.УстановитьЗначениеПараметра("НомерТТ", НомерТТ);
КонецПроцедуры

Функция НомерТТ() Экспорт
	НомерТТ = Число(Сред(Объект.Код, 3)); // вызовет исключение на неправильных кодах. Так и нужно
	стрНомерТТ = Формат(НомерТТ,"ЧГ=0");
	Возврат стрНомерТТ;
КонецФункции


Процедура ЗаполнитьРМНаСервере()
	Запрос = Новый Запрос("выбрать * из справочник.РабочиеМеста где информационнаяБаза = &ИБ");
	Запрос.УстановитьПараметр("ИБ", Объект.Ссылка);
	ТаблицаРМ.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРМ(Команда)
	ЗаполнитьРМНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоказатьДанныеСУП_ЦЕНТРАНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанныеСУП_ЦЕНТРА(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСУПцентр;
	Элементы.СтраницыНавигации.ТекущаяСтраница = Элементы.СтраницаНавигацииСтраницаНавигацииОсновнаяСУПцентр;
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НазадКосновной(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновная;
	Элементы.СтраницыНавигации.ТекущаяСтраница = Элементы.СтраницаНавигацииОсновная;
КонецПроцедуры
