
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ЗаполнитьШаблоны();
	
	ВсегоСтраниц = Шаблоны.Количество() / КолвоКнопок;
	Если Цел(ВсегоСтраниц) <> ВсегоСтраниц Тогда
		ВсегоСтраниц = Цел(ВсегоСтраниц) + 1;
	КонецЕсли;
	ТекСтраница = 1;
	
	ВывестиТекущуюСтраницу(ЭтаФорма);
	
	ЭлементыФормы.ТекстСообщения.ТолькоПросмотр = ЗапретРедактирования;
	ЭлементыФормы.КнопкаЭкраннаяКлава.Видимость = НЕ ЗапретРедактирования;
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
			
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаЭкраннаяКлаваНажатие(Элемент)
	
	ИнтерфейсРМ.ЭкраннаяКлавиатура();
	
	ТекущийЭлемент = ЭлементыФормы.ТекстСообщения;
	
КонецПроцедуры

Процедура КнопкаСтрелкаВверхНажатие(Элемент)
	
	ТекСтраница = ТекСтраница - 1;
	ВывестиТекущуюСтраницу(ЭтаФорма);
	
КонецПроцедуры

Процедура КнопкаСтрелкаВнизНажатие(Элемент)
	
	ТекСтраница = ТекСтраница + 1;
	ВывестиТекущуюСтраницу(ЭтаФорма);
	
КонецПроцедуры

Процедура КнопкаВыбораНажатие(Элемент)
	
	ИндексЗначенияПервойКнопки = (ТекСтраница-1) * КолвоКнопок;
	НомерКнопки = Число(Сред(Элемент.Имя,7));
	
	ТекстСообщения = Шаблоны[ ИндексЗначенияПервойКнопки + НомерКнопки-1 ].Текст;
		
КонецПроцедуры

Процедура ОКПодача(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ТекстСообщения) Тогда
		Текст1="Ошибка!";
		Текст2="Введите текст сообщения!";
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");
		Возврат;
	КонецЕсли; 
	
	Закрыть("Подача");
	
КонецПроцедуры

Процедура ОКПозиция(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ТекстСообщения) Тогда
		Текст1="Ошибка!";
		Текст2="Введите текст сообщения!";
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");
		Возврат;
	КонецЕсли; 
	
	Закрыть("Позиция");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

КолвоКнопок = 8;