Перем Режим, ОкноОбрезано;

Процедура ПриОткрытии()
	ФД = ХранилищеТела.Получить();
	HTML = HTML;
	Вложения=Вложения;
	ФД.ПолучитьHTML(HTML, Вложения);
	HTML = СтрЗаменить(HTML,"padding:8px;","padding:0px;");
	
	ЭлементыФормы.ПолеHTML.УстановитьТекст(HTML);
КонецПроцедуры

Процедура ПолеHTMLonclick(Элемент, pEvtObj)
ОкноОбрезано=Ложь;
	
КонецПроцедуры

Процедура ПолеHTMLondblclick(Элемент, pEvtObj)
		Режим = ?(РежимПоляHTMLДокумента.Редактирование = Режим, РежимПоляHTMLДокумента.Просмотр, РежимПоляHTMLДокумента.Редактирование);
	HTML=(ЭлементыФормы.ПолеHTML.ПолучитьТекст());
	ЭлементыФормы.ПолеHTML.УстановитьРежим(Режим);
	ЭлементыФормы.ПолеHTML.УстановитьТекст(HTML);

	Сообщить(HTML);
КонецПроцедуры

Процедура ОбновлениеОтображения()
	Если НЕ ОкноОбрезано Тогда
		
	//	
	//
	//	hwnd = РаботаСокнами.FindMDIChildV8(Заголовок);
	//	Попытка
	//		Com=Новый COMОбъект("AutoHotkey.Script");
	//		com.ahktextdll("
	//		|WinGetPos, X, Y, Width, Height, ahk_id "+СтрЗаменить(hwnd,Символы.НПП,"") + "
	//		|Width := Width-16
	//		|;winset, trans
	//		|Height := Height-30
	//		|WinSet, Region, 5-24 W%Width% H%Height% R, ahk_id "+СтрЗаменить(hwnd,Символы.НПП,"") + "
	//		|WinSet, AlwaysOnTop,, ahk_id "+СтрЗаменить(hwnd,Символы.НПП,"") + "
	//		|winactivate, ahk_id "+СтрЗаменить(hwnd,Символы.НПП,""));
	//	Исключение
	//		ОкноОбрезано = Истина;
	//		//Сообщить(ОписаниеОшибки());
	//	КонецПопытки;
		ОкноОбрезано = Истина;

		//Если hwnd Тогда
		//
		//	 ОкноОбрезано = Истина;
		     ПодключитьОбработчикОжидания("ЗакрытьФорму",4,1);
		//КонецЕсли; 
		//Заголовок = "";
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗакрытьФорму() Экспорт
	ЭтаФорма.Закрыть();

КонецПроцедуры 

Процедура ПриПовторномОткрытии(СтандартнаяОбработка)
	ОкноОбрезано=Ложь;
КонецПроцедуры

Процедура ОбработкаАктивизацииОбъекта(АктивныйОбъект, Источник)
	ОкноОбрезано=Ложь;
КонецПроцедуры

ОкноОбрезано = Ложь;
Заголовок = "Сообщение";


		