
&НаКлиенте
Процедура СПУЛЛояльности(Команда)
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Заказ", ТекущаяСтрока.Ссылка);
	ОткрытьФорму("РегистрСведений.СПУЛЛояльности.ФормаСписка", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЛояльности(Команда)
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Заказ", ТекущаяСтрока.Ссылка);
	ОткрытьФорму("РегистрСведений.ДанныеЛояльностиПоЗаказу.ФормаСписка", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Кзаказам(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗаказы;
КонецПроцедуры

&НаКлиенте
Процедура Кпротоколам(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПротоколы;
КонецПроцедуры
