////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИИ СОБЫТИЙ ФОРМЫ

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда 
		Если не Элемент.ТекущиеДанные.ЭтоГруппа тогда
			ТекущаяКартинка = Элемент.ТекущиеДанные.Ссылка.Хранилище.Получить();
			Попытка
				ЭлементыФормы.ПолеИзображения.Картинка = ?(ТекущаяКартинка <> Неопределено, ТекущаяКартинка, Новый Картинка());
			Исключение
				ЭлементыФормы.ПолеИзображения.Картинка = Новый Картинка();
			КонецПопытки;		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДействияФормыДобавитьНесколькоФайлов(Кнопка)
	ХранилищеДополнительнойИнформации.ДобавитьФайлы();
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ЗначениеЗаполнено(ТекущаяСсылка) Тогда
		ЭлементыФормы.СправочникСписок.ТекущаяСтрока = ТекущаяСсылка;
	КонецЕсли; 
	
КонецПроцедуры

