
//Процедура-обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии()
	
	Если ТипЗнч(ЭлементыФормы.ВладелецНастройки.Значение) = Тип("СправочникСсылка.Пользователи") ТОгда
		Общая = 2;
		ЭлементыФормы.ВладелецНастройки.Доступность = Истина;
	ИначеЕсли ТипЗнч(ЭлементыФормы.ВладелецНастройки.Значение) = Тип("СправочникСсылка.ГруппыНастроек") Тогда
		Общая = 3;
		ЭлементыФормы.ВладелецНастройки.Доступность = Истина;
	Иначе
		Общая = 1;
		ЭлементыФормы.ВладелецНастройки.Доступность = Ложь;
	КонецЕсли;
		
КонецПроцедуры


//Процедура-обработчик события "ПриЗакрытии" формы.
//
Процедура ПриЗакрытии()
	
	Если ВладелецФормы <> Неопределено Тогда
		Оповестить("ИзменениеНастройки",,ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры


//Процедура-обработчик события "ПриИзменении" переключателя.
//
Процедура ОбщаяПриИзменении(Элемент)
	
	
	Если Элемент.Значение = 1 ТОгда 
		ЭлементыФормы.ВладелецНастройки.Значение = Неопределено;
		ЭлементыФормы.ВладелецНастройки.Доступность = Ложь;

	ИначеЕсли Элемент.Значение = 2 Тогда
		ВладелецНастройки = Справочники.Пользователи.ПустаяСсылка();
		ЭлементыФормы.ВладелецНастройки.Доступность = Истина;
	Иначе 
		ВладелецНастройки = Справочники.ГруппыНастроек.ПустаяСсылка();
		ЭлементыФормы.ВладелецНастройки.Доступность = Истина;

	КонецЕсли;  		
	
КонецПроцедуры

//Процедура-обработчик события "ПередЗаписью" формы.
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВладелецНастройки) и (Общая = 2 или Общая = 3) Тогда
		Предупреждение("Не указан владелец настройки!!!");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры







