
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОЖИДАНИЯ

// чтобы часики тикали
//
Процедура ОбновитьДатуВремя()
	
	ТекДата = ТекущаяДата();
	ЭлементыФормы.тДата.Заголовок	= Формат(ТекДата,"ДЛФ=Д");
	ЭлементыФормы.тВремя.Заголовок	= Формат(ТекДата,"ДЛФ=В");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ГлавныйИнтерфейс.ПереключитьИнтерфейс("РабочееМесто");
	
	УстановкаОкна1С();
	
	ГлавнаяФорма = ЭтаФорма;
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередЗакрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	// заставка
	ЭлементыФормы.ПолеКартинкиЗаставка.Картинка = БиблиотекаКартинок["ЗаставкаГлавнойФормы"+глВерсия];
	
	// неизменяемые надписи
	ЭлементыФормы.тИмяКонфигурации	.Заголовок = Метаданные.Синоним;
	ЭлементыФормы.тВерсия			.Заголовок = "Версия: "+Метаданные.Версия;
	
	ЭлементыФормы.КнопкаСписокЗаказов.Видимость = Ложь;
	
	// периодически обновляемые надписи
	ОбновитьДатуВремя();
	ПодключитьОбработчикОжидания("ОбновитьДатуВремя", 1);
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	Если ЗначениеЗаполнено(глПользователь) Тогда
		ЭлементыФормы.тПользователь.Заголовок = глПользователь.Наименование;
	Иначе
		ЭлементыФормы.тПользователь.Заголовок = "Система заблокирована";
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ИзменениеСмены" Тогда
		
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаНовыйЗаказНажатие(Элемент)
	
	СоздатьНовыйЗаказ();
	
КонецПроцедуры

Процедура КнопкаСписокЗаказовНажатие(Элемент)
	
	ОткрытьСписокЗаказов();
	
КонецПроцедуры

Процедура КнопкаРежимАдминистратораНажатие(Элемент)
	
	ОткрытьРежимАдминистратора();
	
КонецПроцедуры

Процедура КнопкаАвторизацияНажатие(Элемент)
	
	Авторизация( Истина );
	
КонецПроцедуры

Процедура КнопкаЗаблокироватьНажатие(Элемент)
	
	Заблокировать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ
