
Процедура ПриЗаписи(Отказ, Замещение)
	глПараметрыРМ = глПараметрыРМ;
		Если глПараметрыРМ = Неопределено или НЕ глПараметрыРМ.ККМЕсть Тогда
			Для каждого эл из ЭтотОбъект цикл
				Спр = эл.РабочееМесто;
				ИмяФайла = ПолучитьИмяВременногоФайла("txt");
				ЗаписатьОбъектВФайл(ИмяФайла,ЭтотОбъект);
				Профиль = Спр.ПрофильВхода;
				Поз = СтрНайти(Профиль,"\",НаправлениеПоиска.СКонца);
				СтрПуть = Лев(Профиль,Поз-1);
				Наим = Сред(СтрПуть,3);
				Сеть.ПодключитьШару(Наим);
				СтрПуть = СтрПуть + "\";
				Каталог = Константы.ПутьДляЛогирования.Получить();
				СтрПуть = СтрПуть + СтрЗаменить(Каталог,":","$");
				СтрПуть = ?(Прав(СтрПуть,1) = "\",СтрПуть,СтрПуть + "\");
				СтрПуть = СтрПуть + Формат(ТекущаяДата(),"ДФ=yyyyMMdd") + "\";
				ИмяфайлаПолучателя = СтрПуть + "НомерЧекаНФР_" + Наим + ".txt";
				Попытка
					КопироватьФайл(ИмяФайла,ИмяфайлаПолучателя);
				Исключение
					ЗарегистрироватьСобытие("Ошибка записи файла протокол расчетов",УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект,,"Ошибка доступа до " + Профиль);
				КонецПопытки;
			конеццикла;
		Иначе
			Для каждого эл из ЭтотОбъект цикл
				Каталог = Константы.ПутьДляЛогирования.Получить();
				Каталог = ?(Прав(Каталог,1) = "\", Каталог, Каталог + "\") + Формат(ТекущаяДата(),"ДФ=yyyyMMdd") + "\";
				Профиль = эл.РабочееМесто.ПрофильВхода;
				Поз = СтрНайти(Профиль,"\",НаправлениеПоиска.СКонца);
				Наим = Сред(Лев(Профиль,поз - 1),3);
				ИмяФайла = "НомерЧекаНФР_" + Наим + ".txt";
				ЗаписатьОбъектВФайл(Каталог + ИмяФайла,ЭтотОбъект);
			КонецЦикла;
		КонецЕсли;	
КонецПроцедуры
