
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИндексыКоллекции = Новый Соответствие;
	ИндексыКоллекции.Вставить(3, 15);
	ИндексыКоллекции.Вставить(5, 16);
	ИндексыКоллекции.Вставить(7, 17);
	ИндексыКоллекции.Вставить(10, 18);
	
	Фирма = Параметры.Фирма;
	
	Для каждого ТекСтрока Из Параметры.ЛУЧ Цикл
		НовСтрока = ЛУЧ.Добавить();
		НовСтрока.МестоРеализации = ЛояльностьКлиентСерверПовтИсп.МестоРеализацииПоПроекту(ТекСтрока.Проект);
		НовСтрока.Коэффициент = ТекСтрока.Коэффициент;
		НовСтрока.КодСУП = ТекСтрока.КодТовара;
		НовСтрока.Лого = ИндексыКоллекции.Получить(ТекСтрока.Коэффициент);
		Если НЕ ЗначениеЗаполнено(НовСтрока.Лого) Тогда
			НовСтрока.Лого = 13;
		КонецЕсли;
	КонецЦикла;
	
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВремТЗ", ЛУЧ.Выгрузить(, "КодСУП"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВремТЗ.КодСУП КАК КодСУП
	|ПОМЕСТИТЬ втЛУЧ
	|ИЗ
	|	&ВремТЗ КАК ВремТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЛУЧ.КодСУП КАК КодСУП,
	|	Номенклатура.Ссылка КАК Товар
	|ИЗ
	|	втЛУЧ КАК втЛУЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО втЛУЧ.КодСУП = Номенклатура.КодСУП
	|			И (НЕ Номенклатура.ПометкаУдаления)";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		СтрокиТов = ЛУЧ.НайтиСтроки(Новый Структура("КодСУП", РезультатЗапроса.КодСУП));
		Для каждого ТекСтрока Из СтрокиТов Цикл
			ТекСтрока.Товар = РезультатЗапроса.Товар;
		КонецЦикла;
	КонецЦикла;
	
	
	Если ЗначениеЗаполнено(Параметры.Фирма) Тогда
		СтруктураОтбор = Новый ФиксированнаяСтруктура("МестоРеализации", Параметры.Фирма.МестоРеализации);
	Иначе
		СтруктураОтбор = Новый ФиксированнаяСтруктура;
	КонецЕсли;
	Элементы.ЛУЧ.ОтборСтрок = СтруктураОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДопПараметрыИнфо = Новый Структура("ТабДокЛуч", СформироватьТабДокЛуч());
	ИнтерфейсРМ.ВыводНаИнфоДисплей("ПоказатьЛУЧ", , , , ДопПараметрыИнфо);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ИнтерфейсРМ.ВыводНаИнфоДисплей("УбратьЛУЧ");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЛУЧ
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьТабДокЛуч()
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетЛУЧ");
	
	ОблМакета = Макет.ПолучитьОбласть("ШапкаЛУЧ");
	Если НЕ Фирма.Пустая() Тогда
		ОблМакета.Параметры.ФирмаКратко = ?(Фирма.МестоРеализации = ПредопределенноеЗначение("Справочник.МестаРеализации.Ресторан"), "Кухни Полли", Фирма.МестоРеализации);
	КонецЕсли;
	ТабДок.Вывести(ОблМакета);
	
	Для каждого ТекСтрока Из Элементы.ЛУЧ Цикл
		ОблМакета = Макет.ПолучитьОбласть("СтрокаЛУЧ");
		ОблМакета.Параметры.Товар = ТекСтрока.Товар;
		ТабДок.Вывести(ОблМакета);
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции


#КонецОбласти
