
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	Если ЗначениеЗаполнено(глРабочееМесто) Тогда
		ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	Если ЗначениеЗаполнено(глРабочееМесто) Тогда
		ИнтерфейсРМ.ПриЗакрытииОкна();
	КонецЕсли; 
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаПечатьНажатие(Кнопка)
	
	Таб = ЭлементыФормы.ПолеТабличногоДокумента;
	Таб.Напечатать( ЗначениеЗаполнено(ИмяПринтера) );
	
	Закрыть("ОК");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

