
Процедура ГрупповаяОбработка()
	
	
КонецПроцедуры	

Процедура ДействияФормыЗаполнитьТовары(Кнопка)
	
	Справочники.Номенклатура.ПолучитьФорму("Автозаполнение").Открыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
	Если ТолькоПросмотр Тогда
		ЭлементыФормы.ДействияФормы.Кнопки.ГрупповаяОбработка.Доступность = Ложь;
		ЭлементыФормы.ДействияФормы.Кнопки.ЗаполнитьТовары.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры
