Функция ПолучитьНомерПорта(ПараметрыТО, Числом = Ложь) Экспорт
	ир = ирКэш.Получить();
	RegExp = ир.RegExp;
	RegExp.Pattern = "(Port.*\n{""N"",\d*)(\d+)(})";
	
	Попытка
		Matches 	= RegExp.Execute(ПараметрыТО);
		НомерПорта 	= Matches.item(0).SubMatches.Item(1);
	Исключение
		НомерПорта = Неопределено;
	КонецПопытки;
	
	Если Числом Тогда
		Возврат ?(НомерПорта = Неопределено, НомерПорта, Число(НомерПорта));
	КонецЕсли;
		
	Если НомерПорта = Неопределено Тогда
		стрПорт = "<не задан>";
	ИначеЕсли НомерПорта = "0" Тогда
		стрПорт = "Клавиатура";
	Иначе
		стрПорт = "COM" + НомерПорта;
	КонецЕсли;
		
	Возврат стрПорт;
КонецФункции

Функция ИзменитьНомерПорта(ПараметрыТО, НовыйНомерПорта) Экспорт
	ир = ирКэш.Получить();
	RegExp = ир.RegExp;
	RegExp.Pattern = "(Port.*\n{""N"",\d*)(\d+)(})";
	
	НовыеПараметрыТО = RegExp.Replace(ПараметрыТО, "$1"+НовыйНомерПорта+"$3");
	Возврат НовыеПараметрыТО;
КонецФункции
