
Процедура ПередЗаписью(Отказ)
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//|	МенюЛояльности.Ссылка
	//|ИЗ
	//|	Справочник.МенюЛояльности КАК МенюЛояльности
	//|ГДЕ
	//|	МенюЛояльности.Регион = &Регион
	//|	И МенюЛояльности.МестоРеализации = &МестоРеализации
	//|	И МенюЛояльности.Станция = &Станция
	//|	И МенюЛояльности.Ссылка <> &Ссылка");

	//Запрос.УстановитьПараметр("Регион", Регион);
	//Запрос.УстановитьПараметр("МестоРеализации", МестоРеализации);
	//Запрос.УстановитьПараметр("Станция", Станция);
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);

	//Если Не Запрос.Выполнить().Пустой() Тогда
	//	#Если Клиент Тогда
	//	Предупреждение("Настройка меню с таким сочетанием региона, станции и места реализации уже есть в справочнике!");
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецЕсли;
	Наименование = "" + ТипТТ + " " + Регион + ?(Станция.Пустая(), "", " (" + Станция + ")");
КонецПроцедуры
