
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
	ЭлементыФормы.Кнопка1Тень.Видимость = ЭлементыФормы.Кнопка1.Видимость;
	ЭлементыФормы.Кнопка2Тень.Видимость = ЭлементыФормы.Кнопка2.Видимость;
	
	ОбновлениеОтображения();
КонецПроцедуры

Процедура ОбновлениеОтображения()
	ОтключитьОбработчикОжидания("ОбновлениеОтображения");
	ЭтаФорма.ЭлементыФормы.Кнопка1Рамка.Видимость = (ЭтаФорма.ТекущийЭлемент = ЭтаФорма.ЭлементыФормы.Кнопка1);
	ЭтаФорма.ЭлементыФормы.Кнопка2Рамка.Видимость = (ЭтаФорма.ТекущийЭлемент = ЭтаФорма.ЭлементыФормы.Кнопка2);
	ПодключитьОбработчикОжидания("ОбновлениеОтображения", 0.4, Истина);
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	//Если НЕ ВводДоступен() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//_Знач = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник,Событие,Данные);
	//
	//Если ЗначениеЗаполнено(_Знач) Тогда
	//	Закрыть( _Знач );
	//КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура Кнопка1Нажатие(Элемент)
	
	Закрыть( Элемент.Заголовок );
	
КонецПроцедуры

Процедура Кнопка2Нажатие(Элемент)
	
	Закрыть( Элемент.Заголовок );
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

ЗнакРубля = глСимволРубля;