
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

Перем НачЗначение Экспорт;      // начальное значение 
Перем ФлагОткрытия,ПозицияВвода;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ МОДУЛЯ

Процедура Сброс()
	
	ЗначениеВвода = Дата(1,1,1,0,0,0);
	ПозицияВвода = 1;
	
	глОтсечкаПростоя();
	
КонецПроцедуры

Процедура НажатиеКнопки(СтрКнопки)
	
	Если ФлагОткрытия Тогда
		Сброс();
		ФлагОткрытия = Ложь;
	КонецЕсли;
	
	ЧЧ = Час(ЗначениеВвода);
	ММ = Минута(ЗначениеВвода);
	
	Если ПозицияВвода=1 Тогда
		ЧЧ = Число(СтрКнопки);
		
	ИначеЕсли ПозицияВвода=2 Тогда
		ЧЧ = Число( Строка(ЧЧ)+СтрКнопки );
		
	ИначеЕсли ПозицияВвода=3 Тогда
		ММ = Число(СтрКнопки);
		
	ИначеЕсли ПозицияВвода=4 Тогда
		ММ = Число( Строка(ММ)+СтрКнопки );
		
	КонецЕсли;
	
	Если ЧЧ>23 ИЛИ ММ>59 Тогда
		Возврат;
	КонецЕсли; 
	
	ЗначениеВвода = Дата(1,1,1,ЧЧ,ММ,0);
	
	ПозицияВвода = ?(ПозицияВвода=4, 1, ПозицияВвода+1);
	
	глОтсечкаПростоя();
	
КонецПроцедуры

Процедура ИзменитьЧас(Сдвиг)
	
	ЧЧ = Час(ЗначениеВвода) + Сдвиг;
	Если ЧЧ=24 Тогда
		ЧЧ = 0;
	ИначеЕсли ЧЧ=-1 Тогда
		ЧЧ = 23;
	КонецЕсли; 
	
	ММ = Минута(ЗначениеВвода);
	
	ЗначениеВвода = Дата(1,1,1,ЧЧ,ММ,0);
	
КонецПроцедуры

Процедура ИзменитьМинуту(Сдвиг)
	
	ЧЧ = Час(ЗначениеВвода);
	
	ММ = Минута(ЗначениеВвода) + Сдвиг;
	Если ММ=60 Тогда
		ММ = 0;
	ИначеЕсли ММ=-1 Тогда
		ММ = 59;
	КонецЕсли; 
	
	ЗначениеВвода = Дата(1,1,1,ЧЧ,ММ,0);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ФлагОткрытия	= Истина;	
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаОКНажатие(Элемент)
	
	Закрыть( ЗначениеВвода );
	
КонецПроцедуры

Процедура КнопкаСбросНажатие(Элемент)
	
	Сброс();
	
КонецПроцедуры

Процедура Кнопка0Нажатие(Элемент)
	
	НажатиеКнопки("0");
	
КонецПроцедуры

Процедура КнопкаРазделительНажатие(Элемент)
	
	ФлагОткрытия = Ложь;
	ПозицияВвода = 3;
	
КонецПроцедуры

Процедура Кнопка1Нажатие(Элемент)
	
	НажатиеКнопки("1");
	
КонецПроцедуры

Процедура Кнопка2Нажатие(Элемент)
	
	НажатиеКнопки("2");
	
КонецПроцедуры

Процедура Кнопка3Нажатие(Элемент)
	
	НажатиеКнопки("3");
	
КонецПроцедуры

Процедура Кнопка4Нажатие(Элемент)
	
	НажатиеКнопки("4");
	
КонецПроцедуры

Процедура Кнопка5Нажатие(Элемент)
	
	НажатиеКнопки("5");
	
КонецПроцедуры

Процедура Кнопка6Нажатие(Элемент)
	
	НажатиеКнопки("6");
	
КонецПроцедуры

Процедура Кнопка7Нажатие(Элемент)
	
	НажатиеКнопки("7");
	
КонецПроцедуры

Процедура Кнопка8Нажатие(Элемент)
	
	НажатиеКнопки("8");
	
КонецПроцедуры

Процедура Кнопка9Нажатие(Элемент)
	
	НажатиеКнопки("9");
	
КонецПроцедуры

Процедура КнопкаЧасВпередНажатие(Элемент)
	
	ИзменитьЧас(1);
	
КонецПроцедуры

Процедура КнопкаЧасНазадНажатие(Элемент)
	
	ИзменитьЧас(-1);
	
КонецПроцедуры

Процедура КнопкаМинутаВпередНажатие(Элемент)
	
	ИзменитьМинуту(1);
	
КонецПроцедуры

Процедура КнопкаМинутаНазадНажатие(Элемент)
	
	ИзменитьМинуту(-1);
	
КонецПроцедуры

Процедура ЗначениеВводаПриИзменении(Элемент)
	
	Закрыть( ЗначениеВвода );
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
