
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Станции.Количество()=0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Станции.Ссылка КАК Станция,
		|	ИСТИНА КАК Действует
		|ИЗ
		|	Справочник.Станции КАК Станции
		|ГДЕ
		|	НЕ Станции.ПометкаУдаления");
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(Станции.Ссылка, ШаблоныАктивностиСтанции.Станция) КАК Станция,
		|	ЕСТЬNULL(ШаблоныАктивностиСтанции.Действует, ИСТИНА) КАК Действует,
		|	ШаблоныАктивностиСтанции.Расписание
		|ИЗ
		|	Справочник.ШаблоныАктивности.Станции КАК ШаблоныАктивностиСтанции
		|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Станции КАК Станции
		|		ПО ШаблоныАктивностиСтанции.Станция = Станции.Ссылка
		|ГДЕ
		|	ЕСТЬNULL(ШаблоныАктивностиСтанции.Ссылка, &Ссылка) = &Ссылка //ИЛИ &Ссылка = Значение(Справочник.ШаблоныАктивности.ПустаяСсылка)");
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	КонецЕсли;
	Объект.Станции.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура УстановитьОбщееРасписаниеНаСервере()
	КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщееРасписание(Команда)
	Расписание = ОткрытьФормуМодально("Справочник.Расписания.ФормаВыбора");
	Для Каждого Т Из Объект.Станции Цикл 
		Т.Расписание = Расписание;
	КонецЦикла;
	УстановитьОбщееРасписаниеНаСервере();
КонецПроцедуры

