
Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Ссылка = ДанныеСтроки.Ссылка;
	
	ОформлениеСтроки.Ячейки.Тип.ОтображатьТекст = Истина;
	ОформлениеСтроки.Ячейки.Тип.Текст = ?(Ссылка.ЭтоКоктейль, "Коктейль", ?(Ссылка.ТолькоВКоктейле, "Только в коктейле", "" ));
	
КонецПроцедуры


Процедура ПриОткрытии()
	
	//УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
КонецПроцедуры

