
Перем ДниНедели;

Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ИнтерфейсАдмина.ЧислоВСписокПометок(ДниНедели, ДанныеСтроки.Привязка);
	
	Стр="";
	Для н=0 По 6 Цикл
		Если ДниНедели[н].Пометка Тогда
			Стр = Стр + ?(Стр="", "", ",") + ДниНедели[н].Значение;
		КонецЕсли;;
	КонецЦикла;
	
	ОформлениеСтроки.Ячейки.Привязка.Текст = Стр;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
КонецПроцедуры

ДниНедели = Новый СписокЗначений;
ДниНедели.Добавить("Пн");
ДниНедели.Добавить("Вт");
ДниНедели.Добавить("Ср");
ДниНедели.Добавить("Чт");
ДниНедели.Добавить("Пт");
ДниНедели.Добавить("Сб");
ДниНедели.Добавить("Вс");
