
&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД = Неопределено Или ТД.Ссылка = ПредопределенноеЗначение("Справочник.ГруппыИнформационныхБаз.ВсеИБ") Тогда
		Состав.Параметры.УстановитьЗначениеПараметра("ТекущаяГруппа", ПредопределенноеЗначение("Справочник.ГруппыИнформационныхБаз.ПустаяСсылка"));
	Иначе
		Состав.Параметры.УстановитьЗначениеПараметра("ТекущаяГруппа",ТД.Ссылка);
	КонецЕсли;
КонецПроцедуры
