
Процедура ОбработкаЗаписиНовогоОбъекта(Объект, Источник)
	
	ЭлементыФормы.СправочникСписок.ТекущаяСтрока = Объект.Ссылка;
	
КонецПроцедуры

Процедура ДействияФормыДействиеПодбор(Кнопка)
	
	Справочники.КлассификаторЕдиницИзмерения.ПолучитьФорму("ФормаПодбораИзКлассификатора", ЭтаФорма, "ФормаПодбораИзКлассификатора").Открыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
	Если ТолькоПросмотр Тогда
		ЭлементыФормы.ДействияФормы.Кнопки.ДействиеПодбор.Доступность = Ложь;
	КонецЕсли; 
	
	Если глВерсия>1 И Константы.ДопЯзыки.Получить() Тогда
		ЭлементыФормы.СправочникСписок.СпособРедактирования = СпособРедактированияСписка.ВДиалоге;
	Иначе
		ЭлементыФормы.СправочникСписок.СпособРедактирования = СпособРедактированияСписка.ВСписке;
	КонецЕсли;

КонецПроцедуры

