Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон("Касса %3 смена %4 от %2 (%1)",
					Число(УбратьВсеБуквы(Данные.Номер)),
					Формат(Данные.Дата, "ДФ='дд.ММ.гг'"),
					Данные.КассаНомер,
					Данные.НомерСмены);
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("КассаНомер");
	Поля.Добавить("НомерСмены");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
