Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		// запишем в ext
		Если не ПроцедурыОбменаДанными.ОпределитьЭтаИнформационнаяБазаФайловая() Тогда
			Коннект = sql.ПодключитьсяКloyality_ext();
			Если Коннект = Неопределено Тогда
				ЗарегистрироватьСобытие("Подключение к базе", УровеньЖурналаРегистрации.Ошибка,,,"ошибка подключения к серверу при записи открытия смены");
				Возврат;
			КонецЕсли;
			
			ТекстЗапроса = "
			| IF not exists( select * from  [Loyality_ext].[dbo].[КассовыеСмены]
			|				where Дата = '&ДатаДок'
			|				and ТТ = &КодТТ
			|				and НомерККМ = &НомерККМ
			|				and НомерСмены = &НомерСмены
			|				and ДатаОткрытия between '&ДатаСмены' and '&ДатаКонСмены')
			//|				and ДатаОткрытия = '&ДатаСмены')
			|begin
			|Insert into [Loyality_ext].[dbo].[КассовыеСмены]
			|			(Дата
			|			,ТТ
			|			,[НомерККМ]
			|			,[ЗаводскойНомерККМ]
			|			,[НомерСмены]
			|			,[ДатаОткрытия]
			|			,[фЗакрыта]
			|			,[ДатаИзменения])
			|Values
			|			('&ДатаДок'
			|			,&КодТТ
			|			,&НомерККМ
			|			,&ЗавНомерККМ
			|			,&НомерСмены
			|			,'&ДатаРеалСмены'
			|			,0
			|			,GetDate())
			|end";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДатаДок",Формат(Дата,"ДФ=yyyyMMdd; ДП=40010101"));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&КодТТ",формат(Касса.Фирма.КодТТ,"ЧН=0; ЧГ=0"));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НомерККМ",Формат(КассаНомер,"ЧН=0; ЧГ=0"));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НомерСмены",Формат(НомерСмены,"ЧН=0; ЧГ=0"));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДатаСмены",Формат(НачалоДня(Дата-86400*2),"ДФ='yyyyMMdd HH:mm:ss'; ДП='40010101 00:00:00'"));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДатаКонСмены",Формат(Дата,"ДФ='yyyyMMdd HH:mm:ss'; ДП='40010101 00:00:00'"));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДатаРеалСмены",Формат(Дата,"ДФ='yyyyMMdd HH:mm:ss'; ДП='40010101 00:00:00'"));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗавНомерККМ",КассаЗаводскойНомер);
			
			Отказ = Ложь;
			ТекстОшибки = "";
			SQL.ВыполнитьЗапрос(Коннект, ТекстЗапроса, Отказ, ТекстОшибки);
			Если Отказ Тогда 
				ЗарегистрироватьСобытие("Запись открытия смены", УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
			КонецЕсли;
			
			Если Не Отказ Тогда
				глПараметрыРМ = глПараметрыРМ;
				Если ТипЗнч(глПараметрыРМ) = Тип("Структура") Тогда
					глПараметрыРМ.Вставить("НомерСмены", НомерСмены);
				КонецЕсли;
			КонецЕсли;
			// для автономной кассы добавим запись в текстовый файл
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Если не Отказ Тогда//и не ПроцедурыОбменаДанными.ОпределитьЭтаИнформационнаяБазаФайловая() Тогда
					Если глПараметрыРМ = Неопределено или НЕ глПараметрыРМ.ККМЕсть Тогда
						Спр = РабочееМесто;
						ИмяФайла = ПолучитьИмяВременногоФайла("txt");
						ЗаписатьОбъектВФайл(ИмяФайла,ЭтотОбъект);
						Профиль = Спр.ПрофильВхода;
						Поз = СтрНайти(Профиль,"\",НаправлениеПоиска.СКонца);
						СтрПуть = Лев(Профиль,Поз-1);
						Наим = Сред(СтрПуть,3);
						Сеть.ПодключитьШару(Наим);
						СтрПуть = СтрПуть + "\";
						Каталог = РегистрыСведений.ДополнительныеСвойства.ЗначениеСвойства(ПараметрыСеанса.ТекущаяИБ, "ПутьДляЛогирования");//Константы.ПутьДляЛогирования.Получить();
						Если Каталог = Неопределено Тогда
							Каталог = Константы.ПутьДляЛогирования.Получить();
						КонецЕсли;
						СтрПуть = СтрПуть + СтрЗаменить(Каталог,":","$");
						СтрПуть = ?(Прав(СтрПуть,1) = "\",СтрПуть,СтрПуть + "\");
						СтрПуть = СтрПуть + Формат(ТекущаяДата(),"ДФ=yyyyMMdd") + "\";
						ИмяфайлаПолучателя = СтрПуть + "ОткрытиеКассовойСмены_" + Наим + ".txt";
						Попытка
							КопироватьФайл(ИмяФайла,ИмяфайлаПолучателя);
						Исключение
							ЗарегистрироватьСобытие("Ошибка записи файла открытия смены кассы",УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект,,"Ошибка доступа до " + Профиль);
						КонецПопытки;
						ИмяФайла = ПолучитьИмяВременногоФайла("txt");
						ЗаписатьОбъектВФайл(ИмяФайла,ЭтотОбъект.СменаТТ.ПолучитьОбъект());
						ИмяфайлаПолучателя = СтрПуть + "ОткрытиеСмены_" + Наим + ".txt";
						Попытка
							КопироватьФайл(ИмяФайла,ИмяфайлаПолучателя);
						Исключение
							ЗарегистрироватьСобытие("Ошибка записи файла открытия смены",УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект,,"Ошибка доступа до " + Профиль);
						КонецПопытки;
					Иначе
						Каталог = РегистрыСведений.ДополнительныеСвойства.ЗначениеСвойства(ПараметрыСеанса.ТекущаяИБ, "ПутьДляЛогирования");//Константы.ПутьДляЛогирования.Получить();
						Если Каталог = Неопределено Тогда
							Каталог = Константы.ПутьДляЛогирования.Получить();
						КонецЕсли;
						Профиль = РабочееМесто.ПрофильВхода;
						Поз = СтрНайти(Профиль,"\",НаправлениеПоиска.СКонца);
						Наим = Сред(Лев(Профиль,поз - 1),3);
						ИмяФайла = ?(Прав(Каталог,1) = "\",Каталог,Каталог + "\") + Формат(ТекущаяДата(),"ДФ=yyyyMMdd") + "\" + "ОткрытиеКассовойСмены_" + Наим + ".txt";
						ЗаписатьОбъектВФайл(ИмяФайла,ЭтотОбъект);
						ИмяФайла = ?(Прав(Каталог,1) = "\",Каталог,Каталог + "\") + Формат(ТекущаяДата(),"ДФ=yyyyMMdd") + "\" + "ОткрытиеСмены_" + Наим + ".txt";
						ЗаписатьОбъектВФайл(ИмяФайла,ЭтотОбъект.СменаТТ.ПолучитьОбъект());
					КонецЕсли;		
				КонецЕсли;
			#КонецЕсли
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

