
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ЭлементыФормы.тПол			.Заголовок = Клиент.Пол;
	ЭлементыФормы.тДатаРождения	.Заголовок = Формат(Клиент.ДатаРождения,"ДЛФ=Д");
	ЭлементыФормы.тДопИнформация.Заголовок = Клиент.ДопИнформация;
	
	Если НЕ Клиент.Фото.Пустая() Тогда
		ЭлементыФормы.Фото.Картинка = Клиент.Фото.Хранилище.Получить();
	КонецЕсли; 
	
	Если глВерсия=3 Тогда
		СтрКатегории = "";
		Для каждого СтрокаКатегорий Из Клиент.ПринадлежностьКатегориям Цикл
			СтрКатегории = СтрКатегории + ?(СтрКатегории="","",", ") + СтрокаКатегорий.Категория;
		КонецЦикла;  
		ЭлементыФормы.тСтрКатегории.Заголовок = ?(СтрКатегории="", "Нет категорий", СтрКатегории);
		
		
	Иначе
		ЭлементыФормы.НадписьПринадлежитКатегориям.Видимость = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаОКНажатие(Элемент)
	
	Закрыть("ОК");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
