
Перем ПараметрыОкна Экспорт;	// Структура, определяет положение и размеры окна.

////////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ

// Вызывается из модуля обработки после вывода кнопок
//
Процедура УстановитьВидимостьСтрелок(НужнаСтрелкаВверх, НужнаСтрелкаВниз) Экспорт
	Попытка
		// показываем только доступные направления листания
		глОбработки.ГлавнаяФорма.ГлавнаяФорма.ЭлементыФормы.КнопкаСтрелкаВверх.Видимость = НужнаСтрелкаВверх;
		глОбработки.ГлавнаяФорма.ГлавнаяФорма.ЭлементыФормы.КнопкаСтрелкаВниз .Видимость = НужнаСтрелкаВниз;
	Исключение
	КонецПопытки;
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ=ложь, СтандартнаяОбработка=истина) Экспорт
	Если ПараметрыОкна = Неопределено Тогда
		КнопкиДействияПередОткрытием(ЭтаФорма);	
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриОткрытии() Экспорт
	
	//Если глВерсия=1 ИЛИ ВызовИзСтопЛиста Тогда
	//	ЭлементыФормы.КнопкаСтопЛист.Видимость = Ложь;
	//КонецЕсли; 
	
	Если РежимНастройки Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОкна <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	глПараметрыРМ = глПараметрыРМ;
	глПараметрыРМ = ?(глПараметрыРМ = Неопределено, Новый Структура, глПараметрыРМ);
	
	Если глПараметрыРМ.Свойство("ИмяСтиля") Тогда
		Стиль = БиблиотекаСтилей[глПараметрыРМ.ИмяСтиля];
	Иначе
		Стиль = БиблиотекаСтилей.СтанцияОплаты;
	КонецЕсли;

	
	ПараметрыОкна = ПолучитьПараметрыОкна();
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии() Экспорт
	
	Если РежимНастройки Тогда
		Если ПараметрыНастройки.РучнаяНастройкаПривязок Тогда
			ВладелецФормы.НастройкаДеревоКаталога = ДеревоКаталога;
		КонецЕсли; 
		
	Иначе
		ВладелецФормы.ПриЗакрытииМеню();	// это обязательно сначала
		ИнтерфейсРМ.ПриЗакрытииОкна();
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Назначается динамически
//
Процедура КнопкаТовараНажатие(Элемент)
	
	ОбработкаНажатияКнопки(Элемент);
	
КонецПроцедуры
 
// Назначается динамически
//
Процедура КнопкаСтопЛистНажатие(Элемент)
	
	Если РежимНастройки Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
	СтопЛист = ИнтерфейсРМ.ПолучитьОбъектОбработки("СтопЛист").ПолучитьФорму("Форма" + глПараметрыРМ.ИнтерфейсТип);
	СтопЛист.ВызовИзМеню = Истина;
	СтопЛист.Открыть();
	
КонецПроцедуры

Процедура КнопкаСтрелкаВверхНажатие(Элемент)
	
	Пролистать(-1);
	
КонецПроцедуры

Процедура КнопкаСтрелкаВнизНажатие(Элемент)
	
	Пролистать(1);
	
КонецПроцедуры

Процедура КнопкаПодсказкаНажатие(Элемент)
	
	Если РежимНастройки Тогда
		Возврат;
	КонецЕсли;
	
	РежимПодсказки = НЕ РежимПодсказки;
	
	Заголовок = ?(РежимПодсказки, "Режим подсказки", "Меню");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ
