////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события ПередОткрытием формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Обработчик события ПриОткрытии Формы.
//
Процедура ПриОткрытии()
	ОбновитьГиперссылкуРодительСправочника(ЭтаФорма);
КонецПроцедуры

// Обработчик события ОбработкаВыбора формы.
//
Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	
	ВыборРодителя(ЭтотОбъект, ЭтаФорма, ЗначениеВыбора);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНОЙ ПАНЕЛИ ДЕЙСТВИЯФОРМЫ

// Обработчик нажатия на гиуперссылку "Родитель".
//
Процедура ГиперссылкаРодительНажатие(Элемент)
	
	НажатиеГиперссылкиРодительСправочника(ЭтотОбъект, ЭтаФорма);
	
КонецПроцедуры 
