Процедура ДействияФормыКратко(Кнопка)
	Форма =  ПолучитьФорму("ФормаНастройки", ЭтаФорма);
	Форма.ОткрытьМодально();
КонецПроцедуры

// Обработчик формирования отчета
//
Процедура ДействияФормыСформировать(Кнопка) 
	
	СформироватьОтчет(ЭлементыФормы.Результат,ЭлементыФормы);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если Не ЗначениеЗаполнено(ВариантФормирования) Тогда
		ВариантФормирования = "АвторЗаказано";
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ДатаС) И Не ЗначениеЗаполнено(ДатаПо) И Не ЗначениеЗаполнено(МассивСмен) Тогда 
		ДатаС = НачалоКвартала(ТекущаяДата());
		ДатаПо = ТекущаяДата();
		Период = ПредставлениеПериода(ДатаС,ДатаПо);
	КонецЕсли;	
	
КонецПроцедуры

Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормированиеОтчетов.РасшифровкаОтчетов(ЭтотОбъект, Расшифровка);
	
КонецПроцедуры


Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ФормированиеОтчетов.ПередОткрытиемОтчета(ЭтаФорма);	
	//Если Не Константы.ПодтверждениеГотовности.Получить() Тогда
	Если Не Константы.РаботаСПодтверждениямиПозицийЗаказа.Получить() Тогда
		Сообщить("Построение отчета не возможно. Данные подтверждения готовности блюд не учитываются.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура КоманднаяПанельФормыБыстрыеОтборы(Элемент)
	ФормированиеОтчетов.УправлениеОтображениемЭлементовФормы(ЭтаФорма,Элемент);
КонецПроцедуры

Процедура КнопкаПериодаНажатие(Элемент)
	
	ФормированиеОтчетов.КнопкаПериодНажатие(ЭтотОбъект);
	
КонецПроцедуры

Процедура КнопкаСменыНажатие(Элемент)

	ФормированиеОтчетов.КнопкаСменаНажатие(ЭтотОбъект);
	
КонецПроцедуры

