Функция ЗначениеСвойства(Знач Объект, Знач Свойство) Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДополнительныеСвойства.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСвойства КАК ДополнительныеСвойства
	|ГДЕ
	|	ДополнительныеСвойства.Объект = &Объект
	|	И ДополнительныеСвойства.Свойство = &Свойство");	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Рез.Выгрузить()[0][0];
	КонецЕсли;
КонецФункции
