
Процедура ПередЗаписью(Отказ, Замещение)
	ОД = ОбменДанными;
	ЕСли ОД.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Всем = Ложь;
	ТекИБ = ПараметрыСеанса.ТекущаяИБ;
	Получатели = Новый Массив;
	
	Для Каждого Т Из ЭтотОбъект Цикл
		Если Т.ИнформационнаяБаза = ТекИБ Тогда
			Продолжить;
		КонецЕсли;
		Если Т.ИнформационнаяБаза.Пустая() Тогда
			Всем = Истина;
		Иначе
			ИБ = ПланыОбмена.Основной.НайтиПоРеквизиту("ИнформационнаяБаза", Т.ИнформационнаяБаза);
			Получатели.Добавить(ИБ);
		КонецЕсли;
	КонецЦикла;
	
	Если Не Всем Тогда
		ОД.Получатели.Очистить();
		Для Каждого Т Из Получатели Цикл
			ОД.Получатели.Добавить(Т);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
