
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОтправитьВЛояльность(ПараметрКоманды);
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.Заказ.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Процедура ОтправитьВЛояльность(Знач МассивЗаказов)
	Если ТипЗнч(МассивЗаказов) <> Тип("Массив") И не ТипЗнч(МассивЗаказов) <> Тип("ФиксированныйМассив") Тогда
		МассивЗаказов = Массив(МассивЗаказов);
	КонецЕсли;
	
	Для Каждого ДокументСсылка Из МассивЗаказов Цикл
		ОтправитьДокументВлояльность(ДокументСсылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьДокументВлояльность(Знач ДокументСсылка)
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Заказ") Тогда
		Лояльность.ЗаписатьВСПУЛ(ДокументСсылка);	
	ИначеЕсли  ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Возврат") Тогда
		НЗ = РегистрыСведений.ВозвратДопИнф.СоздатьМенеджерЗаписи();
		НЗ.Возврат = ДокументСсылка;
		НЗ.Прочитать();
		
		Если ЗначениеЗаполнено(НЗ.ПротоколРасчетов) Тогда
			Лояльность.ЗаписатьВСПУЛ(ДокументСсылка, НЗ.ПротоколРасчетов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры