
Процедура СоздатьЗапись(Знач РабочееМесто = Неопределено, Знач ИдСобытия = "", Знач Дата = Неопределено, Знач ТипСобытия = Неопределено, Знач Описание = "", Знач Получатель = Неопределено) Экспорт
	
	Если РабочееМесто = Неопределено Тогда
		РабочееМесто = ПредопределенноеЗначение("Справочник.РабочиеМеста.ПустаяСсылка");
	КонецЕсли;
	Если ИдСобытия = "" Тогда
		ИдСобытия = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	Если Дата = Неопределено Тогда
#Если ТолстыйКлиентОбычноеПриложение Тогда
		Дата = ТекущаяДатаНаСервере();
#Иначе      	
		Дата = ТекущаяДатаСеанса();
#КонецЕсли
	КонецЕсли; 
	Если ТипСобытия = Неопределено Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Сообщение");
	КонецЕсли; 
	Если Получатель = Неопределено Тогда
		Получатель = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	КонецЕсли;
	
	ОбработкаСобытийЗапись = РегистрыСведений.ОбработкаСобытий.СоздатьМенеджерЗаписи();
	ОбработкаСобытийЗапись.Период			= Дата;
	ОбработкаСобытийЗапись.РабочееМесто		= РабочееМесто;
	ОбработкаСобытийЗапись.ИдСобытия		= ИдСобытия;
	ОбработкаСобытийЗапись.ТипСобытия		= ТипСобытия;
	ОбработкаСобытийЗапись.Описание			= Описание;
	ОбработкаСобытийЗапись.Получатель		= Получатель;
	ОбработкаСобытийЗапись.Записать();
	
КонецПроцедуры
