
////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ

Процедура ВыборТипаКнопки()
	
	Если ТипКнопки=1 Тогда
		
		ЭлементыФормы.РамкаПривязка.Заголовок	= "Наименование";
		ЭлементыФормы.РамкаОбразец.Заголовок	= "Образец, выбор картинки";
		ЭлементыФормы.Товар.Видимость			= Ложь;
		ЭлементыФормы.Наименование.Видимость	= Истина;
		
	Иначе
		ЭлементыФормы.РамкаПривязка.Заголовок	= "Привязка";
		ЭлементыФормы.РамкаОбразец.Заголовок	= "Образец";
		ЭлементыФормы.Товар.Видимость			= Истина;
		ЭлементыФормы.Наименование.Видимость	= Ложь;
				
	КонецЕсли;
	
	ЭлементыФормы.ДобавлятьВсе.Видимость = ТипКнопки<>3;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	Если ТипКнопки = 0 Тогда
		ТипКнопки = 3;
	КонецЕсли; 
	
	ВыборТипаКнопки();
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	Кнопка = ЭлементыФормы.КнопкаОбразец;
	
	Кнопка.МногострочныйРежим = Истина;
	Кнопка.Высота = ПараметрыНастройки.ВысотаКнопки;
	Кнопка.Ширина = ПараметрыНастройки.ШиринаКнопки;
	
	Если ПараметрыНастройки.КнопкиВыводКартинки Тогда
		КартинкаКнопки = Картинка;
		Если ЗначениеЗаполнено(КартинкаКнопки) Тогда
			Кнопка.Картинка = КартинкаКнопки.Хранилище.Получить();
		ИначеЕсли ТипКнопки = 3 Тогда
			Кнопка.Картинка = БиблиотекаКартинок.КаталогЭлемент;
		Иначе
			Кнопка.Картинка = БиблиотекаКартинок.КаталогГруппа;
		КонецЕсли; 
		
		Кнопка.РазмерКартинки = ПараметрыНастройки.КнопкиРазмерКартинки;
		
	КонецЕсли;
	
	Кнопка.ЦветФонаКнопки = ?(ЦветФона.Вид = ВидЦвета.АвтоЦвет, ПараметрыНастройки.ЦветФонаКнопки, ЦветФона);
	
	Если ПараметрыНастройки.КнопкиВыводТекста Тогда
		Кнопка.Заголовок		= ?(ТипКнопки=1, Наименование, СокрЛП(Товар.descr));
		Кнопка.ЦветТекстаКнопки = ?(ЦветТекста.Вид = ВидЦвета.АвтоЦвет,	ПараметрыНастройки.ЦветТекстаКнопки,	ЦветТекста);
		Кнопка.Шрифт			= ?(Шрифт.Вид = ВидШрифта.АвтоШрифт,	ПараметрыНастройки.ШрифтКнопки,			Шрифт);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаВыбора(ЗначениеВыбора, Истоник)
	
	Если ТипЗнч(ЗначениеВыбора) = Тип("СправочникСсылка.ХранилищеДополнительнойИнформации") Тогда
		Картинка = ЗначениеВыбора;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ТипКнопкиПриИзменении(Элемент)
	
	ВыборТипаКнопки();
	
КонецПроцедуры

Процедура КнопкаОбразецНажатие(Элемент)
	
	Если ПараметрыНастройки.КнопкиВыводКартинки И ТипКнопки=1 Тогда
		ХранилищеДополнительнойИнформации.ОткрытьФормуИзображения(ЭтаФорма, Картинка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Если ТипКнопки=1 И ПустаяСтрока(Наименование) Тогда
		Предупреждение("Укажите наименование!");
		Возврат;
	ИначеЕсли ТипКнопки<>1 И Товар.Пустая() Тогда
		Предупреждение("Укажите привязку!");
		Возврат;
	КонецЕсли;
	
	Закрыть("ОК");
	
КонецПроцедуры

Процедура ТоварНачалоВыбора(Элемент, СтандартнаяОбработка)
	Товар = ПолучитьОбщуюФорму("СписокТоваровСУП").ОткрытьМодально();
	Наименование = СокрЛП(Товар.descr);
КонецПроцедуры

Процедура ТоварАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
