Процедура ЗагрузитьВесы(ФлагОчисткиВесов,СпВесы,Товары) Экспорт
	
	Для каждого эл из СпВесы Цикл
		Попытка
			ПодключитьВнешнююКомпоненту("AddIn.LP8");
			Весы = Новый("AddIn.LP8");
		Исключение
			Сообщить("Не загружен драйвер");
			ВызватьИсключение "Не загружен драйвер";
			Прервать;
		КонецПопытки;
		
		Весы.ДобавитьУстройство();
		Если Весы.Результат = 0 Тогда
			Весы.НомерПорта = 99;
			Весы.Модель = 23;
			Весы.ПортIP = СокрЛП(Эл.ИПВесов) + ":5002";
			Весы.УстройствоВключено = 1;
			Если Весы.Результат <> 0 Тогда
				Продолжить;
				//ВызватьИсключение "Ошибка подключения весов";
				//Прервать;
			КонецЕсли;
		Иначе
			Продолжить;
			//ВызватьИсключение "Ошибка добаления Логического устройства";
			//Прервать;
		КонецЕсли;
		НомерУстройства = Весы.НомерТекущегоУстройства;
		
		Если ФлагОчисткиВесов = 1 Тогда
			Весы.Очистить();
		КонецЕсли;
		Если Товары.Количество() <> 0 Тогда
			Весы.НачатьДобавление();
			Для каждого стр из Товары Цикл
				Весы.ПЛУ = Число(Стр.PLU);
				Весы.ИКод = Число(Стр.Код);
				Весы.Цена = Число(Стр.Цена);
				Весы.Наименование = СокрЛП(Стр.Наименование);
				Весы.ТипШК = 150;
				Весы.ПрямоеТекстовоеСообщение = СокрЛП(Стр.Состав);
				Весы.УстановитьЗапись();
			КонецЦикла;
			Весы.ЗакончитьДобавление();
		КонецЕсли;
		Весы.НомерТекущегоУстройства = НомерУстройства;
		Весы.УстройствоВключено = 0;
		Весы.УдалитьУстройство();
	КонецЦикла;
КонецПроцедуры

Функция ПроверкаСвязи(ИПВесы) Экспорт
	СтруктураВозврата = Новый Структура("Ошибка,ТекстОшибки",ложь,"");
	Попытка
		ПодключитьВнешнююКомпоненту("AddIn.LP8");
		Весы = Новый("AddIn.LP8");
	Исключение
		СтруктураВозврата.ошибка = Истина;
		СтруктураВозврата.ТекстОшибки = "Не загружен драйвер";
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	Весы.ДобавитьУстройство();
	Если Весы.Результат = 0 Тогда
		Весы.НомерПорта = 99;
		Весы.Модель = 23;
		Весы.ПортIP = СокрЛП(ИПВесы) + ":5002";
		Весы.УстройствоВключено = 1;
		Если Весы.Результат <> 0 Тогда
			СтруктураВозврата.ошибка = Истина;
			СтруктураВозврата.ТекстОшибки = "Нет связи";
			Возврат СтруктураВозврата;
		КонецЕсли;
	Иначе
		СтруктураВозврата.ошибка = Истина;
		СтруктураВозврата.ТекстОшибки = "Ошибка добавления устройства";
		Возврат СтруктураВозврата;
	КонецЕсли;
	Возврат СтруктураВозврата;
КонецФункции