
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна
Перем СписокСмен;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
		
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры
 
Процедура ПриОткрытии()
Запрос = Новый Запрос("ВЫБРАТЬ  Первые 10
	|	ЛОЖЬ КАК Пометка,
	|	ОткрытиеСмены.МестоРеализации КАК МестоРеализации,
	|	ОткрытиеСмены.Номер КАК Номер,
	|	ОткрытиеСмены.Дата КАК Открыта,
	|	ЗакрытиеСмены.Дата КАК Закрыта,
	|	ОткрытиеСмены.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОткрытиеСмены КАК ОткрытиеСмены
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|		ПО ОткрытиеСмены.Ссылка = ЗакрытиеСмены.Смена
	|ГДЕ
	|	ОткрытиеСмены.ПометкаУдаления = ЛОЖЬ
	|	И ОткрытиеСмены.Дата > &ДатаС
	|	И ОткрытиеСмены.Дата < &ДатаПо
	|	И ЗакрытиеСмены.Дата ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Открыта УБЫВ");
	
	Запрос.УстановитьПараметр("ДатаС",ДобавитьМесяц(ТекущаяДата(),-2));
	Запрос.УстановитьПараметр("ДатаПо",НачалоДня(ТекущаяДата())-1);
	тзСмены = Запрос.Выполнить().Выгрузить();
	СписокСмен = Новый СписокЗначений;
	СписокСмен.ЗагрузитьЗначения(тзСмены.ВыгрузитьКолонку("Ссылка"));
	
	ПодключитьОбработчикОжидания("ВыбратьСмену",0.1,1);	
	
КонецПроцедуры

Процедура ВыбратьСмену() Экспорт
	
		элСмена = ВыбратьИзМеню(СписокСмен, ЭлементыФормы.КнопкаОК);
	Если элСмена = Неопределено Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	ТекСмена = элСмена.Значение;
	глПараметрыРМ = Новый Структура("МестоРеализации", ТекСмена.МестоРеализации);
	
	ДокОткрытияСмены = ТекСмена.ПолучитьОбъект();
	
	ЭлементыФормы.тЗаголовок		.Заголовок = "Закрытие смены № "+ДокОткрытияСмены.Номер;
	ЭлементыФормы.тДатаОткрытия		.Заголовок = "Время открытия: "+ДокОткрытияСмены.Дата;
	ЭлементыФормы.тМестоРеализации	.Заголовок = глПараметрыРМ.МестоРеализации.Наименование;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаОКНажатие(Элемент)
	
	Попытка
		ЗакрытьСмену();	
	Исключение
		ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке());
		ВыбратьСмену();
	КонецПопытки;
	
	
	Если ЭтаФорма.Открыта() Тогда
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры


