Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна
Перем Список;    
Перем КоличествоСтрок Экспорт;
Перем Отчет Экспорт;
Перем ТаблицаЗадания Экспорт, Заг1 Экспорт, Заг2 Экспорт, Шапка Экспорт;
Перем Текст Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);			
	
	//КоличествоСтрок = СтрЧислоСтрок(Текст);
	//
	//Для Инд = 1 По Цел(КоличествоСтрок/50)+1 Цикл
	//	ТекТекст = "";
	//	Для НС = 1 По 50 Цикл
	//		ТекТекст = ТекТекст + ?(ТекТекст="","",Символы.ПС) + " " + СтрПолучитьСтроку(Текст, (Инд-1)*50+НС)
	//	КонецЦикла;                 
	//	ЭтаФорма["Текст"+Инд] = ТекТекст;
	//КонецЦикла;
	//Если Не ЗначениеЗаполнено(Текст2) Тогда
	//	Текст2 = Текст1;
	//	Текст1 = "";
	//КонецЕсли;
	
	ЭлементыФормы.ПолеТекстовогоДокумента1.УстановитьТекст(Текст);
	Панель.ТекущаяСтраница = Панель.Страницы.Страница2;
	
	ОткорректироватьРазмеры();	
КонецПроцедуры

Процедура ПечатьНажатие(Элемент)
	ФормированиеОтчетов.ПечатьОтчетаРМ(ТаблицаЗадания, Заг1, Заг2, Шапка, Истина);	
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ МОДУЛЯ

Процедура ОткорректироватьРазмеры()
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
