Перем МассивВопросов Экспорт;
Перем МетодОбработчика;
Перем КодВопроса;
Перем Ответ;

Процедура ПриОткрытии()
	ЭтотОбъект.Форма = ФОрма;
	Форма = ЭтаФорма;
	СледующийВопрос();
КонецПроцедуры

Процедура СледующийВопрос() Экспорт
	Если ЗначениеЗаполнено(КодВопроса) Тогда
		РезультатТестирования.Вставить(КодВопроса, Ответ);
	КонецЕсли;
	
	Если Не КодВопроса = Неопределено Тогда
		ТекИнд = МассивВопросов.Найти(КодВопроса + "|" + ТекстВопроса);             
	Иначе
		ТекИнд = Неопределено;
	КонецЕсли;
	
	Если ТекИнд = Неопределено Тогда
		ТекстВопроса = МассивВопросов[0];
	ИначеЕсли ТекИнд + 1 <= МассивВопросов.ВГраница() Тогда
		ТекстВопроса = МассивВопросов[ТекИнд + 1];
	Иначе
		ЗакончитьТестирование();
	КонецЕсли;
	КодВопроса = Лев(ТекстВопроса, 9);
	ТекстВопроса = Сред(ТекстВопроса,11);
	
	ЕстьВопрос = СтрНайти(ТекстВопроса, "?");
	УстановитьВидимостьКнопок(ЕстьВопрос, СтрНайти(ТекстВопроса, "Сканируйте"));
	
	Если Не ЕстьВопрос Тогда
		МетодОбработчика = ТекстВопроса;
		МетодОбработчика = СтрЗаменить(МетодОбработчика, " ", "");
		МетодОбработчика = СтрЗаменить(МетодОбработчика, ".", "");
		МетодОбработчика = СтрЗаменить(МетодОбработчика, "»", "");
		МетодОбработчика = СтрЗаменить(МетодОбработчика, "«", "");
		МетодОбработчика = СтрЗаменить(МетодОбработчика, "3", "");
		МетодОбработчика = СтрЗаменить(МетодОбработчика, "4", "");
		МетодОбработчика = СтрЗаменить(МетодОбработчика, "5", "");
		МетодОбработчика = СтрЗаменить(МетодОбработчика, "6", "");
		МетодОбработчика = СтрЗаменить(МетодОбработчика, "7", "");
		МетодОбработчика = СтрЗаменить(МетодОбработчика, "8", "");
		МетодОбработчика = СтрЗаменить(МетодОбработчика, "9", "");
		ПодключитьОбработчикОжидания(МетодОбработчика, 2, Истина);
	КонецЕсли;
	
	Если СтрНайти(ТекстВопроса, "Сбербанк") Тогда
		Обработка = Обработки.ОтчетыККМ.Создать();
		Если Обработка.ОтчетСбербанк() Тогда
		Иначе
			КнопкаНет();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗакончитьТестирование()
	
	//:РезультатТестирования = Новый Соответствие;
	РезультатТестирования.Вставить("000000067", ЛояльностьКлиент.ЛояльностьРаботает());
	Если глПараметрыРМ.МестоРеализации = Справочники.МестаРеализации.Отдохни Тогда
		РезультатТестирования.Вставить("000000097", ЗначениеЗаполнено(глОбработки.ГлавнаяФорма.Заказ.ДатаРождения));
    КонецЕсли;
	Закрыть();
	глОжидание.Начало("Пожалуйста, подождите...", "Выполняется отправка результатов тестирования");
	
	Соединитель = Новый COMObject("V83.COMConnector");
	СтрокаСоединения = СтрШаблон("Srvr=""%1"";Ref=""sup_kkm"";Usr=""Обмен"";Pwd=""123""", "10.1.0.49");
	Соединение = Соединитель.Connect(СтрокаСоединения);	
	Соединение.ЗарегистрироватьРезультатТестирования(ПланыОбмена.Основной.ЭтотУзел().ИнформационнаяБаза.Код, глРабочееМесто.ПрофильВхода, ЗначениеВСтрокуВнутр(РезультатТестирования));
	Соединение = Неопределено;
	Соединитель = Неопределено;
	
	глОжидание.Конец();
	ИнтерфейсРМ.ВопросПредупреждение("Тестирование", "Тестирование закончено", "Спасибо.
	|Сейчас запуститься кассовая программа",,"ОК",,,,10);
	ЗапуститьПриложение("d:\cash50\c.bat",, Ложь);
	КомандаСистемы("taskkill /im 1cv8.exe /f");
	ПрекратитьРаботуСистемы();
КонецПроцедуры

Процедура УстановитьВидимостьКнопок(ВидимостьКнопок, ВидимостьШК = Ложь)
	ЭлементыФормы.Да.Видимость = ВидимостьКнопок;
	ЭлементыФормы.ПодписьДа.Видимость = ВидимостьКнопок;
	ЭлементыФормы.Нет.Видимость = ВидимостьКнопок;
	ЭлементыФормы.ПодписьНет.Видимость = ВидимостьКнопок;
	ЭлементыФормы.ШК.Видимость = ВидимостьШК;	
КонецПроцедуры

Процедура КнопкаДа() Экспорт
	Ответ = Истина;
	СледующийВопрос();
КонецПроцедуры

Процедура КнопкаНет() Экспорт
	Ответ = Ложь;
	СледующийВопрос();
КонецПроцедуры

// проверка: добавлен ШК 001
Процедура СканируйтеШКсЭкрана() Экспорт
	Заказ = глОбработки.ГлавнаяФорма.Заказ;
	ЕстьИтогПоКарте = Заказ.Товары.Найти("001") <> Неопределено;
	
	Если ЕстьИтогПоКарте Тогда
		Ответ = Истина;
		СледующийВопрос();
	Иначе
		ПодключитьОбработчикОжидания(МетодОбработчика, 1, Истина);
	КонецЕсли;
КонецПроцедуры

// проверка: добавлен товар, в наименовании которого есть "Пакет"
Процедура ДобавьтеТоварПакет() Экспорт
	Заказ = глОбработки.ГлавнаяФорма.Заказ;
	ЕстьПакет = Ложь;
	Для Каждого Т Из Заказ.Товары Цикл
		Если СтрНайти(ВРег(Т.Товар), "ПАКЕТ") Тогда
			ЕстьПакет = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьПакет Тогда
		Ответ = Истина;
		СледующийВопрос();
	Иначе
		ПодключитьОбработчикОжидания(МетодОбработчика, 1, Истина);
	КонецЕсли;
КонецПроцедуры

// проверка: добавлен товар с ПДФ
Процедура ВыполнитеСканированиеЛюбогоАлкоголя() Экспорт
	Заказ = глОбработки.ГлавнаяФорма.Заказ;
	ЕстьВино = Ложь;
	Для Каждого Т Из Заказ.Товары Цикл
		Если ЗначениеЗаполнено(Т.ПДФ) Тогда
			ЕстьВино = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьВино Тогда
		Ответ = Истина;
		СледующийВопрос();
	Иначе
		ПодключитьОбработчикОжидания(МетодОбработчика, 1, Истина);
	КонецЕсли;
КонецПроцедуры

// проверка: карта применена. В окне лояльности есть кнопки начислить и списать
Процедура СчитайтеКартуЛояльности() Экспорт
	Заказ = глОбработки.ГлавнаяФорма.Заказ;
		
	Если ЗначениеЗаполнено(Заказ.НомерКартыЛояльности) Тогда
		Ответ = Истина;
		СледующийВопрос();
	Иначе
		ПодключитьОбработчикОжидания(МетодОбработчика, 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодписьНетНажатие(Элемент)
	Нет();
КонецПроцедуры

Процедура ПодписьДаНажатие(Элемент)
	//Да();
КонецПроцедуры

фОтдохни = глПараметрыРМ.МестоРеализации = Справочники.МестаРеализации.Отдохни;
Если фОтдохни Тогда
	МассивВопросов = Массив(
	"000000041|Интерфейс кассы отображается?",
	"000000046|На дисплее покупателя есть текст?",
	"000000043|Добавьте товар «Пакет»",
	"000000044|Выполните сканирование любого алкоголя", 
	"000000045|Считайте карту лояльности",
	"000000047|Отчет по Сбербанку напечатан на принтере?"
	);
Иначе 
	МассивВопросов = Массив(
	"000000041|Интерфейс кассы отображается?",
	"000000046|На дисплее покупателя есть текст?",
	"000000043|Добавьте товар «Пакет»",
	"000000045|Считайте карту лояльности",
	"000000047|Отчет по Сбербанку напечатан на принтере?"
	);	
КонецЕсли;
//:МассивВопросов = Новый Массив;
//:РезультатТестирования = Новый Соответствие;