
Процедура ПриОткрытии()
	
	Если ЗапретСдвига Тогда
		ЭлементыФормы.КоманднаяПанель.Кнопки.ПереместитьВверх.Доступность = Ложь;
		ЭлементыФормы.КоманднаяПанель.Кнопки.ПереместитьВниз.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Закрыть(СписокРеквизитов);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Закрыть(СписокРеквизитов);
	
КонецПроцедуры

Процедура КоманднаяПанельУстановитьФлажки(Кнопка)
	
	СписокРеквизитов.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

Процедура КоманднаяПанельСнятьФлажки(Кнопка)
	
	СписокРеквизитов.ЗаполнитьПометки(Ложь);
	
КонецПроцедуры

Процедура КоманднаяПанельПереместитьВверх(Кнопка)
	
	ТекСтрока = ЭлементыФормы.ПолеСпискаРеквизитов.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено И СписокРеквизитов.Индекс(ТекСтрока) <> 0 Тогда
		
		СписокРеквизитов.Сдвинуть(ТекСтрока, -1);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанельПереместитьВниз(Кнопка)
	
	ТекСтрока = ЭлементыФормы.ПолеСпискаРеквизитов.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено  И СписокРеквизитов.Индекс(ТекСтрока) <> (СписокРеквизитов.Количество() - 1)Тогда
		
		СписокРеквизитов.Сдвинуть(ТекСтрока, 1);
		
	КонецЕсли;
	
КонецПроцедуры


