
&НаСервере
Процедура УдалитьВсеНаСервере()
	Лояльность.УдалитьДанныеЛояльностиПоЗаказу();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	УдалитьВсеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заказ = Неопределено;
	Протокол = Неопределено;
	Параметры.Свойство("Заказ", Заказ);
	УстановитьПараметрыОтбораСписка(Заказ, Протокол);
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОтбораСписка(ДокументСсылка, Протокол)
	ОтборыСписка = Список.Отбор.Элементы;
	ОтборыСписка.Очистить();
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		НовыйОтбор = ОтборыСписка.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Документ");
		НовыйОтбор.Использование = Истина;
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйОтбор.ПравоеЗначение = ДокументСсылка;
	КонецЕсли;
	
КонецПроцедуры
