
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ИнформационныеБазы") Тогда
		ИБ = ПараметрКоманды;
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.РабочиеМеста") Тогда
		//:ПараметрКоманды = Справочники.РабочиеМеста.ПустаяСсылка();
		ИБ = ПараметрКоманды.ИнформационнаяБаза;
	КонецЕсли;
	
	Хост = СтрЗаменить(ИБ.СерверХост, "-serv", "-ost");
	Сеть.ЗапуститьDameWare(Хост);
КонецПроцедуры
