&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.ФильтрИБ.Количество() Тогда
		Нов = Объект.ФильтрИБ.Добавить();
		Нов.Атрибут = "ТолькоМяснов";
		Нов.ВидСравнения = "Равно";
		Нов.Значение = Ложь;
	КонецЕсли;
	
	Если Не Объект.ФильтрРМ.Количество() Тогда
		Нов = Объект.ФильтрРМ.Добавить();
		Нов.Атрибут = "Наименование";
		Нов.ВидСравнения = "Содержит";
		Нов.Значение = "TPX";
		Нов = Объект.ФильтрРМ.Добавить();
		Нов.Атрибут = "Наименование";
		Нов.ВидСравнения = "Не содержит";
		Нов.Значение = "TPX";
	КонецЕсли;

	Для Каждого Т Из Метаданные.Справочники.ИнформационныеБазы.Реквизиты Цикл
		Элементы.ФильтрИБАтрибут.СписокВыбора.Добавить(Т.Имя);	
	КонецЦикла;
	
	Для Каждого Т Из Метаданные.Справочники.РабочиеМеста.Реквизиты Цикл
		Элементы.ФильтрРМАтрибут.СписокВыбора.Добавить(Т.Имя);	
	КонецЦикла;
	
КонецПроцедуры