
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПовара(Команда)
	ОткрытьФорму("Документ.ТТКдляПовара.Форма.ФормаДокументаПовара",Новый Структура("Ключ", Объект.Ссылка));
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ВложенияТП = ВложенияТП;
	ВложенияО  = ВложенияО;
	ТехнологияПриготовления.ПолучитьHTML(ТекущийОбъект.ТехнологияПриготовления, ВложенияТП);
	Оформление.ПолучитьHTML(ТекущийОбъект.Оформление, ВложенияО);
	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТехнологияПриготовления.УстановитьHTML(Объект.ТехнологияПриготовления, Новый Структура);
	Оформление.УстановитьHTML(Объект.Оформление, Новый Структура);
КонецПроцедуры
