// 
Процедура ПриОткрытии()
		
	ТестКодТовара			= 11;
	ТестКоличествоТовара	= 0.5;
	
	ФормированиеТестовогоШК();
	
КонецПроцедуры

// При изменении префикса
//
Процедура КодПриИзменении(Элемент)
	
	Если СтрДлина(СокрЛП(Код)) < 2 Тогда
		Код = Прав("00" + СокрЛП(Код), 2);
	КонецЕсли;	
	
	ФормированиеТестовогоШК();
	ЗаполнитьШаблон();
КонецПроцедуры

// При изменении последовательности представления ШК "код, вес" или "вес, код"
//
Процедура ПорядокКодВесПриИзменении(Элемент)
	
	ФормированиеТестовогоШК();
	
КонецПроцедуры

// При изменении длины кода
//
Процедура ДлинаКодаПриИзменении(Элемент)
	
	ФормированиеТестовогоШК();

КонецПроцедуры

// При изменении множителя количества
//
Процедура МножительКоличестваПриИзменении(Элемент)
	
	ФормированиеТестовогоШК();	
	
КонецПроцедуры

// При изменении кода товара для теста
//
Процедура ТестКодТовараПриИзменении(Элемент)
		
	ФормированиеТестовогоШК();  
	
КонецПроцедуры

// При изменении количества (веса) товара для теста
//
Процедура ТестКоличествоТовараПриИзменении(Элемент)
	
	ФормированиеТестовогоШК();
	
КонецПроцедуры

// Формирование ШК из теста
//
Процедура ФормированиеТестовогоШК()
	
	Если НЕ ЗначениеЗаполнено(ТестКодТовара) ИЛИ НЕ ЗначениеЗаполнено(ТестКоличествоТовара) Тогда
		Возврат;
	КонецЕсли;	
	
	Если СтрДлина(СокрЛП(Формат(ТестКодТовара,"ЧГ="))) > ДлинаКода Тогда
		Сообщить("ТЕСТ: Длина кода больше заданной. Настроенное количество знаков " + ДлинаКода);
		ЭлементыФормы.НадписьТестТелоШК.Заголовок				= "ХХХХХХХХХХ";
		ЭлементыФормы.НадписьТестКонтрольныйСимволШК.Заголовок	= "Х";
		Возврат;
	КонецЕсли;
	
	ТестовоеКоличество = ТестКоличествоТовара / МножительКоличества;
	
	Если СтрДлина(СокрЛП(Формат(ТестовоеКоличество,"ЧГ="))) > 10 - ДлинаКода Тогда
		Сообщить("ТЕСТ: Длина количества больше заданной. Настроенное количество знаков " + (10 - ДлинаКода));
		ЭлементыФормы.НадписьТестТелоШК.Заголовок				= "ХХХХХХХХХХ";
		ЭлементыФормы.НадписьТестКонтрольныйСимволШК.Заголовок	= "Х";
		Возврат;
	КонецЕсли;
	
	Если ТестовоеКоличество < 1 Тогда
		Сообщить("ТЕСТ: Длина количества меньше ""0"". Не корректно задан один из параметров ""Множитель количества"" или тестовое ""Кол-во"" ");
		ЭлементыФормы.НадписьТестТелоШК.Заголовок				= "ХХХХХХХХХХ";
		ЭлементыФормы.НадписьТестКонтрольныйСимволШК.Заголовок	= "Х";
		Возврат;
	КонецЕсли;	
	
	ТестовыйКод			= Формат(ТестКодТовара, "ЧВН=; ЧГ=0; ЧЦ=" + ДлинаКода);
	ТестовоеКоличество	= Формат(ТестовоеКоличество, "ЧВН=; ЧГ=0; ЧЦ=" + (10 - ДлинаКода));
	
	Попытка
		ТестовыйШК = СформироватьШК( Код + ?(ПорядокКодВес, ТестовыйКод + ТестовоеКоличество, ТестовоеКоличество + ТестовыйКод));
	Исключение
	КонецПопытки;
	
	ЭлементыФормы.НадписьТестКонтрольныйСимволШК.Заголовок	= Прав(ТестовыйШК, 1);
	ЭлементыФормы.НадписьТестТелоШК.Заголовок				= Сред(ТестовыйШК, 3, 10);
	
КонецПроцедуры	



