Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна
Перем Закрытие;



Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры


Процедура КнопкаОтменитьЗакрытиеНажатие(Элемент)
	Закрытие.Смена = Документы.ОткрытиеСмены.ПустаяСсылка();
	Закрытие.Дата = Дата(1901,1,1);
	Закрытие.Записать();
	Закрыть();
	
	ТекСмена = РегистрыСведений.ТекущиеСмены.Получить(Новый Структура("МестоРеализации", глПараметрыРМ.МестоРеализации )).Смена;
	ТекСменаЗапрос = ИнтерфейсРМ.ТекущаяСменаЗапрос();
	Если ТекСменаЗапрос <> ТекСмена Тогда
		МенеджерЗаписи = РегистрыСведений.ТекущиеСмены.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.МестоРеализации = глПараметрыРМ.МестоРеализации;
		МенеджерЗаписи.Смена = ТекСменаЗапрос;
		ИнтерфейсРМ.ПопыткаДействияСОбъектом( МенеджерЗаписи, "Объект.Записать()" );
		
	КонецЕсли; 
	//глПараметрыРМ.Вставить("НомерСмены", ИнтерфейсРМ.ТекущаяСмена().Номер);

КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЗакрытиеСмены.Ссылка КАК Закрытие,
	|	ЗакрытиеСмены.Смена КАК Открытие
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.МестоРеализации = &МестоРеализации
	|	И НАЧАЛОПЕРИОДА(ЗакрытиеСмены.Смена.Дата, ДЕНЬ) = &Дата");	
	
	Запрос.УстановитьПараметр("МестоРеализации", глПараметрыРМ.МестоРеализации);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаНаСервере()));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка","Нечего отменять", "В текущей календарной дате по " + глПараметрыРМ.МестоРеализации  + "
		|нет закрытых смен!","","ОК","");
		Отказ = Истина;
	Иначе
		
		ТЗ = Рез.Выгрузить();
		Закрытие = ТЗ[0].Закрытие.ПолучитьОбъект(); //Закрытие//: Документ.ЗакрытиеСмены
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаВыходНажатие(Элемент)
	Закрыть();
КонецПроцедуры


ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

ЭтоОткрытиеСмены = Ложь;
ОткрытиеСменыВыполнено = Ложь;
