
Процедура КоманднаяПанель1Подбор(Кнопка)
	Форма 							= Справочники.Сотрудники.ПолучитьФормуВыбора(,ЭлементыФормы.Сотрудники);
	Форма.ЗакрыватьПриВыборе 		= Ложь;
	Форма.Открыть();
КонецПроцедуры

Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Сотрудники.Добавить().Сотрудник = ВыбранноеЗначение;
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры
