
Процедура ДействияФормыЗаполнить(Кнопка)
	Форма = Справочники.ПосадочныеМеста.ПолучитьФорму("Автозаполнение");
	Форма.Открыть();
	
КонецПроцедуры

Процедура ГрупповаяОбработка()
	
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
	Если ТолькоПросмотр Тогда
		ЭлементыФормы.ДействияФормы.Кнопки.ГрупповаяОбработка.Доступность = Ложь;
		ЭлементыФормы.ДействияФормы.Кнопки.Заполнить.Доступность = Ложь;
	КонецЕсли; 
	
	Если НЕ ПараметрыСеанса.РаспределенныйРежим Тогда
		ЭлементыФормы.СправочникСписок.Колонки.ИнформационнаяБаза.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	//Если НЕ ДанныеСтроки.Ссылка.ЭтоГруппа Тогда
	//	ОформлениеСтроки.Ячейки.Наименование.Текст = НаимПосадочногоМеста(ДанныеСтроки.Ссылка);
	//КонецЕсли;
КонецПроцедуры
