
Процедура ПечатьСправочника()
	Форма = Обработки.ПечатьСправочников.ПолучитьФорму("Форма");
	Форма.Справочник = "Сотрудники";
	Форма.Открыть();
	
КонецПроцедуры

Процедура ГрупповаяОбработка()
	
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	Если глВерсия=1 Тогда
		ЭлементыФормы.СправочникСписок.Колонки.Пейджер.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	// формирование подменю отчетов
	ИнтерфейсАдмина.СоздатьСписокОтчетов(ЭтаФорма, СправочникСписок);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ОТЧЕТОВ

// Процедура назначается динамически
// Процедура вызывается при выборе пункта подменю ПодменюОтчеты командной панели
// формы. Процедура отрабатывает выбор печатной формы.
// Подключение данной процедуры-обработчика выполняется из кода конфигурации
//
Процедура ДействияФормыДействиеВыбратьОтчет(Кнопка) 
	
	ИнтерфейсАдмина.ВыбратьОтчет(ЭтаФорма, Кнопка, "СправочникСписок");
	
КонецПроцедуры






