Перем фЗакрыть;
Перем ТоваровНаСтранице;


Процедура ПриОткрытии()
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	ЗарегистрироватьСобытие("Просмотр отчетов."+ Заголовок);

	Стиль = БиблиотекаСтилей.СтанцияОплаты;
	ДоступностьСтрелок();
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
	фЗакрыть = Истина;
	Закрыть("");
КонецПроцедуры

Процедура ДоступностьСтрелок()
	ЭлементыФормы.ЛистатьВверх.Доступность = 1;
	ЭлементыФормы.ЛистатьВниз.Доступность = 1;	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаОКНажатие(Элемент)
	
	ОК();
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
КонецПроцедуры

Процедура ЛистатьВверхНажатие(Элемент)
	ТекущийЭлемент = ЭлементыФормы.ПолеТабДок;
	Скрипт = "
	|#NoTrayIcon
	|Send {PgUp}
	|";
	Скрипт = СтрЗаменить(Скрипт, "%Заголовок%", Заголовок);
	AutohotkeyDll.ahkTextDll(Скрипт);
КонецПроцедуры

Процедура ЛистатьВнизНажатие(Элемент)
	ТекущийЭлемент = ЭлементыФормы.ПолеТабДок;
	Скрипт = "
	|#NoTrayIcon
	|Send, {PgDn}
	|";
	AutohotkeyDll.ahkTextDll(Скрипт);
КонецПроцедуры

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
ЭлементыФормы.ЛистатьВверх.Заголовок = Шрифты.ПолучитьСимвол("angle_up");
ЭлементыФормы.ЛистатьВниз.Заголовок = Шрифты.ПолучитьСимвол("angle_down");




