
#Если Клиент Тогда

Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

Перем ФормаВвода;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ

// Начало ожидания.
// Открывает окно и выводит текст сообщения,
// если окно уже было открыто, то просто меняется сообщение
//
Процедура Начало(Текст1="",Текст2="") Экспорт
	
	Если НЕ ФормаВвода.Открыта() Тогда
		
		ФормаВвода.Открыть();
		
		// чтобы правильно отцентрировать окно, воспользуемся нашими методами
		Если ЗначениеЗаполнено(глСтекОкон) Тогда
			//глСтекОкон.Вставить(0,ФормаВвода);
			глСтекОкон.Вставить(0, Новый Структура("Форма, Заголовок, hWnd", ФормаВвода));
			глУправлениеОкнами();
			глСтекОкон.Удалить(0);
		КонецЕсли; 
		
	КонецЕсли;
	
	ФормаВвода.ЭлементыФормы.Текст1.Заголовок	= Текст1;
	ФормаВвода.ЭлементыФормы.Текст2.Заголовок	= Текст2;
	
КонецПроцедуры

// Конец ожидания.
// Закрывает окно ожидания, если оно было открыто
//
Процедура Конец() Экспорт
	
	Если ФормаВвода.Открыта() Тогда
		ФормаВвода.Закрыть();
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

ФормаВвода = ПолучитьФорму("Форма9");

#КонецЕсли
