
Процедура СправочникСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа)
	
	Если глВерсия=1 Тогда
		Возврат;
	КонецЕсли; 
	
	//Отказ = Истина;
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Предупреждение("Добавление элементов доступно только в главном узле.");
		Возврат;
	КонецЕсли;
	
	//Форма = Обработки.МастерСозданияМестаРеализации.ПолучитьФорму();
	//
	//Если Копирование Тогда
	//	Форма.ОбъектКопирования  = ЭлементыФормы.СправочникСписок.ТекущаяСтрока;
	//КонецЕсли;
	//
	//Форма.ВызовИзСправочника = Истина;
	//Форма.Открыть();
	
КонецПроцедуры

Процедура СправочникСписокПередУдалением(Элемент, Отказ)
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Предупреждение("Удаление элементов доступно только в главном узле.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура СправочникСписокПередУстановкойПометкиУдаления(Элемент, Отказ)
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Предупреждение("Установка пометки удаления доступна только в главном узле.");
		Отказ = Истина;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
	Если НЕ ПараметрыСеанса.РаспределенныйРежим Тогда
		ЭлементыФормы.СправочникСписок.Колонки.ИнформационнаяБаза.Видимость = Ложь;
	КонецЕсли; 
	
	Если глВерсия = 1 Тогда
		ЭлементыФормы.СправочникСписок.Колонки.ТипЦен.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

