
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) ТОгда
		Сообщить("Не заполнено наименование!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипЦен) И (ПараметрыСеанса.Версия < 3 ИЛИ ЭтотОбъект.ТипыЦенРасписание.Количество()=0) ТОгда
		Сообщить("Не указан тип цен!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	
	Если Не ПараметрыСеанса.ТекущаяИБ.Предопределенный Тогда
		ОбменДанными.Получатели.Очистить();
	КонецЕсли;
	
КонецПроцедуры