
Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Значение.Текст = ПредставлениеСкидки(ДанныеСтроки.Ссылка);
	ОформлениеСтроки.Ячейки.Значение.ОтображатьТекст = Истина;
	
	Если ДанныеСтроки.Ссылка.Значение<0 Тогда
		ОформлениеСтроки.Ячейки.Значение.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	Иначе
		ОформлениеСтроки.Ячейки.Значение.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	КонецЕсли; 
	
КонецПроцедуры


Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
КонецПроцедуры

