//почта
Функция ОтправитьОповещениеНаПочту(Тема, ТекстСообщения, стрПолучатели, СтруктураПрофиль = Неопределено) Экспорт
	Почта = Новый ИнтернетПочта;
	Попытка
		Если СтруктураПрофиль = Неопределено Тогда
			СтруктураПрофиль = ПолучитьПрофиль();
		КонецЕсли;
		
		Если СтруктураПрофиль = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		Профиль = СтруктураПрофиль.ИнтернетПочтовыйПрофиль;
		Почта.Подключиться(Профиль);
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка электронной почты", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		//Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	
	Сообщение.Отправитель.Адрес = СтруктураПрофиль.Отправитель;
	Сообщение.ИмяОтправителя = "СУП ККМ";
	Сообщение.Отправитель.ОтображаемоеИмя = "СУП ККМ";
	Сообщение.Тема = Тема;
	Получатели = СтрРазделить(стрПолучатели, ";", Ложь);
	Для каждого Получатель Из Получатели Цикл
		ПочтовыеАдреса = Сообщение.Получатели;
		ПочтовыйАдрес = ПочтовыеАдреса.Добавить();
		ПочтовыйАдрес.Адрес = Получатель;
	КонецЦикла;
	
	ИнтернетТекстПочтовогоСообщения = Сообщение.Тексты.Добавить();
	ИнтернетТекстПочтовогоСообщения.Текст = ТекстСообщения;
	ИнтернетТекстПочтовогоСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	
	Попытка
		Почта.Послать(Сообщение);
	Исключение
		ЗарегистрироватьСобытие("Ошибка электронной почты", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Почта.Отключиться();
	Возврат Истина;
КонецФункции

Функция ПолучитьПрофиль(ИБ = Неопределено) Экспорт
	Если ИБ = Неопределено Тогда
		ИБ = ПараметрыСеанса.ТекущаяИБ;
	КонецЕсли;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	НомерТТ = СокрЛП(ИБ.Код);
	Если ИБ.Наименование = "Центр" Тогда
		Пользователь = "cd\kegelbum1";
		Отправитель  = "kegelbum1@myasnov.ru";
		АдресСервера = "mail52.cd.local";
	ИначеЕсли ИБ.Регион = Справочники.Регионы.Р52 тогда
		Пользователь = "cd\kegelbum"+НомерТТ;
		Отправитель  = "kegelbum"+НомерТТ+"@myasnov.ru";
		АдресСервера = "mail.myasnov.ru";
	Иначе  
		Пользователь = "msk\kegelbum"+НомерТТ;
		Отправитель  = "kegelbum"+НомерТТ+"@msk.myasnov.ru";
		АдресСервера = "mail.msk.myasnov.ru";
	КонецЕсли;
	
	врОтправитель = РегистрыСведений.ДополнительныеСвойства.ЗначениеСвойства(ИБ, "Email_ИмяОтправителя");	
	Если врОтправитель <> Неопределено Тогда
		Домен = ?(ИБ.Регион=Справочники.Регионы.Р52,"cd\" ,"msk\" );
		RegExp = ирКэш.Получить().RegExp;
		RegExp.Pattern = "(^[a-zA-Z0-9_.+-]+)@([a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+$)";
		Matches = RegExp.Execute(врОтправитель);
		Если Matches.Count Тогда
			SM = Matches.Item(0).submatches;
			Если SM.Count > 1 Тогда
				UID = SM.item(0);
				at	= SM.item(1);
				Пользователь = Домен+UID;
				Отправитель = врОтправитель;
				АдресСервера = "mail."+at;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	Профиль.АдресСервераPOP3 = АдресСервера;
	Профиль.АдресСервераSMTP = АдресСервера;
	Профиль.ВремяОжидания    = 60;
	Профиль.Пароль           = "19643003a8856";
	Профиль.Пользователь     = Пользователь;
	Профиль.ПортPOP3         = 110;
	Профиль.ПортSMTP         = 25;
	Профиль.ПарольSMTP       = "19643003a8856";
	Профиль.ПользовательSMTP = Пользователь;
	Профиль.Таймаут = 5;
	
	СтруктураПрофиль = Новый Структура("ИнтернетПочтовыйПрофиль, Отправитель, ИБ", Профиль, Отправитель, ИБ);
	Возврат СтруктураПрофиль;
КонецФункции


