
Процедура ОтменаНажатие(Элемент)
	ЗарегистрироватьСобытие("Интерактивное действие.ВозвратОплаты.Отмена",,,докВозврат.Ссылка);
	РезультатОплаты.Отмена = Истина;
	Закрыть(РезультатОплаты);
КонецПроцедуры

Процедура ОплатаКартойНажатие(Элемент)
	ЗарегистрироватьСобытие("Интерактивное действие.ВозвратОплаты.НаКарту",,,докВозврат.Ссылка);
	глОтсечкаПростоя();
	Если ВозвратОплаты(Истина) Тогда
		Закрыть(РезультатОплаты);
	Иначе
		Закрыть(РезультатОплаты);
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	Товары = докВозврат.Товары;
	Коплате = Товары.Итог("Сумма");
	НадписьПолучено = "" + Коплате + глСимволРубля;	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

Процедура ОплатаНаличнымиНажатие(Элемент)
	ЗарегистрироватьСобытие("Интерактивное действие.ВозвратОплаты.Печать",,,докВозврат.Ссылка);
	
	Если фИдетОплата Тогда
		Возврат;
	КонецЕсли;
	
	Если ВозвратОплаты() Тогда
		Закрыть(РезультатОплаты);
	Иначе
		Закрыть(РезультатОплаты);
	КонецЕсли;

КонецПроцедуры

Процедура ОбновлениеОтображения()
	Если Не Открыта() Тогда
	
		Возврат;	
	
	КонецЕсли;
	Для Каждого Элемент Из ЭлементыФормы Цикл
		Если СтрЗаканчиваетсяНа(Элемент.Имя, "Рамка") Тогда
			Кнопка = ЭлементыФормы.Найти(СтрЗаменить(Элемент.Имя,"Рамка",""));
			Если Кнопка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Элемент.Видимость = Кнопка = ТекущийЭлемент;
		КонецЕсли;
	КонецЦикла;	
	ПодключитьОбработчикОжидания("ОбновлениеОтображения",0.2,1);
КонецПроцедуры
НадписьПолучено = "0";
Получено = 0;
ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);