Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна
Перем Список;        

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);			
	
	ОткорректироватьРазмеры();	
	
КонецПроцедуры

Процедура КнопкаВыбратьНажатие(Элемент)
	СформироватьОтчет(,Истина);
	ОткорректироватьРазмеры();	
КонецПроцедуры

Процедура ПечатьНажатие(Элемент)
	
	СформироватьОтчет(,Истина,1);
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ МОДУЛЯ

Процедура ОткорректироватьРазмеры()
	ЭтаФорма.Высота = КоличествоСтрок * 15 + 350;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
