Процедура ВидимостьЭлементов()
	Элементы.ПараметрДействия.Видимость = Ложь;	
	Элементы.Действие.Видимость = Ложь;	
	Элементы.СтраницаВарианты.Видимость = Ложь;	
	Элементы.Формы.Видимость = Ложь;	
	Если Объект.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Действие Тогда
		Элементы.Действие.Видимость = Истина;	
		Если Объект.Действие = Справочники.ДействияЭлементовДиалогов.ДобавитьТоварВЗаказ Тогда
			Элементы.ПараметрДействия.Заголовок = "Товар";
			Элементы.ПараметрДействия.ВыбиратьТип = Ложь;
			Объект.ПараметрДействия = ?(ТипЗнч(Объект.ПараметрДействия) = Тип("СправочникСсылка.Товары"), Объект.ПараметрДействия, ПредопределенноеЗначение("Справочник.Товары.ПустаяСсылка"));
			Элементы.ПараметрДействия.Видимость = Истина;	
		КонецЕсли;	
	ИначеЕсли Объект.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Вопрос Тогда
		Элементы.СтраницаВарианты.Видимость = Истина;	
		Элементы.Формы.Видимость = ИСтина;	
	Иначе
		Элементы.Основные.Видимость = Истина;	
	КонецЕсли;
	
	Если Не (Объект.Форма.Пустая() И Объект.ФормаГостя.Пустая()) Тогда
	
		Элементы.Формы.Видимость = Истина;	
	
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ТипЭлементаДиалогаПриИзменении(Элемент)
	ВидимостьЭлементов()
КонецПроцедуры


&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	ВидимостьЭлементов()
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьЭлементов()
КонецПроцедуры


&НаКлиенте
Процедура ВариантыОтветовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.ВариантыОтветов.Количество() >= 3 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ФормаПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура ФормаГостяПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПараметрыФормыНаСервере()
	Объект.ПараметрыФормы.Очистить();
	
	ДобавитьПараметрыФормы(Объект.Форма, Объект.ПараметрыФормы);	
КонецПроцедуры

Процедура ЗаполнитьПараметрыФормыГостяНаСервере()
	Объект.ПараметрыФормыГостя.Очистить();
	
	ДобавитьПараметрыФормы(Объект.ФормаГостя,Объект.ПараметрыФормыГостя);	
КонецПроцедуры


Процедура ДобавитьПараметрыФормы(ФормаСсылка, ТЧ)
	Если ФормаСсылка.Пустая() Тогда
	
		Возврат;
	
	КонецЕсли; 
	ФД = ФормаСсылка.ХранилищеТела.Получить();
	HTML = HTML;
	Вложения=Вложения;
	ФД.ПолучитьHTML(HTML, Вложения);
	HTML_ФормДок = СтрЗаменить(HTML,"padding:8px;","padding:0px;");
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.Pattern="%([\wА-я]*)%";
	RegExp.IgnoreCase = 1;
	m=RegExp.Execute(HTML_ФормДок);
	Для каждого т из m цикл
		Если Т.SubMatches.count Тогда
			Пар =ТЧ.Добавить();
			Пар.ИмяПараметра = Т.SubMatches.Item(0);
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры 


&НаКлиенте
Процедура ЗаполнитьПараметрыФормы(Команда)
	Если Объект.ПараметрыФормы.Количество() Тогда
		Для каждого Т Из Объект.ПараметрыФормы Цикл
			Если ЗначениеЗаполнено(Т.ЗначениеПараметра) Тогда
				Если Вопрос("Параметры будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
					Возврат;
				Иначе
					Прервать;
				КонецЕсли; 
			КонецЕсли; 	
		КонецЦикла; 
	КонецЕсли; 
	ЗаполнитьПараметрыФормыНаСервере();
КонецПроцедуры
	
&НаКлиенте
Процедура ПроверитьФорму(Команда)
	
	
	П = Новый Структура("Ключ, ЭлементДиалога", Объект.Форма, Объект.Ссылка);
	
	ОткрытьФорму("Справочник.ФормыДиалогов.Форма." + Объект.Форма, П, ЭтаФорма, , ВариантОткрытияОкна.ОтдельноеОкно);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормуГостя(Команда)
	
	П = Новый Структура("Ключ, ЭлементДиалога", Объект.ФормаГостя, Объект.Ссылка);
	
	ОткрытьФорму("Справочник.ФормыДиалогов.Форма." + Объект.ФормаГостя, П, ЭтаФорма,, ВариантОткрытияОкна.ОтдельноеОкно);
	
	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыФормыГостя(Команда)
	Если Объект.ПараметрыФормыГостя.Количество() Тогда
		Для каждого Т Из Объект.ПараметрыФормыГостя Цикл
			Если ЗначениеЗаполнено(Т.ЗначениеПараметра) Тогда
				Если Вопрос("Параметры будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
					Возврат;
				Иначе
					Прервать;
				КонецЕсли; 
			КонецЕсли; 	
		КонецЦикла; 
	КонецЕсли; 
	ЗаполнитьПараметрыФормыГостяНаСервере();
КонецПроцедуры
