
&НаКлиенте
Процедура ЗаполнитьПоДаннымСУПцентр(Команда)
	Если ПроверитьЗаполнение() Тогда
		ЭтаФорма.Закрыть(Новый Структура("Регион, НомерТТ, СтандартныеПорты", Регион, НомерТТ, СтандартныеПорты));
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Регион = Параметры.Регион;
	НомерТТ = Параметры.НомерТТ;
	Если Не Параметры.Свойство("СтандартныеПорты", СтандартныеПорты) Тогда
		СтандартныеПорты = Истина;
	КонецЕсли;
КонецПроцедуры
