Перем фЗакрыть;
Перем ТоваровНаСтранице;
Перем AutohotkeyDll;

Процедура ПриОткрытии()
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);

	Стиль = БиблиотекаСтилей.СтанцияОплаты;
	ДоступностьСтрелок();
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
	фЗакрыть = Истина;
	Закрыть("");
КонецПроцедуры

Процедура ДоступностьСтрелок()
	ВсегоСтрок = Чеки.Количество();
	Если ВсегоСтрок Тогда
		Если ЭлементыФормы.тпЧеки.ТекущаяСтрока = Неопределено Тогда
			НомерТекСтроки = 1;
		Иначе
			НомерТекСтроки = Чеки.Индекс( ЭлементыФормы.тпЧеки.ТекущаяСтрока) + 1;
		КонецЕсли;
	Иначе
		НомерТекСтроки = 0;
	КонецЕсли;
	
	Если НомерТекСтроки+2 <= ТоваровНаСтранице Тогда
		ЭлементыФормы.ЛистатьВверх.Доступность = 0;
		КначалуСписка();	
	Иначе
		ЭлементыФормы.ЛистатьВверх.Доступность = 1;
	КонецЕсли;
	
	Если НомерТекСтроки = ВсегоСтрок Тогда
		ЭлементыФормы.ЛистатьВниз.Доступность = 0;
	ИначеЕсли ВсегоСтрок > ТоваровНаСтранице Тогда
		ЭлементыФормы.ЛистатьВниз.Доступность = 1;
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаОКНажатие(Элемент)
	
	ОК();
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
КонецПроцедуры

Процедура тпЧекиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	ОК();	
КонецПроцедуры

Процедура ЛистатьВверхНажатие(Элемент)
	Скрипт = "
	|#NoTrayIcon
	|ControlSend, V8Grid1, {PgUp}, A
	|";
	Скрипт = СтрЗаменить(Скрипт, "%Заголовок%", Заголовок);
	AutohotkeyDll.ahkTextDll(Скрипт);
	ПодключитьОбработчикОжидания("ДоступностьСтрелок",0.2,1);
КонецПроцедуры

Процедура ЛистатьВнизНажатие(Элемент)
	Скрипт = "
	|#NoTrayIcon
	|ControlSend, V8Grid1, {PgDn}, A
	|";
	Скрипт = СтрЗаменить(Скрипт, "%Заголовок%", Заголовок);
	AutohotkeyDll.ahkTextDll(Скрипт);
	ПодключитьОбработчикОжидания("ДоступностьСтрелок",0.2,1);
КонецПроцедуры

Процедура КначалуСписка()
	Скрипт = "
	|#NoTrayIcon
	|ControlSend, V8Grid1, {Home}, A
	|";
	Скрипт = СтрЗаменить(Скрипт, "%Заголовок%", Заголовок);
	AutohotkeyDll.ahkTextDll(Скрипт);
КонецПроцедуры

Процедура тпЧекиПриАктивизацииСтроки(Элемент)
	ТД = ЭлементыФормы.тпЧеки.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Заказ = Документы.Заказ.ПустаяСсылка();
	Иначе
		Заказ = ТД.Заказ;
	КонецЕсли;
КонецПроцедуры

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
ЭлементыФормы.ЛистатьВверх.Заголовок = Шрифты.ПолучитьСимвол("angle_up");
ЭлементыФормы.ЛистатьВниз.Заголовок = Шрифты.ПолучитьСимвол("angle_down");

ТоваровНаСтранице = 15;
Попытка
	AutohotkeyDll = РаботаСокнами.AHK();
Исключение
КонецПопытки;
