
#Если Клиент Тогда
	
// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
КонецПроцедуры

Процедура ВводАдреса(ФормаВвода, СледующийЭлементФормы) Экспорт

	// из модального окна работает только клава из него же открытая
	РаботаСокнами.CloseScreenKey();
	
	Если Адрес.Пустая() Тогда
		Если ВвестиНовыйАдресТелефон(ФормаВвода, Перечисления.ТипыКонтактнойИнформации.Адрес) Тогда
			ФормаВвода.ТекущийЭлемент = СледующийЭлементФормы;
		КонецЕсли; 
	Иначе
		НовыйАдресТел = Адрес.ПолучитьОбъект();
		ФормаЗаписи = НовыйАдресТел.ПолучитьФорму("ФормаЗаписиАдресаРМ");
		ФормаЗаписи.ВладелецФормы = ФормаВвода;
		ФормаЗаписи.ОткрытьМодально();
	КонецЕсли; 

КонецПроцедуры

Процедура ВводТелефона(ФормаВвода, СледующийЭлементФормы) Экспорт

	// из модального окна работает только клава из него же открытая
	РаботаСокнами.CloseScreenKey();
	
	Если Телефон.Пустая() Тогда
		Если ВвестиНовыйАдресТелефон(ФормаВвода, Перечисления.ТипыКонтактнойИнформации.Телефон) Тогда
			ФормаВвода.ТекущийЭлемент = СледующийЭлементФормы;
		КонецЕсли; 
	Иначе
		НовыйАдресТел = Телефон.ПолучитьОбъект();
		ФормаЗаписи = НовыйАдресТел.ПолучитьФорму("ФормаЗаписиТелефонаРМ");
		ФормаЗаписи.ВладелецФормы = ФормаВвода;
		ФормаЗаписи.ОткрытьМодально();
	КонецЕсли; 

КонецПроцедуры
 
Функция ВвестиНовыйАдресТелефон(ФормаВвода, Тип)
	
	Если НЕ ЗначениеЗаполнено(Клиент.Наименование) Тогда
		Текст1 = "Ошибка!";
		Текст2 = "Введите ФИО клиента!";
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");
		ФормаВвода.ТекущийЭлемент = ФормаВвода.ЭлементыФормы.Наименование;
		Возврат Ложь;
	КонецЕсли;
	
	Если Клиент.ЭтоНовый() Тогда
		Клиент.Записать();
	КонецЕсли; 
	
	НовыйАдресТел = Справочники.КонтактнаяИнформация.СоздатьЭлемент();
	НовыйАдресТел.Объект = Клиент.Ссылка;
	НовыйАдресТел.Тип = Тип;
	
	Если Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		ФормаЗаписи = НовыйАдресТел.ПолучитьФорму("ФормаЗаписиАдресаРМ");
	Иначе
		НовыйАдресТел.Поле3 = КлиентКод;
		ФормаЗаписи = НовыйАдресТел.ПолучитьФорму("ФормаЗаписиТелефонаРМ");
	КонецЕсли;
	
	ФормаЗаписи.ВладелецФормы = ФормаВвода;
	ФормаЗаписи.ОткрытьМодально();
	
	Если НовыйАдресТел.Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		Адрес = НовыйАдресТел.Ссылка;
	Иначе
		Телефон = НовыйАдресТел.Ссылка;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

#КонецЕсли
