////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


Процедура ПечатьСправочника()
	
	Форма = Обработки.ПечатьСправочников.ПолучитьФорму("Форма");
	Форма.Справочник = "Клиенты";
	Форма.Открыть();
	
КонецПроцедуры

Процедура ГрупповаяОбработка()
	
КонецПроцедуры	

Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
	Если ТолькоПросмотр Тогда
		ЭлементыФормы.ДействияФормы.Кнопки.ГрупповаяОбработка.Доступность = Ложь;
		ЭлементыФормы.ДействияФормы.Кнопки.ЗагрузкаИзXLS.Доступность = Ложь;
	КонецЕсли; 
	
	ЭлементыФормы.СправочникСписок.Колонки.Скидка.Видимость	= глВерсия>1;
	ЭлементыФормы.СправочникСписок.Колонки.Бонусы.Видимость	= глВерсия>1;
	
	СпрКлиенты = Справочники.Клиенты.Выбрать();
	Если СпрКлиенты.Следующий() Тогда
		СписокОтчетов = СпрКлиенты.ПолучитьОбъект().ПолучитьСписокОтчетов();
		Попытка
			
			ИнтерфейсАдмина.УстановитьПодменюВыбораОтчетов(ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменОтчетов,
			СписокОтчетов,
			Новый Действие("ДействияФормыДействиеВыбратьОтчет"));
			
		Исключение 
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

 // Процедура назначается динамически
// Процедура вызывается при выборе пункта подменю ПодменюОтчеты командной панели
// формы. Процедура отрабатывает выбор печатной формы.
// Подключение данной процедуры-обработчика выполняется из кода конфигурации
//
Процедура ДействияФормыДействиеВыбратьОтчет(Кнопка) 
	
	ИнтерфейсАдмина.ВыбратьОтчет(ЭтаФорма, Кнопка, "СправочникСписок");
	
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	// формирование подменю отчетов
	ИнтерфейсАдмина.СоздатьСписокОтчетов(ЭтаФорма, СправочникСписок);
КонецПроцедуры



