
#Если Клиент Тогда

Перем Задание;
Перем ШиринаКолонок;

// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
КонецПроцедуры

Процедура СформироватьОтчет(ТабличныйДокумент = "", НаПринтер = Ложь, ВарФормирования = 0) Экспорт
	Если НаПринтер Тогда
		ПечататьНаПринтере();
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Процедура ПечататьНаПринтере()  
		
	ТекстЗапроса ="ВЫБРАТЬ
	              |	БроньТовары.Товар КАК ТОВАР,
	              |	БроньТовары.НомерСтроки КАК НомерСтроки,
	              |	БроньТовары.Количество КАК Количество,
	              |	БроньТовары.Товар.ГруппаПечати КАК ГруппаПечати
	              |ИЗ
	              |	Документ.Бронь.Товары КАК БроньТовары
	              |ГДЕ
	              |	БроньТовары.Ссылка.ВремяНачала МЕЖДУ &ДатаС И &ДатаПо
	              |	И БроньТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	              |	И БроньТовары.Ссылка.Закрыто = ЛОЖЬ
	              |ИТОГИ
	              |	СУММА(Количество)
	              |ПО
	              |	ГруппаПечати,
	              |	ТОВАР";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Если  глПараметрыРМ.БроньРабочееВремяНач < глПараметрыРМ.БроньРабочееВремяКон Тогда 
		ДатаНач = НачалоДня(ТекущаяДата())+Час(глПараметрыРМ.БроньРабочееВремяНач)*60*60+Минута(глПараметрыРМ.БроньРабочееВремяНач)*60;
		ДатаКон = НачалоДня(ТекущаяДата())+Час(глПараметрыРМ.БроньРабочееВремяКон)*60*60+Минута(глПараметрыРМ.БроньРабочееВремяКон)*60;
	Иначе
		ДатаНач = НачалоДня(ТекущаяДата())+Час(глПараметрыРМ.БроньРабочееВремяНач)*60*60+Минута(глПараметрыРМ.БроньРабочееВремяНач)*60;
		ДатаКон = ДобавитьДень(НачалоДня(ТекущаяДата()),1)+Час(глПараметрыРМ.БроньРабочееВремяКон)*60*60+Минута(глПараметрыРМ.БроньРабочееВремяКон)*60;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаС" , ДатаНач);
   	Запрос.УстановитьПараметр("ДатаПо", ДатаКон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДлинаСтроки = ИнтерфейсРМ.ПРНДлинаСтроки(глПараметрыРМ.ПечатьОтчетовПринтер);
	ШиринаКолонок = Новый СписокЗначений;
		
	Если ДлинаСтроки=32 Тогда
		Шапка="     Товар                Кол-во";
		ШиринаКолонок.Добавить(24);
		ШиринаКолонок.Добавить(8);
	ИначеЕсли ДлинаСтроки=36 Тогда
		Шапка="     Товар                    Кол-во";
		ШиринаКолонок.Добавить(28);
		ШиринаКолонок.Добавить(8);
	ИначеЕсли ДлинаСтроки=40 Тогда
		Шапка="     Товар                        Кол-во";
		ШиринаКолонок.Добавить(32);
		ШиринаКолонок.Добавить(8);
	ИначеЕсли ДлинаСтроки=42 Тогда
		Шапка="     Товар                          Кол-во";
		ШиринаКолонок.Добавить(34);
		ШиринаКолонок.Добавить(8);
	ИначеЕсли ДлинаСтроки=44 Тогда
		Шапка="     Товар                            Кол-во";
		ШиринаКолонок.Добавить(36);
		ШиринаКолонок.Добавить(8);
	Иначе //Если ДлинаСтроки=48 Тогда
		Шапка="     Товар                                Кол-во";
		ШиринаКолонок.Добавить(40);
		ШиринаКолонок.Добавить(8);
	КонецЕсли;
	
	Задание = Новый ТаблицаЗначений;
	Задание.Колонки.Добавить("Данные");
	Задание.Колонки.Добавить("ТипДанных");
	Задание.Колонки.Добавить("Параметры");
	
	Заголовок = "ПРЕДВАРИТЕЛЬНЫЕ"+Символы.ПС+" ЗАКАЗЫ НА "+Символы.ПС+Формат(ТекущаяДата(),"ДФ=дд.ММ.гг");
		
	Выгрузка = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выгрузка.Строки.Сортировать("ГруппаПечати");
	
	НоваяСтрока = Задание.Добавить(); 
	НоваяСтрока.Данные  = Шапка;
	НоваяСтрока.ТипДанных = "Строка";
	НоваяСтрока.Параметры = "Жирный,ПереводСтроки";
	
	НоваяСтрока = Задание.Добавить(); 
	НоваяСтрока.ТипДанных = "Строка";
	НоваяСтрока.Параметры = "ПереводСтроки";
		
	Для Каждого Строка Из Выгрузка.Строки Цикл
		НоваяСтрока = Задание.Добавить(); 
		НоваяСтрока.Данные    = ВРег(Строка.ГруппаПечати)+":";
		НоваяСтрока.ТипДанных = "Строка";
		НоваяСтрока.Параметры = "Жирный,ПереводСтроки";

		Строка.Строки.Сортировать("Товар");
		Для Каждого Товар Из Строка.Строки Цикл
			СформироватьСтроку("     "+Товар.Товар,Товар.Количество,Ложь);
        КонецЦикла;
		
	КонецЦикла;
	
    ФормированиеОтчетов.ПечатьОтчетаРМ(Задание,Заголовок);

КонецПроцедуры

Процедура СформироватьСтроку(Стр, Колво, Выделение)
		
		Выделение=?(Выделение,"Жирный","НеЖирный");
		
		НоваяСтрока = Задание.Добавить();
		НоваяСтрока.Данные    = СтрДополнитьСправа(Стр, ШиринаКолонок[0].Значение);
		НоваяСтрока.ТипДанных = "Строка";
		НоваяСтрока.Параметры = Выделение+",НеПереводСтроки";
		
		НоваяСтрока = Задание.Добавить();
		НоваяСтрока.Данные    = СтрДополнитьСлева(Формат(Колво,"ЧЦ=3; ЧДЦ=2; ЧН=0,00"), ШиринаКолонок[1].Значение);
		НоваяСтрока.ТипДанных = "Строка";
		НоваяСтрока.Параметры = Выделение+",ПереводСтроки";
		
КонецПроцедуры

 #КонецЕсли

	

	
	
