
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ДокументОписаниеОбновлений = ЭлементыФормы.ДокументОписаниеОбновлений;
	МакетОписаниеОбновлений = ПолучитьМакет("ОписаниеОбновлений"+глВерсия);
	ДокументОписаниеОбновлений.Очистить();
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений);
	ДокументОписаниеОбновлений.ПоказатьУровеньГруппировокСтрок(1);
	ДокументОписаниеОбновлений.ПоказатьУровеньГруппировокСтрок(0);
	//
	ФормированиеОтчетов.СгенерироватьКнопкиУправленияГруппировкой(ЭлементыФормы.ДокументОписаниеОбновлений,ЭлементыФормы);
	
КонецПроцедуры

Процедура КоманднаяПанельФормыБыстрыеОтборы(Элемент)
	//ФормированиеОтчетов.УправлениеОтображениемЭлементовФормы(ЭтаФорма,Элемент);
	Уровень = Число(Элемент.Заголовок); // здесь записан нужный уровень
    ЭлементыФормы.ДокументОписаниеОбновлений.ПоказатьУровеньГруппировокСтрок(Уровень - 1);

КонецПроцедуры
