
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ПослеЗаписи()

	ОповеститьОЗаписиНовогоОбъекта(Ссылка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ТелефонСформироватьПредставление();
	
	Если Представление="" Тогда
		Предупреждение("Телефон пустой");
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Процедура вызывается при изменении реквизита Поле3 - собственно номер телефона.
Процедура Поле3ПриИзменении(Элемент)

	Элемент.Значение = киПривестиНомерТелефонаКШаблону(Элемент.Значение);
	ТелефонСформироватьПредставление();
	
КонецПроцедуры

// Процедура вызывается при изменении реквизита Поле2 - код города.
Процедура Поле2ПриИзменении(Элемент)
	
	ТелефонСформироватьПредставление();
	
КонецПроцедуры

Процедура КнопкаЭкраннаяКлаваНажатие(Элемент)
	
	ИнтерфейсРМ.ЭкраннаяКлавиатура();
	
	ТекущийЭлемент = ЭлементыФормы.Поле3;
	
КонецПроцедуры

Процедура КнопкаЗакрытьНажатие(Элемент)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
