Перем Режим, RegExp;
Перем ОкноОбрезано, Окно1С;
Перем КнопкиУстановлены;
Процедура ПриОткрытии()
	
	Если Не ВариантыОтветов.Количество() Тогда
	
		Нов = ВариантыОтветов.Добавить();
		Нов.ТекстКнопки = "Да";
		Нов.ВариантОтвета = "Да";
		нОВ.НомерСтроки = 1;
		Нов = ВариантыОтветов.Добавить();
		Нов.ТекстКнопки = "Нет";
		Нов.ВариантОтвета = "Нет";
		нОВ.НомерСтроки = 2;
		Нов = ВариантыОтветов.Добавить();
		Нов.ТекстКнопки = "Отмена";
		Нов.ВариантОтвета = "Отмена";
		нОВ.НомерСтроки = 3;
		
	КонецЕсли; 
	
	ФД = ХранилищеТела.Получить();
	HTML = HTML;
	Вложения=Вложения;
	ФД.ПолучитьHTML(HTML, Вложения);
	HTML_ФормДок = СтрЗаменить(HTML,"padding:8px;","padding:0px;");
	
	RegExp.Pattern="<body>([^$]*)<\/body>";
	RegExp.IgnoreCase = 1;
	m=RegExp.Execute(HTML_ФормДок);
	Тело=m.Item(0).SubMatches.Item(0);
	
	Для Каждого Т ИЗ ПараметрыФормы Цикл
		Тело = СтрЗаменить(Тело, "%"+Т.ИмяПараметра+"%", Т.ЗначениеПараметра);
	КонецЦикла;
	
	М = ПолучитьМакет("Вопрос");
	HTML = М.ПолучитьТекст();
	
	
	RegExp.Pattern=".*id=""вопрос"".*";
	HTML=RegExp.Replace(HTML,Тело);
	
	
	ЭлементыФормы.ПолеHTML.УстановитьТекст(HTML);
КонецПроцедуры

Процедура ПолеHTMLonclick(Элемент, pEvtObj)
	data = pEvtObj.data;
	Если ЗначениеЗаполнено(data) Тогда 
		Закрыть(pEvtObj.data);
	КонецЕсли;
КонецПроцедуры

Процедура ПолеHTMLondblclick(Элемент, pEvtObj)
	Режим = ?(РежимПоляHTMLДокумента.Редактирование = Режим, РежимПоляHTMLДокумента.Просмотр, РежимПоляHTMLДокумента.Редактирование);
	HTML=(ЭлементыФормы.ПолеHTML.ПолучитьТекст());
	ЭлементыФормы.ПолеHTML.УстановитьРежим(Режим);
	ЭлементыФормы.ПолеHTML.УстановитьТекст(HTML);
	
	Сообщить(HTML);
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
КонецПроцедуры

Процедура ПриПовторномОткрытии(СтандартнаяОбработка)
	ОкноОбрезано=Ложь;
КонецПроцедуры

Процедура ПриЗакрытии()
	
КонецПроцедуры

Процедура УстановитьКнопки()
	ПолеHTML = ЭлементыФормы.ПолеHTML;
	Для Каждого Т ИЗ ВариантыОтветов Цикл
 		ДИВ = ПолеHTML.Документ.getElementById("Button"+(Т.НомерСтроки));
		
		//Попробуем найти атрибут "onclick", связанный с событием щелчок мыши, у элемента.
		НашлиАтрибут = ДИВ.getAttributeNode("onclick");
		//Удалим атрибут если такой имеется
		Если НашлиАтрибут <> null Тогда
			ДИВ.removeAttribute("onclick");
		КонецЕсли;
		ДИВ.innerHTML = "<span>"+Т.ТекстКнопки+"</span>";
		//Создадим атрибут и установим необходимое нам действие
		Атрибут  = ПолеHTML.Документ.createAttribute("onclick"); //создаем атрибут
		Атрибут.value = 
		"var evt = document.createEventObject(); // создадим пустой объект событие
		|evt.propertyName = 'ButtonClick'; // в реквизит propertyName предлагаю помещать название результата ( что-то вроде типа, или название функции от которой получили данные )
		|evt.data = '"+т.ВариантОтвета+"'; //в реквизит data будем передавать данные результата
		|document.body.fireEvent('onclick', evt); // выполним событие при нажатии  ПолеHTMLДокумента";
		ДИВ.attributes.setNamedItem(Атрибут); // привязываем атрибут	
	КонецЦикла;
КонецПроцедуры

Процедура ПолеHTMLДокументСформирован(Элемент)
	
	Если Не КнопкиУстановлены Тогда
	
		ПодключитьОбработчикОжидания("УстановитьКнопки",0.2,Истина);	
	
	КонецЕсли; 
	
	
КонецПроцедуры

RegExp = Новый COMОбъект("VBScript.RegExp");
КнопкиУстановлены = Ложь;