
Функция ЗаполнитьКодыУровней()
	
	НовыйКодРегионаВКоде           = Цел(Код / киМаскаРегиона());
	НовыйКодРайонаВКоде            = Цел(Код / киМаскаРайона()) % 1000;
	НовыйКодГородаВКоде            = Цел(Код / киМаскаГорода()) % 1000;
	НовыйКодНаселенногоПунктаВКоде = Цел(Код / киМаскаНасПункта()) % 1000;
	НовыйКодУлицыВКоде             = Цел(Код / киМаскаУлицы())% 10000;
	
	Модифицировали = Ложь;
	
	Если КодРегионаВКоде <> НовыйКодРегионаВКоде Тогда
		КодРегионаВКоде = НовыйКодРегионаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
		
	Если КодРайонаВКоде <> НовыйКодРайонаВКоде Тогда
		КодРайонаВКоде = НовыйКодРайонаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	
	Если КодГородаВКоде <> НовыйКодГородаВКоде Тогда
		Модифицировали = Истина;
		КодГородаВКоде = НовыйКодГородаВКоде;
	КонецЕсли;
	
	Если КодНаселенногоПунктаВКоде <> НовыйКодНаселенногоПунктаВКоде Тогда
		КодНаселенногоПунктаВКоде = НовыйКодНаселенногоПунктаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	
	Если КодУлицыВКоде <> НовыйКодУлицыВКоде Тогда
		КодУлицыВКоде = НовыйКодУлицыВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	
	Возврат Модифицировали;
	
КонецФункции

Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.ПолныйАдрес.Заголовок = киПолучитьПолноеНазвание(Код);
	
КонецПроцедуры

Процедура СокращениеНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокСокращений = киПолучитьСписокСокращений(Наименование, ТипАдресногоЭлемента);
	
	Если СписокСокращений <> Неопределено Тогда
		ЭлементСокращения = ВыбратьИзСписка(СписокСокращений,Элемент);
		Если ЭлементСокращения <> Неопределено Тогда
			Сокращение = СокрЛП(ЭлементСокращения.Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ЗаполнитьКодыУровней();
	
КонецПроцедуры




