Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон("Чек %3 / %4 (протокол расчетов %1 от %2)",
					Данные.Номер,
					Формат(Данные.Дата, "ДФ='дд.ММ.гг ЧЧ:мм:сс'"),
					Данные.НомерЧека,
					Данные.НомерСмены);
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("НомерЧека");
	Поля.Добавить("НомерСмены");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
