	
&НаСервере
Процедура ОтборПоДаннымНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДанным(Команда)
	ОтборПоДаннымНаСервере();
КонецПроцедуры

&НаСервере
Процедура Данные_ФильтрПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Данные_Фильтр) Тогда
		УИД = Данные_Фильтр.УникальныйИдентификатор();
		УстановитьЭлементОтбораДинамическогоСписка(Список, "Данные_Ссылка", УИД, ВидСравненияКомпоновкиДанных.Равно);	
	Иначе
		УстановитьЭлементОтбораДинамическогоСписка(Список, "Данные_Ссылка", , , , Ложь);			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Данные_ФильтрПриИзменении(Элемент)
	Данные_ФильтрПриИзмененииНаСервере();
КонецПроцедуры


