	
&НаСервере
Процедура ОтборПоДаннымНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДанным(Команда)
	ОтборПоДаннымНаСервере();
КонецПроцедуры

&НаСервере
Процедура Данные_ФильтрПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Данные_Фильтр) Тогда
		УИД = Данные_Фильтр.УникальныйИдентификатор();
		УстановитьЭлементОтбораДинамическогоСписка(Список, "Данные_Ссылка", УИД, ВидСравненияКомпоновкиДанных.Равно);	
	Иначе
		УстановитьЭлементОтбораДинамическогоСписка(Список, "Данные_Ссылка", , , , Ложь);			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Данные_ФильтрПриИзменении(Элемент)
	Данные_ФильтрПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Данные) Тогда
		Данные_Фильтр = Параметры.Данные;
		Данные_ФильтрПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры


