&НаКлиенте
Перем ПредСтрока;

&НаСервере
Процедура ОтборПоДаннымНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДанным(Команда)
	ОтборПоДаннымНаСервере();
КонецПроцедуры

&НаСервере
Процедура Данные_ФильтрПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Данные_Фильтр) Тогда
		УИД = Данные_Фильтр.УникальныйИдентификатор();
		УстановитьЭлементОтбораДинамическогоСписка(Список, "Данные_Ссылка", УИД, ВидСравненияКомпоновкиДанных.Равно);	
	Иначе
		УстановитьЭлементОтбораДинамическогоСписка(Список, "Данные_Ссылка", , , , Ложь);			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Данные_ФильтрПриИзменении(Элемент)
	Данные_ФильтрПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Данные) Тогда
		Данные_Фильтр = Параметры.Данные;
		Данные_ФильтрПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Истина;
	//ПараметрыОткрытия = Новый Структура("Ключ, УИДссылки",Элементы.Список.ТекущаяСтрока, Элементы.Список.ТекущиеДанные.Данные_Ссылка);
	//ОткрытьФорму("ВнешнийИсточникДанных.ЖурналРегистрации.Таблица.ЖурналРегистрации.ФормаЗаписи",ПараметрыОткрытия)
КонецПроцедуры

&НаСервере
Процедура СоздатьРасшифровкуТаблицуЗначений(ТЗ) Экспорт
	
	//ДанныеФормыВЗначение()
	Попытка
		ИзменитьРеквизиты(, Массив("РасшифровкаТаблицаЗначений")); 	
	Исключение
	КонецПопытки;
	МассивТипаВыбора = Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТипаВыбора = Новый ОписаниеТипов(МассивТипаВыбора);
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("РасшифровкаТаблицаЗначений", ОписаниеТипаВыбора, "", "Расшифровка"));
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения,"РасшифровкаТаблицаЗначений"));
		
	КонецЦикла;
	ИзменитьРеквизиты(МассивРеквизитов);  
	
	Попытка
		ТаблицаРасшифровки = Элементы.Вставить("РасшифровкаТаблицаЗначений", Тип("ТаблицаФормы"));
	ТаблицаРасшифровки.ПутьКДанным = "РасшифровкаТаблицаЗначений";
	ТаблицаРасшифровки.Отображение = ОтображениеТаблицы.Список;

	Исключение
	КонецПопытки;
	
	Элементы.РасшифровкаТаблицаЗначений.Видимость = Истина;
	
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если элементы.Найти(Колонка.Имя)  = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить(Колонка.Имя, Тип("ПолеФормы"), ТаблицаРасшифровки);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "РасшифровкаТаблицаЗначений." + Колонка.Имя;
		КонецЕсли;
		//НовыйЭлемент.Ширина = 10;
		
	КонецЦикла;
	
	 ЗначениеВРеквизитФормы(ТЗ, "РасшифровкаТаблицаЗначений");
КонецПроцедуры

&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(Знач стрКомментарий)
	п = СтрНайти(стрКомментарий,"{""#"",acf6192e-81ca-46ef-93a6-5a6968b78663,");;
	фрагментКонцаТЗ = "{0,0}
	|}
	|}";
	стрКомментарий = сред(стрКомментарий, п);
	п2 = стрнайти(стрКомментарий, фрагментКонцаТЗ) + СтрДлина(фрагментКонцаТЗ);
	стрКомментарий = лев(стрКомментарий, п2-1);
	
	ТЗ = Неопределено;
	Попытка
		ТЗ = ЗначениеИзСтрокиВнутр(стрКомментарий);	
	Исключение
	КонецПопытки;
	
	Если ТЗ <> Неопределено Тогда
		Попытка
			СоздатьРасшифровкуТаблицуЗначений(ТЗ);
		Исключение
			Сообщить(ОписаниеОшибки());	
		КонецПопытки;
	Иначе
		Если Элементы.Найти("РасшифровкаТаблицаЗначений") <> Неопределено Тогда
			Элементы.РасшифровкаТаблицаЗначений.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если ПредСтрока = Элемент.ТекущаяСтрока Тогда
		Возврат;
	Иначе
		ПредСтрока = Элемент.ТекущаяСтрока;
	КонецЕсли;
	
	
	ДС = Элементы.Список.ДанныеСтроки(Элементы.Список.ТекущаяСтрока);
	Если ДС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СписокПриАктивизацииСтрокиНаСервере(ДС.Комментарий);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЖРвЖР(Команда)
	ЗагрузитьЖРвЖРНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЖРвЖРНаСервере() Экспорт
	ЖурналРегистрации.ЗагрузитьЖРвЖР(); 
КонецПроцедуры

