
&НаСервере
Процедура ОтборПоДаннымНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДанным(Команда)
	ОтборПоДаннымНаСервере();
КонецПроцедуры

&НаСервере
Процедура Данные_ФильтрПриИзмененииНаСервере()
	УИД = Данные_Фильтр.УникальныйИдентификатор();
	УстановитьЭлементОтбораДинамическогоСписка(Список, "Данные_Ссылка", УИД, ВидСравненияКомпоновкиДанных.Равно);	
КонецПроцедуры

&НаКлиенте
Процедура Данные_ФильтрПриИзменении(Элемент)
	Данные_ФильтрПриИзмененииНаСервере();
КонецПроцедуры


