
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередЗакрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	Стиль = БиблиотекаСтилей.СтанцияОплаты;
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаВыполнитьНажатие(Элемент)
	
	НомерКнопки = Число(Сред(Элемент.Имя,7));
	ОбработкаНажатияКнопки(НомерКнопки);
	
КонецПроцедуры

Процедура ВыходНажатие(Элемент)
	Закрыть("ВыходИзРежима");
КонецПроцедуры

Процедура ОбновлениеОтображения()
	Для Каждого Элемент Из ЭлементыФормы Цикл
		Если СтрНачинаетсяС(Элемент.Имя, "Рамка") Тогда
			Кнопка = ЭлементыФормы.Найти(СтрЗаменить(Элемент.Имя,"Рамка","Кнопка"));
			Если Кнопка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Элемент.Видимость = Кнопка = ТекущийЭлемент;
		КонецЕсли;
	КонецЦикла;	
	
	ЭлементыФормы.ВыходРамка.Видимость = ЭлементыФормы.Выход = ТекущийЭлемент;
	ПодключитьОбработчикОжидания("ОбновлениеОтображения",0.1,1);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

КолвоКнопок = 10;

//РаботаСокнами.ПереназначитьКнопки("РежимАдминистратора", "~Down", "{LCtrl Down}{VK69}{LCtrl Up}");
//РаботаСокнами.ПереназначитьКнопки("РежимАдминистратора", "~UP", "{LCtrl Down}{VK69}{LCtrl Up}");
