Процедура ПередЗаписью(Отказ, Замещение)
	ОД = ОбменДанными;
	ЕСли ОД.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не Количество() Тогда
		Возврат;
	КонецЕсли;

	Всем = Ложь;
	ТекИБ = ПараметрыСеанса.ТекущаяИБ;

	Если Не ТекИБ.Предопределенный Тогда
		Возврат;
	КонецЕсли;
	Получатели = Новый Массив;

	Попытка
		ПланыОбмена.УдалитьРегистрациюИзменений(Справочники.ГруппыИнформационныхБаз.УзлыПоГруппе(Справочники.ГруппыИнформационныхБаз.ВсеИБ, Истина), ЭтотОбъект);
	Исключение
	КонецПопытки;
	Получатели = Справочники.ГруппыИнформационныхБаз.УзлыПоГруппе(Справочники.ГруппыИнформационныхБаз.Рестораны);
	
	ОД.Получатели.Очистить();
	Для Каждого Т Из Получатели Цикл
		Попытка
			ОД.Получатели.Добавить(Т);
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры
