
Процедура ЗарегистрироватьСобытиеКлиент(ИмяСобытия, Уровень = Неопределено, ОбъектМетаданных = Неопределено, Данные = Неопределено, Комментарий = "", РежимТранзакции = Неопределено) Экспорт
		Если Уровень = УровеньЖурналаРегистрации.Ошибка Тогда
			РаботаСокнами = РаботаСокнами;
			Если Не РаботаСокнами = Неопределено И глОтладкаУровень() > 0 Тогда
				//:РаботаСокнами = Обработки.РаботаСокнами.Создать();
				РаботаСокнами.ПоказатьПлашку("Ошибочка :-(", Комментарий);
			КонецЕсли;
		КонецЕсли;
		
КонецПроцедуры




