
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ПустаяСтрока(НазваниеАкции) Тогда
	
		СформироватьАвтоНазвание();
	
	КонецЕсли; 
	
	Если ТипАкции.Пустая() Тогда
		ТипАкции = ВидАкции.Тип;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СериализованноеРасписание) Тогда
		Расписание = ЗначениеИзСтрокиВнутр(СериализованноеРасписание);
		РасписаниеСтрокой = Строка(Расписание);
		Если РасписаниеСтрокой = "каждый  день; один раз в день" Тогда
			РасписаниеСтрокой = "Нажмите, чтобы задать расписание";
		Иначе
			РасписаниеСтрокой = СтрЗаменить(РасписаниеСтрокой,"; один раз в день","");
			РасписаниеСтрокой = СтрЗаменить(РасписаниеСтрокой,"один раз в день","");
		КонецЕсли;
		РасписаниеСтрокой = СтрЗаменить(РасписаниеСтрокой,":00:00",":00");

		
	КонецЕсли; 
	
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
	Если ПремиальныеТовары.Количество() Тогда
		Для каждого Т Из ПремиальныеТовары Цикл
			
			Если Т.Количество = 0 Тогда
				Сообщить("Не указано количество по премиальному товару в строке " + т.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
			
			//Если Т.Цена = 0 Тогда
			//	Сообщить("Не указана скидка по премиальному товару в строке " + т.НомерСтроки);
			//	Отказ = Истина;
			//КонецЕсли;
			
		КонецЦикла;
	Иначе
		Сообщить("Не заполнены премиальные товары!");
		Отказ = Истина;
	КонецЕсли; 
	
	Если ТипАкции = Справочники.ТипыАкций.СуммаЗаказа Тогда 
		Если Не ЗначениеЗаполнено(ПороговаяСумма) Тогда
			
			Сообщить("Не указана пороговая сумма");	
			Отказ = Истина;
			
		КонецЕсли; 
	Иначе
		Если ЦелевыеТовары.Количество()=0 Тогда
		
			Сообщить("Не заполнены целевые товары!");
			Отказ = Истина;
		
		КонецЕсли;		
	КонецЕсли; 
	
	АкцияДействует = Документы.Акция.ДействующиеАкции().Найти(Ссылка) <> Неопределено;
	Если ДополнительныеСвойства.Свойство("БезПоверок") = Ложь И Проведен И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если АкцияДействует Тогда
			
			Сообщить("Нельзя снимать акцепт действующей акции.");
			Отказ = Истина;
		
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьАвтоНазвание() Экспорт
	НазваниеАкции = ВидАкции;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	
КонецПроцедуры
