
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущиеПараметры") Тогда
		ПараметрыЗаписи.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ТекущиеПараметры));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Закрыть(ПоместитьТекущиеПараметрыВоВременноеХранилище());
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТекущиеПараметрыВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыЗаписи.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура СвойствоАвторВерсии(Команда)
	НайтиДобавитьСвойство("АвторВерсии");
КонецПроцедуры

&НаКлиенте
Процедура СвойствоВерсионированиеОбъектовКомментарийКВерсии(Команда)
	НайтиДобавитьСвойство("ВерсионированиеОбъектовКомментарийКВерсии");
КонецПроцедуры

&НаКлиенте
Процедура СвойствоЗагрузкаДанныхИзРабочегоМеста(Команда)
	НайтиДобавитьСвойство("ЗагрузкаДанныхИзРабочегоМеста");
КонецПроцедуры

&НаКлиенте
Процедура СвойствоОтключитьМеханизмРегистрацииОбъектов(Команда)
	НайтиДобавитьСвойство("ОтключитьМеханизмРегистрацииОбъектов");
КонецПроцедуры

&НаКлиенте
Процедура СвойствоПропуститьПроверкуЗапретаИзменения(Команда)
	НайтиДобавитьСвойство("ПропуститьПроверкуЗапретаИзменения");
КонецПроцедуры

&НаКлиенте
Процедура СвойствоСведенияОВерсииОбъекта(Команда)
	НайтиДобавитьСвойство("СведенияОВерсииОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура НайтиДобавитьСвойство(ИмяСвойства)
	
	НайденнаяСтрока = ПараметрыЗаписи.НайтиСтроки(Новый Структура("ИмяСвойства", ИмяСвойства));
	
	Если НайденнаяСтрока.Количество() = 0 Тогда
		НоваяСтрока = ПараметрыЗаписи.Добавить();
		НоваяСтрока.ИмяСвойства = ИмяСвойства;
		Элементы.ПараметрыЗаписи.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	Иначе
		Элементы.ПараметрыЗаписи.ТекущаяСтрока = НайденнаяСтрока[0].ПолучитьИдентификатор();
	КонецЕсли;
		
	
КонецПроцедуры
