
Процедура ОтменаНажатие(Элемент)
	глОтсечкаПростоя();
	РезультатОплаты.Отмена = Истина;
	Закрыть(РезультатОплаты);
КонецПроцедуры

Процедура ОкНажатие(Элемент)
	Оплата();
	Закрыть(РезультатОплаты);
КонецПроцедуры

Процедура ОплатаКартойНажатие(Элемент)
	глОтсечкаПростоя();
	Если ВозвратОплаты(докВозврат.ВариантОплаты = Справочники.ВариантыОплаты.Карта) Тогда
		Закрыть(РезультатОплаты);
	Иначе
		Закрыть(РезультатОплаты);
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	Товары = докВозврат.Товары;
	Коплате = 0;
	НадписьПолучено = "" + Коплате + глСимволРубля;	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
КонецПроцедуры

Процедура ОплатаНаличнымиНажатие(Элемент)
	глОтсечкаПростоя();
	Если ВозвратОплаты(докВозврат.ВариантОплаты = Справочники.ВариантыОплаты.Карта) Тогда
		Закрыть(РезультатОплаты);
	Иначе
		Закрыть(РезультатОплаты);
	КонецЕсли;

КонецПроцедуры

НадписьПолучено = "0";
Получено = 0;
ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);