Перем БылВерх, Разность,БылаВысота;
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПриОткрытии()
	ЭлементыФормы.КнопкаТочка.Доступность = Точность <> 0;
	
	Если ЗапретОтмены Тогда
		КнопкаОтмена = ЭлементыФормы.Отмена;
		КнопкаОтмена.Видимость = 0;
		КнопкаОк = ЭлементыФормы.КнопкаОк;
		КнопкаОкТень = ЭлементыФормы.ОкТень;
		
		Разность = БылВерх - КнопкаОк.Верх;
		
		РазрешитьЗакрытие = Ложь;
	Иначе
		КнопкаОтмена = ЭлементыФормы.Отмена;
		КнопкаОтмена.Видимость = 1;
		КнопкаОк = ЭлементыФормы.КнопкаОк;
		РазрешитьЗакрытие = Истина;
	КонецЕсли;
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	ЭлементыФормы.НадписьЗаголовок.Заголовок = ЭтаФорма.Заголовок;	
	Заголовок = "";
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	_Знач = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник,Событие,Данные);
	
	Если ЗначениеЗаполнено(_Знач) Тогда
		Закрыть( _Знач );
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаОКНажатие(Элемент)
	
	ОК();
	
КонецПроцедуры

Процедура КнопкаТочкаНажатие(Элемент)
	
	Точка();
	
КонецПроцедуры

Процедура КнопкаСбросНажатие(Элемент)
	
	Сброс();
	
КонецПроцедуры

Процедура Кнопка0Нажатие(Элемент)
	
	НажатиеКнопки("0");
	
КонецПроцедуры

Процедура Кнопка1Нажатие(Элемент)
	
	НажатиеКнопки("1");
	
КонецПроцедуры

Процедура Кнопка2Нажатие(Элемент)
	
	НажатиеКнопки("2");
	
КонецПроцедуры

Процедура Кнопка3Нажатие(Элемент)
	
	НажатиеКнопки("3");
	
КонецПроцедуры

Процедура Кнопка4Нажатие(Элемент)
	
	НажатиеКнопки("4");
	
КонецПроцедуры

Процедура Кнопка5Нажатие(Элемент)
	
	НажатиеКнопки("5");
	
КонецПроцедуры

Процедура Кнопка6Нажатие(Элемент)
	
	НажатиеКнопки("6");
	
КонецПроцедуры

Процедура Кнопка7Нажатие(Элемент)
	
	НажатиеКнопки("7");
	
КонецПроцедуры

Процедура Кнопка8Нажатие(Элемент)
	
	НажатиеКнопки("8");
	
КонецПроцедуры

Процедура Кнопка9Нажатие(Элемент)
	
	НажатиеКнопки("9");
	
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
	Закрыть();
КонецПроцедуры

Процедура КнопкаПлюсНажатие(Элемент)
	Плюс();
КонецПроцедуры

Процедура КнопкаМинусНажатие(Элемент)
	Минус();
КонецПроцедуры

Процедура КнопкаПлюс1Нажатие(Элемент)
	Умножить();
КонецПроцедуры

Процедура КнопкаРазделитьНажатие(Элемент)
	Разделить();
КонецПроцедуры

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота, ", Истина);



ЭлементыФормы.КнопкаПлюс.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.NumAdd);
ЭлементыФормы.КнопкаМинус.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.NumSubtract);
ЭлементыФормы.КнопкаПлюс1.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.NumMultiply);
ЭлементыФормы.КнопкаРазделить.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.NumDivide);
//РаботаСокнами.ПереназначитьКнопки("Авторизация", "Enter", "{LCtrl Down}{Enter}{LCtrl Up}");
//РаботаСокнами.ПереназначитьКнопки("ВводЧисла", "+VKBB", "{NumpadAdd}");
//РаботаСокнами.ПереназначитьКнопки("ВводЧисла", "+VKBD", "{NumpadSub}");
//РаботаСокнами.ПереназначитьКнопки("ВводЧисла", "+8", "{NumpadMult}");
//РаботаСокнами.ПереназначитьКнопки("ВводЧисла", "VKBE", "{NumpadDot}");
КнопкаОк = ЭлементыФормы.КнопкаОк;
БылВерх = КнопкаОк.Верх;
БылаВысота = КнопкаОк.Высота;