
Перем ПараметрыОкна Экспорт;	// Структура, определяет положение и размеры окна.

////////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ

// Вызывается из модуля обработки после вывода кнопок
//
Процедура УстановитьВидимостьСтрелок(НужнаСтрелкаВверх, НужнаСтрелкаВниз) Экспорт
	
	//// показываем только доступные направления листания
	//ЭлементыФормы.КнопкаСтрелкаВверх.Видимость = НужнаСтрелкаВверх;
	//ЭлементыФормы.КнопкаСтрелкаВниз .Видимость = НужнаСтрелкаВниз;
	
КонецПроцедуры

Процедура ОбновитьЗаголовок() Экспорт
	ОтключитьОбработчикОжидания("ОбновитьЗаголовок");
	Если ЗначениеЗаполнено(глРабочееМесто) И глПараметрыРМ.ВесыЕсть тогда
		ДлСтр = СтрНайти(Заголовок, "Вес:") - 1;
		Если ДлСтр > 0 Тогда
			Заголовок = Лев(Заголовок, ДлСтр) + "Вес: " + Формат(Вес,"ЧДЦ=3; ЧРД=.; ЧН=0.000");
		Иначе
			Заголовок = Заголовок + " Вес: " + Формат(Вес,"ЧДЦ=3; ЧРД=.; ЧН=0.000");
		КонецЕсли;
		ПодключитьОбработчикОжидания("ОбновитьЗаголовок", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
		
КонецПроцедуры

Процедура ПриОткрытии()
	
	ПодключитьОбработчикОжидания("ПослеОткрытия",0.1, 1);
КонецПроцедуры

Процедура ПослеОткрытия() Экспорт
	КнопкиДействияПередОткрытием(ЭтаФорма);
	
	//КнопкиДействияПередОткрытием(ЭтаФорма);
	Если РежимНастройки Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОкна = ПолучитьПараметрыОкна();
	ПараметрыОкна.Лево = 10;
	ПараметрыОкна.Верх = 10;
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
	ОбновитьЗаголовок();
КонецПроцедуры


Процедура ПриЗакрытии()
	
	Если РежимНастройки Тогда
		Если ПараметрыНастройки.РучнаяНастройкаПривязок Тогда
			ВладелецФормы.НастройкаДеревоКаталога = ДеревоКаталога;
		КонецЕсли; 
		
	Иначе
		ВладелецФормы.ПриЗакрытииМеню();	// это обязательно сначала
		ИнтерфейсРМ.ПриЗакрытииОкна();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Назначается динамически
//
Процедура КнопкаТовараНажатие(Элемент)
	
	ОбработкаНажатияКнопки(Элемент, ?(ВесСтабилен, Вес, Неопределено));
	
КонецПроцедуры

Процедура КнопкаПоискНажатие(Элемент)
	ВладелецФормы.ОповеститьОВыборе("Поиск");
	Закрыть();
КонецПроцедуры

Процедура ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ИдетФормированиеЭлементовФормы Тогда  
		Возврат;
	КонецЕсли;
	Если НРег(Элемент.Страницы.Получить(ТекущаяСтраница).Заголовок) = "выход" Тогда
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
	Иначе
		
		Код = СтрЗаменить(Панель.Страницы[ТекущаяСтраница].Имя,"Страница","");
		Настройка = Справочники.ТорговоеОборудование.НайтиПоКоду(Код);
		
		УстановкаНачальныхЗначений();
		Если ТекущаяНастройка <> Настройка Тогда
			ТекущаяНастройка = Настройка;
			ПолучитьПараметрыНастройки();
			КнопкиИнициализацияНастройки();
		Иначе
			ПолучитьПараметрыНастройки();
		КонецЕсли;
		
		
	КонецЕсли;

КонецПроцедуры
 
//////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

//СимволыШрифта = Шрифты.ПолучитьСимволыШрифта();
//ЭлементыФормы.КнопкаВыход.Заголовок = СимволыШрифта.Close_Alias;
//ЭлементыФормы.КнопкаПоиск.Заголовок = СимволыШрифта.Search;

#Область Инициализация

Если ЗначениеЗаполнено(глРабочееМесто) И глПараметрыРМ.ВесыЕсть Тогда
	Весы = глПараметрыРМ.Весы.ПолучитьОбъект();
	Обработка_Весы = Обработка_Весы;
	ИнициализацияТО(Весы, Обработка_Весы, глПараметрыРМ);
КонецЕсли;

#КонецОбласти