
Процедура ДокументСписокПриПолученииДанных(Элемент, ОформленияСтрок)
	Акции = Документы.Акция.ДействующиеАкции();
	Для каждого Т Из ОформленияСтрок Цикл
		Если Акции.Найти(Т.ДанныеСтроки.Ссылка) <> Неопределено Тогда
			Цвет = Т.ДанныеСтроки.Ссылка.ЦветЦелевыхТоваров.Получить();
			Если Цвет=Неопределено Тогда
			
				Цвет = WebЦвета.СветлоРозовый;
			
			КонецЕсли; 
			Т.ЦветФона = Цвет; 
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры


Процедура ДействияФормыПродлитьАкцию(Кнопка)
	ТекДок = ЭлементыФормы.ДокументСписок.ТекущиеДанные.Ссылка;
	Дата = ТекДок.ДатаПо;
	ВвестиДату(Дата,"Продлить до...",ЧастиДаты.Дата);
	Если Дата<ТекДок.ДатаПо Тогда
	
		Предупреждение("Срок действия можно только увеличивать");
		Возврат;
	
	КонецЕсли; 
	
	
	Об = ТекДок.ПолучитьОбъект();
	Если Ложь Тогда Об = Документы.Акция.СоздатьДокумент();	Расписание = Новый РасписаниеРегламентногоЗадания; КонецЕсли; 
	
	Об.ДатаПо = Дата;
	Расписание = ЗначениеИзСтрокиВнутр(Об.СериализованноеРасписание);
	Расписание.ДатаКонца = Дата;
	об.СериализованноеРасписание = ЗначениеВСтрокуВнутр(Расписание);
	Об.Записать();
КонецПроцедуры

Процедура ДействияФормыЗакрытьАкцию(Кнопка)
	ТекДок = ЭлементыФормы.ДокументСписок.ТекущиеДанные.Ссылка;
	
	Если Вопрос("Закрыть акцию?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		об = ТекДок.ПолучитьОбъект();
		об.ДополнительныеСвойства.Вставить("БезПоверок",Истина);
		Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
КонецПроцедуры
