
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Префикс) Тогда
		Сообщить("Не заполнено поле префикс!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ПроверкаПрефиксов() Тогда
		Сообщить("Префикс не уникален!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

// Проверка на уникальность префикса
//
Функция ПроверкаПрефиксов()

	// Проверить текущий префикс на повторябщиеся префиксы в таблицах ГруппыОплаты в местах релизации
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МестаРеализацииСвязьСГруппойОплат.Ссылка
		|ИЗ
		|	Справочник.МестаРеализации.ГруппыОплаты КАК МестаРеализацииСвязьСГруппойОплат
		|ГДЕ
		|	МестаРеализацииСвязьСГруппойОплат.Префикс = &Префикс";

	Запрос.УстановитьПараметр("Префикс", Префикс);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

Если Не ЭтоНовый() Тогда 
	ДопСвойства.Отбор.объект.Установить(Ссылка);
КонецЕсли;
