//////////////////////////////////////////////////////////////////////
//ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ОК(Кнопка)
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Логин) Тогда
		Сообщить("Необходимо заполнить ""Логин""!", СтатусСообщения.Важное);
		Отказ = Истина;		
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Пароль) Тогда
		Сообщить("Необходимо заполнить ""Пароль""!", СтатусСообщения.Важное);	
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыТО.Логин       = Логин;
	ПараметрыТО.Пароль      = Пароль;
	ПараметрыТО.Отправитель = Отправитель;

	Закрыть("ОК");
	
КонецПроцедуры

Процедура БалансНажатие(Элемент)
	
	Перем Баланс;
	
	Результат.Ошибка = Ложь;
    УзнатьБаланс(Баланс); 
	
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание);
	Иначе
		Предупреждение("Текущий баланс: " + Строка(Баланс));
	КонецЕсли;
		
КонецПроцедуры

Процедура СсылкаРегистрацияНажатие(Элемент)
	
	ЗапуститьПриложение("https://my.stream-telecom.ru/Account/Register");
	
КонецПроцедуры
